<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;19.&nbsp;&#32531;&#23384;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="up" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="previous" href="jms.html" title="Chapter&nbsp;18.&nbsp;&#24322;&#27493;&#21644;&#28040;&#24687;"><link rel="next" href="webservices.html" title="Chapter&nbsp;20.&nbsp;Web Services"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;19.&nbsp;&#32531;&#23384;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="jms.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="webservices.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="cache"></a>Chapter&nbsp;19.&nbsp;&#32531;&#23384;</h2></div></div><div></div></div><p>
		&#25968;&#25454;&#24211;&#25104;&#20026;&#20102;&#22823;&#22810;&#25968;&#20225;&#19994;&#24212;&#29992;&#30340;&#20027;&#35201;&#29942;&#39048;&#65292;&#20063;&#25104;&#20026;&#20102;&#36816;&#34892;&#29615;&#22659;&#20013;&#26368;&#19981;&#20855;&#20280;&#32553;&#24615;&#30340;&#23618;&#12290;PHP/Ruby&#30340;&#29992;&#25143;&#20250;&#35828;&#20160;&#20040;&#37117;&#19981;&#20849;&#20139;&#65288;share nothing&#65289;&#30340;&#26550;&#26500;&#29031;&#26679;&#20855;&#26377;&#24456;&#22909;&#30340;&#20280;&#32553;&#24615;&#12290;&#20174;&#34920;&#38754;&#19978;&#30475;&#20063;&#35768;&#26159;&#23545;&#30340;&#65292;&#21487;&#24796;&#25105;&#19981;&#30693;&#36947;&#26159;&#21542;&#23384;&#22312;&#36825;&#26679;&#30340;&#22810;&#29992;&#25143;&#24212;&#29992;&#65292;&#20854;&#23454;&#29616;&#26159;&#33021;&#22815;&#22312;&#38598;&#32676;&#30340;&#19981;&#21516;&#32467;&#28857;&#38388;&#19981;&#20849;&#20139;&#36164;&#28304;&#12290;&#36825;&#20123;&#20667;&#29916;&#30495;&#27491;&#24819;&#30340;&#26159;&#8220;&#38500;&#20102;&#25968;&#25454;&#24211;&#20197;&#22806;&#20160;&#20040;&#37117;&#19981;&#20849;&#20139;(Share nothing except for the database)&#8221;&#30340;&#26550;&#26500;&#12290;&#24403;&#28982;&#65292;&#20849;&#20139;&#25968;&#25454;&#24211;&#26159;&#22810;&#29992;&#25143;&#24212;&#29992;&#20280;&#32553;&#24615;&#30340;&#20027;&#35201;&#38382;&#39064;&#8212;&#8212;&#22240;&#27492;&#22768;&#31216;&#36825;&#26679;&#30340;&#26550;&#26500;&#20855;&#26377;&#39640;&#20280;&#32553;&#24615;&#26159;&#33618;&#35884;&#30340;&#65292;&#20320;&#21487;&#35201;&#30693;&#36947;&#23427;&#20204;&#33457;&#36153;&#20102;&#36825;&#20123;&#20154;&#30340;&#22823;&#37096;&#20998;&#26102;&#38388;&#12290;
    </p><p>
		&#36890;&#24120;&#65292;&#20960;&#20046;&#25152;&#26377;&#36890;&#36807;&#20849;&#20139;&#25968;&#25454;&#24211;&#20570;&#30340;&#20107;&#24773;<span class="emphasis"><em>&#24182;&#19981;</em></span>&#20540;&#24471;&#36825;&#26679;&#21435;&#20570;&#12290;
    </p><p>
		&#36825;&#23601;&#26159;&#32531;&#23384;&#65288;Cache&#65289;&#20135;&#29983;&#30340;&#21407;&#22240;&#12290;&#21999;&#65292;&#24403;&#28982;&#24182;&#19981;&#21482;&#26159;&#19968;&#20010;&#32531;&#23384;&#12290;&#19968;&#20010;&#35774;&#35745;&#33391;&#22909;&#30340;Seam&#24212;&#29992;&#23558;&#20855;&#26377;&#20016;&#23500;&#30340;&#22810;&#23618;&#32531;&#23384;&#31574;&#30053;&#65292;&#36825;&#20063;&#24433;&#21709;&#30528;&#24212;&#29992;&#30340;&#27599;&#19968;&#23618;&#65306;
    </p><div class="itemizedlist"><ul type="disc"><li><p>
				&#24403;&#28982;&#65292;&#25968;&#25454;&#24211;&#26377;&#23427;&#33258;&#24049;&#30340;&#32531;&#23384;&#65292;&#36825;&#26159;&#36229;&#32423;&#37325;&#35201;&#30340;&#65292;&#20294;&#26159;&#23427;&#19981;&#33021;&#20687;&#24212;&#29992;&#23618;&#30340;&#32531;&#23384;&#19968;&#26679;&#20855;&#26377;&#20280;&#32553;&#24615;&#12290;
            </p></li><li><p>
				&#23545;&#20174;&#25968;&#25454;&#24211;&#25552;&#21462;&#20986;&#30340;&#25968;&#25454;&#65292;&#20320;&#30340;ORM&#35299;&#20915;&#26041;&#26696;&#65288;Hibernate&#65292;&#25110;&#32773;&#21035;&#30340;JPA&#23454;&#29616;&#65289;&#20855;&#26377;&#20004;&#32423;&#32531;&#23384;&#12290;&#36825;&#26159;&#19968;&#31181;&#24456;&#24378;&#22823;&#30340;&#33021;&#21147;&#65292;&#20294;&#26159;&#32463;&#24120;&#34987;&#35823;&#29992;&#12290;&#22312;&#19968;&#20010;&#38598;&#32676;&#29615;&#22659;&#37324;&#65292;&#20445;&#25345;&#32531;&#23384;&#20013;&#30340;&#25968;&#25454;&#22312;&#25972;&#20010;&#38598;&#32676;&#20013;&#20855;&#26377;&#20107;&#21153;&#19968;&#33268;&#24615;&#65292;&#24182;&#19988;&#21644;&#25968;&#25454;&#24211;&#19968;&#33268;&#65292;&#20854;&#20195;&#20215;&#26159;&#30456;&#24403;&#26114;&#36149;&#30340;&#12290;&#36825;&#23545;&#20110;&#20849;&#20139;&#22312;&#22810;&#20010;&#29992;&#25143;&#38388;&#65292;&#19988;&#24456;&#23569;&#34987;&#26356;&#26032;&#30340;&#25968;&#25454;&#26368;&#26377;&#24847;&#20041;&#12290;&#22312;&#20256;&#32479;&#30340;&#26080;&#29366;&#24577;&#26550;&#26500;&#37324;&#65292;&#20154;&#20204;&#32463;&#24120;&#20351;&#29992;&#20108;&#32423;&#32531;&#23384;&#26469;&#20445;&#23384;&#20250;&#35805;&#29366;&#24577;&#12290;&#36825;&#31181;&#20570;&#27861;&#24635;&#26159;&#31967;&#31957;&#30340;&#65292;&#22312;Seam&#20013;&#26356;&#26159;&#22823;&#38169;&#29305;&#38169;&#30340;&#12290;
            </p></li><li><p>
				Seam&#20250;&#35805;&#19978;&#19979;&#25991;&#26159;&#20250;&#35805;&#29366;&#24577;&#30340;&#32531;&#23384;&#12290;&#23384;&#20648;&#20110;&#20250;&#35805;&#19978;&#19979;&#25991;&#20013;&#30340;&#32452;&#20214;&#21487;&#20197;&#20445;&#25345;&#24182;&#32531;&#23384;&#19982;&#24403;&#21069;&#29992;&#25143;&#20132;&#20114;&#30456;&#20851;&#30340;&#29366;&#24577;&#12290;
            </p></li><li><p>
				&#29305;&#21035;&#30340;&#65292;Seam&#31649;&#29702;&#30340;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#65288;&#25110;&#32773;&#19968;&#20010;&#25193;&#23637;&#21463;&#31649;EJB&#23481;&#22120;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#65292;&#23427;&#19982;&#20250;&#35805;&#33539;&#22260;&#30340;&#26080;&#29366;&#24577;&#20250;&#35805;Bean&#30456;&#20851;&#65289;&#25104;&#20026;&#20102;&#24403;&#21069;&#20250;&#35805;&#20013;&#25968;&#25454;&#30340;&#32531;&#23384;&#12290;&#36825;&#31181;&#32531;&#23384;&#36235;&#21521;&#20110;&#25317;&#26377;&#19968;&#20010;&#30456;&#24403;&#39640;&#30340;&#21629;&#20013;&#29575;&#65281;Seam&#20248;&#21270;&#20102;&#38598;&#32676;&#29615;&#22659;&#20013;&#21463;&#31649;Seam&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#30340;&#22797;&#21046;&#65292;&#20063;&#19981;&#38656;&#35201;&#20445;&#35777;&#25968;&#25454;&#24211;&#20107;&#21153;&#30340;&#19968;&#33268;&#24615;&#65288;&#20048;&#35266;&#38145;&#24050;&#36275;&#22815;&#65289;&#65292;&#22240;&#27492;&#20320;&#19981;&#24517;&#25285;&#24515;&#36825;&#31181;&#32531;&#23384;&#30340;&#24615;&#33021;&#38382;&#39064;&#65292;&#38500;&#38750;&#20320;&#25226;&#25104;&#21315;&#19978;&#19975;&#20010;&#23545;&#35937;&#35835;&#21462;&#21040;&#19968;&#20010;&#21333;&#29420;&#30340;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#20013;&#12290;
            </p></li><li><p>
				&#24212;&#29992;&#21487;&#20197;&#22312;Seam&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#32531;&#23384;&#38750;&#20107;&#21153;&#24615;&#29366;&#24577;&#12290;&#30456;&#24212;&#30340;&#65292;&#20445;&#23384;&#22312;&#24212;&#29992;&#19978;&#19979;&#25991;&#20013;&#30340;&#29366;&#24577;&#19981;&#33021;&#34987;&#38598;&#32676;&#20013;&#20854;&#23427;&#32467;&#28857;&#35775;&#38382;&#12290;
            </p></li><li><p>
				&#24212;&#29992;&#36890;&#36807;Seam&#30340; <tt class="literal">pojoCache</tt> &#32452;&#20214;&#21487;&#20197;&#32531;&#23384;&#20107;&#21153;&#24615;&#29366;&#24577;&#65292;&#36825;&#20010;&#32452;&#20214;&#25226;JBossCache&#38598;&#25104;&#21040;&#20102;Seam&#29615;&#22659;&#20013;&#12290;&#22914;&#26524;&#20320;&#22312;&#38598;&#32676;&#27169;&#24335;&#19979;&#36816;&#34892;&#20102;JBossCache&#65292;&#37027;&#20040;&#36825;&#20010;&#29366;&#24577;&#26159;&#21487;&#20197;&#34987;&#21035;&#30340;&#32467;&#28857;&#35775;&#38382;&#30340;&#12290;
            </p></li><li><p>
				&#26368;&#21518;&#65292;Seam&#35753;&#20320;&#33021;&#22815;&#32531;&#23384;&#29983;&#25104;&#30340;JSF&#39029;&#38754;&#30340;&#37096;&#20998;&#20869;&#23481;&#65288;rendered fragments&#65289;&#12290;&#19982;ORM&#30340;&#20108;&#32423;&#32531;&#23384;&#19981;&#19968;&#26679;&#30340;&#26159;&#65292;&#24403;&#25968;&#25454;&#21457;&#29983;&#21464;&#21270;&#26102;&#65292;&#36825;&#31181;&#32531;&#23384;&#19981;&#33021;&#33258;&#21160;&#30340;&#22833;&#25928;&#65292;&#22240;&#27492;&#20320;&#38656;&#35201;&#20889;&#24212;&#29992;&#20195;&#30721;&#26469;&#20351;&#23427;&#26174;&#24335;&#30340;&#22833;&#25928;&#65292;&#25110;&#32773;&#35774;&#32622;&#36866;&#24403;&#30340;&#36807;&#26399;&#31574;&#30053;&#12290;
            </p></li></ul></div><p>
		&#22914;&#35201;&#33719;&#24471;&#26356;&#22810;&#20851;&#20110;&#20108;&#32423;&#32531;&#23384;&#30340;&#20449;&#24687;&#65292;&#20320;&#21487;&#20197;&#21442;&#32771;&#20320;&#30340;ORM&#35299;&#20915;&#26041;&#26696;&#30340;&#25991;&#26723;&#65292;&#22240;&#20026;&#36825;&#26159;&#20010;&#26497;&#20026;&#22797;&#26434;&#30340;&#35805;&#39064;&#12290;&#22312;&#36825;&#33410;&#20013;&#25105;&#20204;&#20250;&#30452;&#25509;&#35752;&#35770;&#36890;&#36807; <tt class="literal">pojoCache</tt> &#32452;&#20214;&#20351;&#29992;JBossCache&#65292;&#25110;&#32773;&#36890;&#36807; <tt class="literal">&lt;s:cache&gt;</tt>&#25511;&#21046;&#20805;&#24403;&#39029;&#29255;&#27573;&#65288;page fragment&#65289;&#32531;&#23384;&#12290;
    </p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e12154"></a>19.1.&nbsp;&#22312;Seam&#20013;&#20351;&#29992;JBossCache</h2></div></div><div></div></div><p>
			&#20869;&#24314;&#30340; <tt class="literal">pojoCache</tt> &#32452;&#20214;&#29992;&#26469;&#31649;&#29702; <tt class="literal">org.jboss.cache.aop.PojoCache</tt> &#23454;&#20363;&#12290;&#20320;&#21487;&#20197;&#23433;&#20840;&#30340;&#25226;&#20219;&#20309;&#19981;&#21487;&#21464;&#30340;Java&#23545;&#35937;&#20445;&#23384;&#22312;&#32531;&#23384;&#37324;&#65292;&#28982;&#21518;&#23427;&#23558;&#36890;&#36807;&#38598;&#32676;&#34987;&#22797;&#21046;&#65288;&#20551;&#35774;&#25171;&#24320;&#20102;&#22797;&#21046;&#65289;&#12290;&#22914;&#26524;&#20320;&#24819;&#22312;&#32531;&#23384;&#37324;&#20445;&#23384;&#21487;&#21464;&#30340;Java&#23545;&#35937;&#65292;&#20320;&#38656;&#35201;&#36816;&#34892;JBossCache&#23383;&#33410;&#30721;&#39044;&#22788;&#29702;&#22120;&#26469;&#30830;&#20445;&#36825;&#20123;&#23545;&#35937;&#30340;&#21464;&#21270;&#33021;&#22815;&#33258;&#21160;&#30340;&#34987;&#25506;&#27979;&#21040;&#24182;&#34987;&#22797;&#21046;&#12290;
        </p><p>
			&#20026;&#20102;&#20351;&#29992; <tt class="literal">pojoCache</tt>&#65292;&#20320;&#38656;&#35201;&#20570;&#30340;&#23601;&#26159;&#25226;JBossCache jar&#25991;&#20214;&#25918;&#22312;classpath&#20013;&#65292;&#24182;&#25552;&#20379;&#19968;&#20010;&#21517;&#20026; <tt class="literal">treecache.xml</tt> &#30340;&#25991;&#20214;&#65292;&#23427;&#24212;&#35813;&#26377;&#19968;&#20010;&#21512;&#36866;&#30340;cache&#37197;&#32622;&#12290;JBossCache&#26377;&#24456;&#22810;&#35753;&#20154;&#35273;&#24471;&#24656;&#24598;&#21644;&#36855;&#24785;&#30340;&#37197;&#32622;&#65292;&#22240;&#27492;&#25105;&#20204;&#19981;&#22312;&#36825;&#37324;&#35752;&#35770;&#23427;&#20204;&#12290;&#35831;&#21442;&#32771;JBossCache&#25991;&#26723;&#26469;&#33719;&#24471;&#26356;&#22810;&#20449;&#24687;&#12290;
        </p><p>
            &#22312; <tt class="literal">examples/blog/resources/treecache.xml</tt> &#37324;&#26377;&#19968;&#20010; <tt class="literal">treecache.xml</tt> &#30340;&#33539;&#20363;&#12290;
        </p><p>
			&#23545;Seam&#30340;EAR&#37096;&#32626;&#65292;&#25105;&#20204;&#25512;&#33616;&#25226;JBossCache jar&#25991;&#20214;&#21644;&#37197;&#32622;&#25991;&#20214;&#30452;&#25509;&#25918;&#21040;EAR&#37324;&#12290;&#30830;&#20445;&#20320;&#22312;EAR&#30340;lib&#30446;&#24405;&#37324;&#25918;&#32622;&#20102; <tt class="literal">jboss-cache.jar</tt> &#21644; <tt class="literal">jgroups.jar</tt>&#12290;
        </p><p>
			&#29616;&#22312;&#20320;&#21487;&#20197;&#25226;&#32531;&#23384;&#27880;&#20837;&#21040;&#20219;&#20309;Seam&#32452;&#20214;&#65306;
        </p><pre class="programlisting">@Name("chatroom")
public class Chatroom {
    @In PojoCache pojoCache;

    public void join(String username) {
      try
      {
         Set&lt;String&gt; userList = (Set&lt;String&gt;) pojoCache.get("chatroom", "userList");
         if (userList==null)
         {
            userList = new HashSet&lt;String&gt;();
            pojoCache.put("chatroom", "userList", userList);
         }
         userList.put(username);
      }
      catch (CacheException ce)
      {
         throw new RuntimeException(ce);
      }
    }
}</pre><p>
			&#22914;&#26524;&#20320;&#24819;&#22312;&#24212;&#29992;&#20013;&#20351;&#29992;&#22810;&#20010;JBossCache&#37197;&#32622;&#65292;&#38656;&#35201;&#20351;&#29992; <tt class="literal">components.xml</tt>:
        </p><pre class="programlisting">&lt;core:pojo-cache name="myCache" cfg-resource-name="myown/cache.xml"/&gt;</pre></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e12200"></a>19.2.&nbsp;&#39029;&#29255;&#27573;&#32531;&#23384;</h2></div></div><div></div></div><p>
			&#20351;&#29992;JBossCache&#26368;&#26377;&#36259;&#30340;&#26159; <tt class="literal">&lt;s:cache&gt;</tt> &#26631;&#31614;&#65292;Seam&#29992;&#23427;&#26469;&#35299;&#20915;JSF&#30340;&#39029;&#29255;&#27573;&#32531;&#23384;&#38382;&#39064;&#12290;<tt class="literal">&lt;s:cache&gt;</tt> &#20869;&#37096;&#20351;&#29992;&#20102; <tt class="literal">pojoCache</tt>&#65292;&#22240;&#27492;&#20320;&#22312;&#20351;&#29992;&#23427;&#26102;&#38656;&#35201;&#36981;&#24490;&#19978;&#38754;&#21015;&#20986;&#30340;&#27493;&#39588;&#12290;&#65288;&#25226;jar&#25991;&#20214;&#25918;&#21040;EAR&#37324;&#65292;&#24182;&#36827;&#34892;&#20196;&#20154;&#24656;&#24598;&#30340;&#37197;&#32622;&#36873;&#39033;&#31561;&#12290;&#65289;
        </p><p>
			<tt class="literal">&lt;s:cache&gt;</tt>&#34987;&#29992;&#26469;&#32531;&#23384;&#19968;&#20123;&#19981;&#22826;&#21464;&#21270;&#30340;&#20869;&#23481;&#12290;&#20363;&#22914;&#25105;&#20204;blog&#27426;&#36814;&#39029;&#38754;&#26174;&#31034;&#30340;&#36817;&#26399;blog&#65306;
        </p><pre class="programlisting">&lt;s:cache key="recentEntries-#{blog.id}" region="welcomePageFragments"&gt;
   &lt;h:dataTable value="#{blog.recentEntries}" var="blogEntry"&gt;
      &lt;h:column&gt;
         &lt;h3&gt;#{blogEntry.title}&lt;/h3&gt;
         &lt;div&gt;
            &lt;s:formattedText value="#{blogEntry.body}"/&gt;
         &lt;/div&gt;
      &lt;/h:column&gt;
   &lt;/h:dataTable&gt;
&lt;/s:cache&gt;</pre><p>
			<tt class="literal">key</tt>&#20351;&#24471;&#27599;&#20010;&#39029;&#29255;&#27573;&#25317;&#26377;&#22810;&#20010;&#32531;&#23384;&#29256;&#26412;&#12290;&#22312;&#36825;&#31181;&#24773;&#24418;&#19979;&#65292;&#27599;&#20010;blog&#25317;&#26377;&#19968;&#20010;&#32531;&#23384;&#29256;&#26412;&#12290;<tt class="literal">region</tt> &#20915;&#23450;&#20102;&#25152;&#26377;&#29256;&#26412;&#37117;&#23558;&#20445;&#23384;&#22312;&#21738;&#20010;JBossCache&#32467;&#28857;&#37324;&#12290;&#19981;&#21516;&#32467;&#28857;&#21487;&#33021;&#26377;&#19981;&#21516;&#30340;&#36807;&#26399;&#31574;&#30053;&#12290;&#65288;&#36825;&#26159;&#20320;&#35774;&#32622;&#19978;&#36848;&#20196;&#20154;&#24656;&#24598;&#30340;&#37197;&#32622;&#36873;&#39033;&#20570;&#30340;&#20107;&#24773;&#12290;&#65289;
        </p><p>
			&#24403;&#28982;&#65292;<tt class="literal">&lt;s:cache&gt;</tt>&#30340;&#19968;&#20010;&#37325;&#35201;&#38382;&#39064;&#26159;&#23427;&#26080;&#27861;&#30693;&#36947;&#25968;&#25454;&#30340;&#21464;&#21270;&#65288;&#20363;&#22914;&#24403;&#21338;&#23458;&#20316;&#32773;&#21457;&#24067;&#19968;&#20010;&#26032;&#23454;&#20307;&#65289;&#12290;&#22240;&#27492;&#20320;&#38656;&#35201;&#33258;&#24049;&#31649;&#29702;&#34987;&#32531;&#23384;&#30340;&#29255;&#27573;&#12290;
        </p><pre class="programlisting">public void post() {
    ...
    entityManager.persist(blogEntry);
    pojoCache.remove("welcomePageFragments", "recentEntries-" + blog.getId() );
}</pre><p>
			&#21478;&#19968;&#31181;&#26041;&#27861;&#26159;&#65292;&#22914;&#26524;&#19981;&#24517;&#25226;&#25968;&#25454;&#30340;&#21464;&#21270;&#31435;&#21051;&#21453;&#39304;&#32473;&#29992;&#25143;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#22312;JbossCache&#32467;&#28857;&#19978;&#35774;&#32622;&#19968;&#20010;&#30701;&#30340;&#36807;&#26399;&#26102;&#38388;&#12290;
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="jms.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="webservices.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;18.&nbsp;&#24322;&#27493;&#21644;&#28040;&#24687;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;20.&nbsp;Web Services</td></tr></table></div></body></html>