<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;3.&nbsp;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#32452;&#20214;&#27169;&#22411;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="up" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="previous" href="gettingstarted.html" title="Chapter&nbsp;2.&nbsp;&#29992;Seam-gen&#36215;&#27493;"><link rel="next" href="xml.html" title="Chapter&nbsp;4.&nbsp;&#37197;&#32622;Seam&#32452;&#20214;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;3.&nbsp;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#32452;&#20214;&#27169;&#22411;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="gettingstarted.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="xml.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="concepts"></a>Chapter&nbsp;3.&nbsp;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#32452;&#20214;&#27169;&#22411;</h2></div></div><div></div></div><p>
        Seam&#20013;&#30340;&#20004;&#20010;&#26680;&#24515;&#27010;&#24565;&#26159; <span class="emphasis"><em>context&#65288;&#19978;&#19979;&#25991;&#65289;&#24605;&#24819;</em></span>&#21644; <span class="emphasis"><em>component&#65288;&#32452;&#20214;&#65289;&#24605;&#24819;</em></span>&#12290;&#32452;&#20214;&#26159;&#20855;&#26377;&#29366;&#24577;&#30340;&#23545;&#35937;&#65292;&#36890;&#24120;&#26159;EJB&#65292;&#32452;&#20214;&#30340;&#23454;&#20363;&#20250;&#21644;&#19978;&#19979;&#25991;&#32465;&#23450;&#65292;&#22312;&#27492;&#19978;&#19979;&#25991;&#20013;&#20855;&#26377;&#19968;&#20010;&#21517;&#23383;&#12290;<span class="emphasis"><em>Bijection&#65288;&#21452;&#21521;&#27880;&#20837;&#65289;</em></span>&#21487;&#20197;&#23558;&#20869;&#37096;&#30340;&#32452;&#20214;&#21517;&#65288;&#23454;&#20363;&#21464;&#37327;&#21517;&#65289;&#21035;&#21517;&#20026;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#21517;&#23383;&#65292;&#20801;&#35768;Seam&#21160;&#24577;&#32452;&#35013;&#32452;&#20214;&#26641;&#65292;&#36824;&#21487;&#20197;&#37325;&#26032;&#32452;&#35013;&#12290;
   </p><p>
        &#35753;&#25105;&#20204;&#20174;&#20102;&#35299;Seam&#20869;&#32622;&#30340;&#19978;&#19979;&#25991;&#24320;&#22987;&#12290;
   </p><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e2963"></a>3.1.&nbsp;Seam&#19978;&#19979;&#25991;</h2></div></div><div></div></div><p>
            Seam&#19978;&#19979;&#25991;&#26159;&#30001;&#26694;&#26550;&#21019;&#24314;&#21644;&#38144;&#27585;&#30340;&#12290;&#24212;&#29992;&#31243;&#24207;&#19981;&#33021;&#36890;&#36807;&#26174;&#24335;&#30340;Java API&#35843;&#29992;&#26469;&#25511;&#21046;&#19978;&#19979;&#25991;&#21010;&#20998;&#12290;&#19978;&#19979;&#25991;&#36890;&#24120;&#26159;&#38544;&#21547;&#30340;&#12290;&#28982;&#32780;&#65292;&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#65292;&#19978;&#19979;&#25991;&#21487;&#20197;&#36890;&#36807;annotation&#65288;&#27880;&#35299;&#65289;&#21010;&#20998;&#12290;
           </p><p>&#22522;&#26412;&#30340;Seam&#19978;&#19979;&#25991;&#26377;:</p><div class="itemizedlist"><ul type="disc"><li><p>Stateless context</p></li><li><p>Event &#65288;or request&#65289; context</p></li><li><p>Page context</p></li><li><p>Conversation context</p></li><li><p>Session context</p></li><li><p>Business process context</p></li><li><p>Application context</p></li></ul></div><p>
            &#20320;&#21487;&#33021;&#22312;servlet&#21450;&#30456;&#20851;&#35268;&#33539;&#20013;&#24050;&#32463;&#35265;&#36807;&#20854;&#20013;&#19968;&#20123;&#19978;&#19979;&#25991;&#20102;&#65292;&#20294;&#20854;&#20013;&#26377;&#20004;&#20010;&#21487;&#33021;&#20174;&#26410;&#35265;&#36807;&#65306;<span class="emphasis"><em>conversation context&#65288;&#19994;&#21153;&#23545;&#35805;&#19978;&#19979;&#25991;&#65289;</em></span>&#65292;&#21644; <span class="emphasis"><em>business process context&#65288;&#19994;&#21153;&#27969;&#31243;&#19978;&#19979;&#25991;&#65289;</em></span>&#12290;
            &#22312;Web&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#29366;&#24577;&#31649;&#29702;&#22914;&#27492;&#20940;&#20081;&#21644;&#23481;&#26131;&#20986;&#38169;&#30340;&#21407;&#22240;&#23601;&#26159;&#65292;&#20869;&#32622;&#30340;&#19977;&#20010;&#19978;&#19979;&#25991;&#65288;request, session &#21644;application&#65289;&#20174;&#19994;&#21153;&#36923;&#36753;&#30340;&#35282;&#24230;&#26469;&#30475;&#19981;&#26159;&#24456;&#26377;&#24847;&#20041;&#12290;
            &#20363;&#22914;&#65292;&#29992;&#25143;&#30331;&#24405;session&#30340;&#26500;&#24314;&#65292;&#23545;&#24212;&#29992;&#23454;&#38469;&#30340;&#24037;&#20316;&#27969;&#31243;&#26469;&#35828;&#23601;&#26159;&#30456;&#24403;&#38543;&#24847;&#30340;&#12290;
            &#22240;&#27492;&#65292;&#22823;&#37096;&#20998;&#30340;Seam&#32452;&#20214;&#34987;&#38480;&#23450;&#22312;&#19994;&#21153;&#20250;&#35805;&#25110;&#32773;&#19994;&#21153;&#27969;&#31243;&#19978;&#19979;&#25991;&#20013;&#65292;&#22240;&#20026;&#36825;&#20123;&#19978;&#19979;&#25991;&#20174;&#24212;&#29992;&#30340;&#35282;&#24230;&#26469;&#35828;&#26368;&#26377;&#24847;&#20041;&#12290;
       </p><p>
            &#35753;&#25105;&#20204;&#25353;&#39034;&#24207;&#26469;&#32771;&#23519;&#27599;&#20010;context&#65288;&#19978;&#19979;&#25991;&#65289;&#12290;
       </p><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3002"></a>3.1.1.&nbsp;Stateless context&#65288;&#26080;&#29366;&#24577;&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                &#37027;&#20123;&#30830;&#23454;&#27809;&#26377;&#29366;&#24577;&#30340;&#32452;&#20214;&#65288;&#20027;&#35201;&#26159;&#26080;&#29366;&#24577;Session Bean&#65289;&#24635;&#26159;&#36816;&#34892;&#22312;&#26080;&#29366;&#24577;&#19978;&#19979;&#25991;&#20013;&#65288;&#23454;&#38469;&#19978;&#23601;&#26159;&#19978;&#19979;&#25991;&#26080;&#20851;&#65289;&#12290;
                &#26080;&#29366;&#24577;&#32452;&#20214;&#27809;&#20160;&#20040;&#22826;&#22823;&#30340;&#24847;&#24605;&#65292;&#20063;&#26377;&#20105;&#35758;&#35748;&#20026;&#23427;&#20204;&#19981;&#21313;&#20998;&#38754;&#21521;&#23545;&#35937;&#12290;&#20294;&#19981;&#31649;&#24590;&#20040;&#26679;&#65292;&#23427;&#20204;&#36824;&#26159;&#24456;&#37325;&#35201;&#65292;&#24182;&#19988;&#36890;&#24120;&#24456;&#26377;&#29992;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3007"></a>3.1.2.&nbsp;Event context&#65288;&#20107;&#20214;&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                &#20107;&#20214;&#19978;&#19979;&#25991;&#26159;&#8220;&#26368;&#31364;&#8221;&#30340;&#26377;&#29366;&#24577;&#19978;&#19979;&#25991;&#65292;&#26159;Web Request &#19978;&#19979;&#25991;&#30340;&#27867;&#21270;&#65292;&#29992;&#20197;&#21253;&#21547;&#20854;&#20182;&#31181;&#31867;&#30340;&#20107;&#20214;&#12290;
                &#28982;&#32780;&#65292;&#19982;JSF&#35831;&#27714;&#30340;&#29983;&#21629;&#21608;&#26399;&#30456;&#20851;&#32852;&#30340;&#20107;&#20214;&#19978;&#19979;&#25991;&#26159;&#20107;&#20214;&#19978;&#19979;&#25991;&#26368;&#37325;&#35201;&#30340;&#23454;&#20363;&#65292;&#24182;&#19988;&#20063;&#26159;&#20320;&#26368;&#24120;&#25171;&#20132;&#36947;&#30340;&#12290;
                &#19982;&#20107;&#20214;&#19978;&#19979;&#25991;&#30456;&#20851;&#32852;&#30340;&#32452;&#20214;&#22312;&#35831;&#27714;&#32467;&#26463;&#26102;&#34987;&#38144;&#27585;&#65292;&#20294;&#26159;&#23427;&#20204;&#30340;&#29366;&#24577;&#33267;&#23569;&#22312;&#35831;&#27714;&#30340;&#29983;&#21629;&#21608;&#26399;&#20013;&#26159;&#23384;&#22312;&#24182;&#19988;&#26159;&#23450;&#20041;&#33391;&#22909;&#30340;&#12290;
           </p><p>
                &#24403;&#20320;&#36890;&#36807;RMI&#25110;&#32773;Seam Remoting&#35843;&#29992;Seam&#32452;&#20214;&#30340;&#26102;&#20505;&#65292;&#19968;&#20010;&#20107;&#20214;&#19978;&#19979;&#25991;&#23558;&#20026;&#36825;&#20010;&#35843;&#29992;&#32780;&#34987;&#21019;&#24314;&#21644;&#38144;&#27585;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3014"></a>3.1.3.&nbsp;Page context&#65288;&#39029;&#38754;&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                &#39029;&#38754;&#19978;&#19979;&#25991;&#20801;&#35768;&#20320;&#23558;&#29366;&#24577;&#19982;&#19968;&#20010;&#28210;&#26579;&#39029;&#38754;&#30340;&#23454;&#20363;&#30456;&#20851;&#32852;&#12290;
                &#20320;&#21487;&#20197;&#22312;Event Listener&#20013;&#21021;&#22987;&#21270;&#29366;&#24577;&#65292;&#25110;&#32773;&#22312;&#23454;&#38469;&#28210;&#26579;&#39029;&#38754;&#30340;&#26102;&#20505;&#21021;&#22987;&#21270;&#29366;&#24577;&#65292;&#20219;&#20309;&#28304;&#20110;&#35813;&#39029;&#38754;&#30340;&#20107;&#20214;&#37117;&#21487;&#20197;&#35775;&#38382;&#21040;&#36825;&#20123;&#29366;&#24577;&#12290;
                &#36825;&#22312;&#25903;&#25345;&#20687;&#21487;&#28857;&#20987;&#21015;&#34920;&#36825;&#31181;&#30340;&#21151;&#33021;&#26102;&#29305;&#21035;&#26377;&#29992;&#65292;&#21015;&#34920;&#30340;&#20869;&#23481;&#36890;&#36807;&#26381;&#21153;&#22120;&#31471;&#30340;&#25968;&#25454;&#21464;&#21270;&#20135;&#29983;&#12290;
                &#23454;&#38469;&#19978;&#29366;&#24577;&#34987;&#24207;&#21015;&#21270;&#21040;&#20102;&#23458;&#25143;&#31471;&#65292;&#22240;&#27492;&#22312;&#22810;&#31383;&#21475;&#25805;&#20316;&#25110;&#32773;&#22238;&#36864;&#25353;&#38062;&#30340;&#26102;&#20505;&#65292;&#36825;&#31181;&#32467;&#26500;&#26159;&#38750;&#24120;&#20581;&#22766;&#30340;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3019"></a>3.1.4.&nbsp;Conversation context&#65288;&#19994;&#21153;&#20250;&#35805;&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                &#19994;&#21153;&#20250;&#35805;&#19978;&#19979;&#25991;&#26159;Seam&#20013;&#26368;&#26680;&#24515;&#30340;&#27010;&#24565;&#12290;<span class="emphasis"><em>conversation&#65288;&#19994;&#21153;&#20250;&#35805;&#65289;</em></span>&#26159;&#20174;&#29992;&#25143;&#30340;&#35270;&#35282;&#30475;&#24453;&#30340;&#19968;&#20010;&#24037;&#20316;&#21333;&#20803;&#12290;
                &#23427;&#21487;&#33021;&#36328;&#36234;&#19982;&#29992;&#25143;&#20132;&#20114;&#30340;&#22810;&#20010;Servlet&#12289;&#22810;&#20010;&#35831;&#27714;&#65292;&#21644;&#22810;&#20010;&#25968;&#25454;&#24211;&#20107;&#21153;&#12290;&#20294;&#26159;&#23545;&#29992;&#25143;&#26469;&#35828;&#65292;&#19968;&#20010;&#19994;&#21153;&#20250;&#35805;&#35299;&#20915;&#19968;&#20010;&#21333;&#19968;&#30340;&#38382;&#39064;&#12290;
                &#20363;&#22914;&#35828;&#65306;&#8220;&#39044;&#35746;&#37202;&#24215;&#8221;&#65292;&#8220;&#25209;&#20934;&#21512;&#21516;&#8221;&#65292;&#8220;&#21019;&#24314;&#35746;&#21333;&#8221;&#37117;&#26159;&#19994;&#21153;&#20250;&#35805;&#12290;
                &#20320;&#21487;&#20197;&#23558;&#19994;&#21153;&#20250;&#35805;&#29702;&#35299;&#25104;&#23545;&#19968;&#20010;&#8220;use case&#65288;&#29992;&#20363;&#65289;&#8221;&#25110;&#8220;user story&#65288;&#29992;&#25143;&#25925;&#20107;&#65289;&#8221;&#30340;&#23454;&#29616;&#65292;&#24403;&#28982;&#29305;&#23450;&#30340;&#19994;&#21153;&#20851;&#32852;&#24182;&#38750;&#19982;&#27492;&#31867;&#20363;&#23376;&#23436;&#20840;&#19968;&#33268;&#12290; 
           </p><p>
                &#19994;&#21153;&#20250;&#35805;&#20445;&#23384;&#20851;&#20110;&#8220;&#22312;&#27492;&#31383;&#21475;&#20013;&#65292;&#29992;&#25143;&#27491;&#22312;&#24178;&#20160;&#20040;&#8221;&#30340;&#29366;&#24577;&#12290;&#22312;&#20219;&#20309;&#26102;&#38388;&#65292;&#19968;&#20010;&#29992;&#25143;&#21487;&#33021;&#21516;&#26102;&#20301;&#20110;&#22810;&#20010;&#19994;&#21153;&#20250;&#35805;&#27963;&#21160;&#20013;&#65292;&#19968;&#33324;&#26159;&#22312;&#20960;&#20010;&#19981;&#21516;&#31383;&#21475;&#20013;&#12290;
                &#19994;&#21153;&#20250;&#35805;&#19978;&#19979;&#25991;&#35753;&#25105;&#20204;&#21487;&#20197;&#30830;&#20445;&#19981;&#21516;&#19994;&#21153;&#20250;&#35805;&#30340;&#29366;&#24577;&#19981;&#20250;&#20114;&#30456;&#24178;&#25200;&#65292;&#19981;&#20250;&#23548;&#33268;Bug&#12290;
           </p><p>
                &#20320;&#21487;&#33021;&#35201;&#33457;&#19978;&#19968;&#28857;&#26102;&#38388;&#25165;&#33021;&#20064;&#24815;&#20197;&#36825;&#19968;&#19994;&#21153;&#20250;&#35805;&#30340;&#35266;&#28857;&#26469;&#24605;&#32771;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;
                &#20294;&#19968;&#26086;&#20320;&#20064;&#24815;&#20110;&#23427;&#65292;&#20320;&#20250;&#21916;&#27426;&#19978;&#36825;&#20010;&#26415;&#35821;&#65292;&#24182;&#19988;&#20877;&#19981;&#20250;&#19981;&#29992;&#19994;&#21153;&#20250;&#35805;&#26469;&#24605;&#32771;&#20102;&#65281;
           </p><p>
                &#19968;&#20123;&#19994;&#21153;&#20250;&#35805;&#20165;&#23384;&#22312;&#22312;&#19968;&#27425;&#35831;&#27714;&#20013;&#12290;&#36328;&#22495;&#22810;&#20010;&#35831;&#27714;&#30340;&#19994;&#21153;&#20250;&#35805;&#24517;&#39035;&#36890;&#36807;Seam&#25552;&#20379;&#30340;annotation&#27880;&#35299;&#26469;&#21010;&#20998;&#12290;
           </p><p>
                &#19968;&#20123;&#19994;&#21153;&#20250;&#35805;&#21516;&#26102;&#20063;&#26159;<span class="emphasis"><em>tasks&#65288;&#20219;&#21153;&#65289;</em></span>&#12290;&#20219;&#21153;&#26159;&#19968;&#31181;&#19994;&#21153;&#20250;&#35805;&#65292;&#23427;&#29305;&#25351;&#19968;&#20010;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#19994;&#21153;&#27969;&#31243;&#65292;&#24403;&#27491;&#30830;&#23436;&#25104;&#21518;&#65292;&#21487;&#33021;&#20250;&#35302;&#21457;&#19968;&#20010;&#19994;&#21153;&#27969;&#31243;&#29366;&#24577;&#30340;&#36716;&#25442;&#12290;Seam&#20026;&#20219;&#21153;&#21010;&#20998;&#25552;&#20379;&#20102;&#19987;&#38376;&#30340;&#27880;&#35299;&#12290;
           </p><p>
                &#19994;&#21153;&#23545;&#35805;&#21487;&#20197;&#26159;<span class="emphasis"><em>nested&#65288;&#23884;&#22871;&#65289;</em></span>&#30340;&#65292;&#19968;&#20010;&#19994;&#21153;&#23545;&#35805;&#23884;&#22871;&#8220;&#22312;&#8221;&#19968;&#20010;&#26356;&#22823;&#30340;&#19994;&#21153;&#23545;&#35805;&#20013;&#12290;&#36825;&#26159;&#19968;&#39033;&#39640;&#32423;&#29305;&#24615;&#12290;
           </p><p>
                &#36890;&#24120;&#65292;&#19994;&#21153;&#23545;&#35805;&#29366;&#24577;&#23454;&#38469;&#19978;&#30001;Seam&#20445;&#23384;&#22312;Servlet Session &#20013;&#65292;&#36328;&#36234;&#35831;&#27714;&#12290;Seam&#23454;&#29616;&#20102;&#21487;&#37197;&#32622;&#30340; <span class="emphasis"><em>conversation timeout</em></span>&#65292;&#21487;&#20197;&#33258;&#21160;&#38144;&#27585;&#19981;&#27963;&#21160;&#30340;&#19994;&#21153;&#20250;&#35805;&#65292;&#36825;&#23601;&#21487;&#20197;&#30830;&#20445;&#65292;&#22914;&#26524;&#29992;&#25143;&#21462;&#28040;&#23545;&#35805;&#65292;&#29992;&#25143;&#30340;&#30331;&#24405;Session&#20013;&#20445;&#23384;&#30340;&#29366;&#24577;&#19981;&#20250;&#26080;&#38480;&#22686;&#38271;&#12290;
           </p><p>
                &#23545;&#20110;&#22312;&#19968;&#20010;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#19994;&#21153;&#20250;&#35805;&#20013;&#25152;&#20135;&#29983;&#30340;&#24182;&#21457;&#35831;&#27714;&#65292;Seam&#25353;&#39034;&#24207;&#25191;&#34892;&#12290;
           </p><p>
                &#38500;&#27492;&#20043;&#22806;&#65292;Seam&#20063;&#21487;&#20197;&#37197;&#32622;&#25104;&#25226;&#23545;&#35805;&#29366;&#24577;&#20445;&#23384;&#22312;&#23458;&#25143;&#31471;&#27983;&#35272;&#22120;&#20013;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3052"></a>3.1.5.&nbsp;Session context&#65288;Session&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                Session&#19978;&#19979;&#25991;&#20445;&#23384;&#19982;&#29992;&#25143;&#30331;&#24405;session&#30456;&#20851;&#32852;&#30340;&#29366;&#24577;&#12290;&#34429;&#28982;&#24403;&#38656;&#35201;&#22312;&#22810;&#20010;&#19994;&#21153;&#20250;&#35805;&#20013;&#20132;&#25442;&#29366;&#24577;&#30340;&#26102;&#20505;&#36825;&#24456;&#26377;&#29992;&#65292;&#20294;&#25105;&#20204;&#19968;&#33324;&#19981;&#24314;&#35758;&#20351;&#29992;Session &#19978;&#19979;&#25991;&#20445;&#23384;&#32452;&#20214;&#65292;&#38500;&#38750;&#26159;&#20445;&#23384;&#26377;&#20851;&#30331;&#24405;&#29992;&#25143;&#30340;&#20840;&#23616;&#20449;&#24687;&#12290;
           </p><p>
                &#22312;JSR-168 Portal&#29615;&#22659;&#19979;&#65292;Session&#19978;&#19979;&#25991;&#20195;&#34920;Portlet&#19978;&#19979;&#25991;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3059"></a>3.1.6.&nbsp;Business process context &#65288;&#19994;&#21153;&#27969;&#31243;&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                &#19994;&#21153;&#27969;&#31243;&#19978;&#19979;&#25991;&#20445;&#23384;&#20102;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#19994;&#21153;&#27969;&#31243;&#30456;&#20851;&#30340;&#29366;&#24577;&#12290;&#36825;&#31181;&#29366;&#24577;&#30001;BPM&#24341;&#25806;&#65288;jBPM&#65289;&#31649;&#29702;&#21644;&#25345;&#20037;&#21270;&#12290;
                &#19994;&#21153;&#27969;&#31243;&#36328;&#36234;&#22810;&#20010;&#29992;&#25143;&#30340;&#20132;&#20114;&#65292;&#22240;&#27492;&#29366;&#24577;&#22312;&#22810;&#20010;&#29992;&#25143;&#20043;&#38388;&#36890;&#36807;&#33391;&#22909;&#23450;&#20041;&#30340;&#26041;&#24335;&#20849;&#20139;&#12290;
                &#24403;&#21069;&#30340;&#20219;&#21153;&#20915;&#23450;&#24403;&#21069;&#30340;&#19994;&#21153;&#27969;&#31243;&#23454;&#20363;&#65292;&#19994;&#21153;&#27969;&#31243;&#30340;&#29983;&#21629;&#21608;&#26399;&#36890;&#36807;&#22806;&#32622;&#30340; <span class="emphasis"><em>process definition language&#65288;&#27969;&#31243;&#23450;&#20041;&#35821;&#35328;&#65289;</em></span> &#26469;&#23450;&#20041;&#65292;&#22240;&#27492;&#27809;&#26377;&#29305;&#21035;&#30340;annotation&#27880;&#35299;&#29992;&#20110;&#21010;&#20998;&#19994;&#21153;&#27969;&#31243;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3067"></a>3.1.7.&nbsp;Application context&#65288;&#24212;&#29992;&#19978;&#19979;&#25991;&#65289;</h3></div></div><div></div></div><p>
                Application&#19978;&#19979;&#25991;&#23601;&#26159;Servlet&#35268;&#33539;&#20013;&#30340;Servlet&#19978;&#19979;&#25991;&#12290;&#24212;&#29992;&#31243;&#24207;&#19978;&#19979;&#25991;&#22312;&#20445;&#23384;&#38745;&#24577;&#20449;&#24687;&#26041;&#38754;&#26377;&#29992;&#65292;&#20363;&#22914;&#37197;&#32622;&#25968;&#25454;&#65292;&#24341;&#29992;&#25968;&#25454;&#25110;&#32773;&#20803;&#27169;&#22411;&#12290;
                &#20363;&#22914;&#65292;Seam&#25226;&#33258;&#24049;&#30340;&#37197;&#32622;&#21644;&#20803;&#27169;&#22411;&#20445;&#23384;&#22312;&#24212;&#29992;&#31243;&#24207;&#19978;&#19979;&#25991;&#20013;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3072"></a>3.1.8.&nbsp;Context variables&#65288;&#19978;&#19979;&#25991;&#21464;&#37327;&#65289;</h3></div></div><div></div></div><p>
                &#19978;&#19979;&#25991;&#23450;&#20041;&#20102;&#21629;&#21517;&#31354;&#38388;&#65292;&#19968;&#32452; <span class="emphasis"><em>context variables&#65288;&#19978;&#19979;&#25991;&#21464;&#37327;&#65289;</em></span>&#12290;
                &#36825;&#20123;&#24037;&#20316;&#24456;&#31867;&#20284;Servlet&#35268;&#33539;&#20013;&#23545;Session&#25110;Request attributes&#30340;&#23450;&#20041;&#12290;
                &#20320;&#21487;&#20197;&#32465;&#23450;&#20219;&#20309;&#20320;&#21916;&#27426;&#30340;&#20540;&#21040;Context Variable&#65292;&#20294;&#36890;&#24120;&#25105;&#20204;&#20250;&#32465;&#23450;Seam&#32452;&#20214;&#23454;&#20363;&#21040;Context Variables&#12290;
           </p><p>
                &#22240;&#27492;&#65292;&#22312;&#19978;&#19979;&#25991;&#20013;&#65292;&#32452;&#20214;&#23454;&#20363;&#26159;&#36890;&#36807;&#19978;&#19979;&#25991;&#21464;&#37327;&#21517;&#23383;&#26469;&#36776;&#21035;&#30340;&#65288;&#36890;&#24120;&#26159;&#36825;&#26679;&#65292;&#20294;&#24182;&#38750;&#32477;&#23545;&#65292;&#23601;&#21644;&#32452;&#20214;&#21517;&#31216;&#19968;&#26679;&#65289;&#12290;
                &#20320;&#21487;&#20197;&#36890;&#36807;&#31243;&#24207;&#22312;&#29305;&#23450;&#33539;&#22260;&#20869;&#35775;&#38382;&#34987;&#21629;&#21517;&#30340;&#32452;&#20214;&#23454;&#20363;&#65292;&#36825;&#26159;&#36890;&#36807; <tt class="literal">Contexts</tt> &#31867;&#36827;&#34892;&#30340;&#65292;&#23427;&#25552;&#20379;&#20102;&#23545; <tt class="literal">Context</tt> &#25509;&#21475;&#30340;&#20960;&#20010;&#32447;&#31243;&#32465;&#23450;&#30340;&#23454;&#20363;&#30340;&#35775;&#38382;&#65306;
           </p><pre class="programlisting">User user = (User) Contexts.getSessionContext().get("user");</pre><p>
                &#20320;&#20063;&#21487;&#20197;&#36890;&#36807;&#21517;&#23383;&#26469;&#35774;&#32622;&#25110;&#20462;&#25913;&#21464;&#37327;&#20540;&#65306;
           </p><pre class="programlisting">Contexts.getSessionContext().set("user", user);</pre><p>
                &#20294;&#36890;&#24120;&#65292;&#25105;&#20204;&#36890;&#36807;&#27880;&#23556;&#65288;injection&#65289;&#26469;&#20174;&#19978;&#19979;&#25991;&#20013;&#33719;&#24471;&#32452;&#20214;&#65292;&#24182;&#19988;&#36890;&#36807;&#21453;&#21521;&#27880;&#23556;&#65288;outjection&#65289;&#25226;&#32452;&#20214;&#23454;&#20363;&#36820;&#22238;&#19978;&#19979;&#25991;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3096"></a>3.1.9.&nbsp;Context&#25628;&#32034;&#20248;&#20808;&#32423;</h3></div></div><div></div></div><p>
                &#26377;&#26102;&#20505;&#22914;&#19978;&#38754;&#30340;&#20363;&#23376;&#25152;&#31034;&#65292;&#32452;&#20214;&#23454;&#20363;&#26159;&#20174;&#26576;&#20010;&#29305;&#23450;&#30340;&#24050;&#30693;&#33539;&#22260;&#20869;&#33719;&#21462;&#30340;&#12290;
                &#20854;&#20182;&#30340;&#26102;&#20505;&#21017;&#26159;&#36890;&#36807; <span class="emphasis"><em>priority order(&#20248;&#20808;&#32423;&#39034;&#24207;)</em></span> &#22312;&#25152;&#26377;&#26377;&#29366;&#24577;&#33539;&#22260;&#20869;&#25628;&#23547;&#12290;&#36825;&#20010;&#39034;&#24207;&#26159;&#36825;&#26679;&#30340;&#65306;
           </p><div class="itemizedlist"><ul type="disc"><li><p>Event context</p></li><li><p>Page context</p></li><li><p>Conversation context</p></li><li><p>Session context</p></li><li><p>Business process context</p></li><li><p>Application context</p></li></ul></div><p>
                &#20320;&#21487;&#20197;&#36890;&#36807;&#35843;&#29992; <tt class="literal">Contexts.lookupInStatefulContexts()</tt> &#26469;&#25191;&#34892;&#24102;&#20248;&#20808;&#32423;&#30340;&#25628;&#32034;&#12290;&#20320;&#22312;JSF&#39029;&#38754;&#20013;&#36890;&#36807;&#21517;&#23383;&#35775;&#38382;&#32452;&#20214;&#30340;&#26102;&#20505;&#65292;&#25191;&#34892;&#30340;&#23601;&#26159;&#36825;&#31181;&#24102;&#20248;&#20808;&#32423;&#30340;&#25628;&#32034;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3128"></a>3.1.10.&nbsp;&#24182;&#21457;&#27169;&#22411;</h3></div></div><div></div></div><p>
                Servlet&#21644;EJB&#35268;&#33539;&#37117;&#27809;&#26377;&#23450;&#20041;&#20219;&#20309;&#20851;&#20110;&#22914;&#20309;&#31649;&#29702;&#26469;&#33258;&#21516;&#19968;&#20010;&#23458;&#25143;&#31471;&#30340;&#24182;&#21457;&#35831;&#27714;&#30340;&#26465;&#27454;&#12290;
                Servlet&#23481;&#22120;&#31616;&#21333;&#22320;&#35753;&#25152;&#26377;&#30340;&#32447;&#31243;&#24182;&#21457;&#36816;&#34892;&#65292;&#25226;&#32447;&#31243;&#36164;&#28304;&#23433;&#20840;&#20849;&#20139;&#30340;&#20219;&#21153;&#20132;&#32473;&#24212;&#29992;&#31243;&#24207;&#20195;&#30721;&#12290;
                EJB&#23481;&#22120;&#20801;&#35768;&#26080;&#29366;&#24577;&#32452;&#20214;&#24182;&#21457;&#35775;&#38382;&#65292;&#20294;&#22914;&#26524;&#24182;&#21457;&#35775;&#38382;&#19968;&#20010;&#26377;&#29366;&#24577;Session Bean,&#23601;&#20250;&#25243;&#20986;&#19968;&#20010;&#24322;&#24120;&#12290;
           </p><p>
                &#26087;&#24335;&#30340;Web&#24212;&#29992;&#31243;&#24207;&#26159;&#22260;&#32469;&#32454;&#31890;&#24230;&#30340;&#21516;&#27493;&#35831;&#27714;&#32534;&#20889;&#30340;&#65292;&#22240;&#27492;&#36825;&#31181;&#34892;&#20026;&#21487;&#33021;&#36824;OK&#12290;
                &#20294;&#26159;&#23545;&#29616;&#20195;&#30340;&#31243;&#24207;&#32780;&#35328;&#65292;&#30001;&#20110;&#22823;&#37327;&#20351;&#29992;&#20102;&#24456;&#22810;&#32454;&#31890;&#24230;&#30340;&#24322;&#27493;&#65288;AJAX&#65289;&#35831;&#27714;&#65292;&#24182;&#21457;&#26159;&#23454;&#38469;&#23384;&#22312;&#30340;&#65292;&#24182;&#19988;&#24517;&#39035;&#34987;&#31243;&#24207;&#27169;&#22411;&#25903;&#25345;&#12290;
                Seam&#22312;&#20854;&#19978;&#19979;&#25991;&#27169;&#22411;&#20013;&#21152;&#20837;&#20102;&#24182;&#21457;&#31649;&#29702;&#23618;&#12290;
           </p><p>
                Seam Session &#21644;&#24212;&#29992;&#19978;&#19979;&#25991;&#26159;&#22810;&#32447;&#31243;&#30340;&#12290;Seam&#20801;&#35768;&#22312;&#19968;&#20010;&#19978;&#19979;&#25991;&#20013;&#24182;&#21457;&#35831;&#27714;&#65292;&#24182;&#21457;&#22788;&#29702;&#12290;&#20107;&#20214;&#65288;Event&#65289;&#21644;&#39029;&#38754;&#65288;Page&#65289;&#19978;&#19979;&#25991;&#33258;&#28982;&#26159;&#21333;&#32447;&#31243;&#30340;&#12290;
                &#19994;&#21153;&#27969;&#31243;&#65288;business process&#65289;&#19978;&#19979;&#25991;&#20005;&#26684;&#32780;&#35328;&#26159;&#22810;&#32447;&#31243;&#30340;&#65292;&#20294;&#23454;&#38469;&#24773;&#20917;&#20013;&#24182;&#21457;&#24456;&#23569;&#35265;&#65292;&#22240;&#27492;&#22823;&#22810;&#25968;&#24773;&#20917;&#19981;&#20250;&#20986;&#29616;&#24182;&#21457;&#12290;
                &#26368;&#21518;&#65292;Seam&#20026;Conversation Context&#25552;&#20379;&#20102; <span class="emphasis"><em>&#27599;&#23545;&#35805;&#27599;&#36827;&#31243;&#21333;&#32447;&#31243;</em></span> &#27169;&#22411;&#65292;&#36825;&#26159;&#36890;&#36807;&#25226;&#21516;&#19968;&#20010;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#23545;&#35805;&#19978;&#19979;&#25991;&#20013;&#30340;&#24182;&#21457;&#35831;&#27714;&#24207;&#21015;&#21270;&#23454;&#29616;&#30340;&#12290;
           </p><p>
                &#22240;&#20026;Session&#19978;&#19979;&#25991;&#26159;&#22810;&#32447;&#31243;&#30340;&#65292;&#24182;&#19988;&#32463;&#24120;&#21253;&#21547;&#19981;&#31283;&#23450;&#30340;&#29366;&#24577;&#65292;&#25152;&#20197;Session&#33539;&#22260;&#20869;&#30340;&#32452;&#20214;&#24635;&#26159;&#34987;Seam&#20445;&#25252;&#20197;&#38450;&#27490;&#24182;&#21457;&#25805;&#20316;&#12290;
                Seam&#40664;&#35748;&#25226;&#38024;&#23545;Session&#33539;&#22260;&#30340;Session Bean&#21644;JavaBean&#30340;&#35831;&#27714;&#24207;&#21015;&#21270;&#65288;&#24182;&#19988;&#26816;&#27979;&#12289;&#35299;&#20915;&#20219;&#20309;&#21457;&#29983;&#30340;&#27515;&#38145;&#65289;&#12290;
                &#23545;Application Scoped&#30340;&#32452;&#20214;&#26469;&#35828;&#65292;&#36825;&#21364;&#19981;&#26159;&#40664;&#35748;&#34892;&#20026;&#65292;&#22240;&#20026;Application Scoped&#30340;&#32452;&#20214;&#36890;&#24120;&#19981;&#20250;&#21253;&#21547;&#30340;&#19981;&#31283;&#23450;&#29366;&#24577;&#65292;&#24182;&#19988;&#22312;&#20840;&#23616;&#32423;&#21035;&#36827;&#34892;&#21516;&#27493;&#20195;&#20215; <span class="emphasis"><em>&#26497;&#20854;</em></span> &#39640;&#26114;&#12290;&#20294;&#26159;&#65292;&#20320;&#21487;&#20197;&#24378;&#21046;&#23545;&#20219;&#20309;Session Bean&#25110;JavaBean&#32452;&#20214;&#37319;&#29992;&#24207;&#21015;&#21270;&#30340;&#32447;&#31243;&#27169;&#22411;&#65292;&#35201;&#20570;&#30340;&#23601;&#26159;&#21152;&#19978; <tt class="literal">@Synchronized</tt> &#27880;&#35299;&#12290;
           </p><p>
                &#24182;&#21457;&#27169;&#22411;&#24847;&#21619;&#30528;AJAX&#23458;&#25143;&#31471;&#21487;&#20197;&#23433;&#20840;&#30340;&#20351;&#29992;&#19981;&#31283;&#23450;&#30340;Session&#21644;&#20250;&#35805;&#29366;&#24577;&#65292;&#24182;&#19988;&#19981;&#38656;&#35201;&#24320;&#21457;&#32773;&#20570;&#20219;&#20309;&#29305;&#21035;&#30340;&#24037;&#20316;&#12290;
           </p></div></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3150"></a>3.2.&nbsp;Seam &#32452;&#20214;</h2></div></div><div></div></div><p>
            Seam&#32452;&#20214;&#26159;POJO&#65288;Plain Old Java Objects&#65289;&#12290;&#29305;&#21035;&#22320;&#65292;&#20182;&#20204;&#26159;JavaBean&#25110;&#32773;EJB 3.0 enterprise bean&#12290;Seam&#24182;&#19981;&#24378;&#27714;&#32452;&#20214;&#26159;EJB&#65292;&#29978;&#33267;&#21487;&#20197;&#19981;&#20351;&#29992;EJB 3.0&#20860;&#23481;&#30340;&#23481;&#22120;&#65292;Seam&#22312;&#35774;&#35745;&#30340;&#26102;&#20505;&#22788;&#22788;&#32771;&#34385;&#23545;EJB 3.0&#30340;&#25903;&#25345;&#65292;&#24182;&#19988;&#21253;&#21547;&#23545;EJB 3.0&#30340;&#28145;&#24230;&#25972;&#21512;&#12290;
       </p><div class="itemizedlist"><ul type="disc"><li><p>EJB 3.0 stateless Session Beans</p></li><li><p>EJB 3.0 stateful Session Beans</p></li><li><p>EJB 3.0 entity beans</p></li><li><p>JavaBeans</p></li><li><p>EJB 3.0 message-driven beans</p></li></ul></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3171"></a>3.2.1.&nbsp;&#26080;&#29366;&#24577;Session Bean</h3></div></div><div></div></div><p>
                &#26080;&#29366;&#24577;Session Bean&#32452;&#20214;&#26080;&#27861;&#22312;&#22810;&#27425;&#35843;&#29992;&#20043;&#38388;&#20445;&#25345;&#29366;&#24577;&#12290;&#22240;&#27492;&#65292;&#23427;&#20204;&#36890;&#24120;&#22312;&#19981;&#21516;&#30340;Seam&#19978;&#19979;&#25991;&#20013;&#65292;&#25805;&#20316;&#20854;&#20182;&#32452;&#20214;&#30340;&#29366;&#24577;&#12290;&#20182;&#20204;&#21487;&#20197;&#20316;&#20026;JSF&#30340;action listener&#65292;&#20294;&#26159;&#19981;&#33021;&#20026;JSF&#32452;&#20214;&#30340;&#26174;&#31034;&#25552;&#20379;&#23646;&#24615;&#12290;
           </p><p>
           &#22240;&#20026;&#27599;&#27425;&#35831;&#27714;&#37117;&#20135;&#29983;&#19968;&#20010;&#26032;&#30340;&#23454;&#20363;&#65292;&#26080;&#29366;&#24577;session bean&#21487;&#20197;&#24182;&#21457;&#35775;&#38382;&#12290;&#25226;&#20854;&#23454;&#20363;&#21644;&#35831;&#27714;&#30456;&#20851;&#32852;&#26159;EJB3&#23481;&#22120;&#30340;&#36131;&#20219;&#65288;&#36890;&#24120;&#36825;&#20123;&#23454;&#20363;&#20250;&#20174;&#19968;&#20010;&#21487;&#37325;&#29992;&#30340;&#27744;&#20013;&#20998;&#37197;&#65292;&#25152;&#20197;&#20320;&#21487;&#33021;&#20250;&#21457;&#29616;&#26576;&#20123;&#23454;&#20363;&#21464;&#37327;&#36824;&#20445;&#23384;&#30528;&#19978;&#27425;&#20351;&#29992;&#30340;&#30165;&#36857;&#12290;&#65289;
           </p><p>
                &#26080;&#29366;&#24577;Session Bean&#24635;&#26159;&#29983;&#27963;&#22312;&#26080;&#29366;&#24577;&#19978;&#19979;&#25991;&#20013;&#12290;
           </p><p>
                &#26080;&#29366;&#24577;Session Bean&#26159;Seam&#32452;&#20214;&#20013;&#26368;&#27809;&#36259;&#30340;&#20102;&#12290;
           </p><p>
				Seam&#26080;&#29366;&#24577;Session Bean&#32452;&#20214;&#21487;&#20197;&#20351;&#29992; <tt class="literal">Component.getInstance()</tt> &#25110;&#32773; <tt class="literal">@In(create=true)</tt> &#23454;&#20363;&#21270;&#12290;&#23427;&#20204;&#19981;&#33021;&#30452;&#25509;&#20351;&#29992;JNDI&#25110;&#32773; <tt class="literal">new</tt> &#25805;&#20316;&#23454;&#20363;&#21270;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3193"></a>3.2.2.&nbsp;&#26377;&#29366;&#24577;Session Bean</h3></div></div><div></div></div><p>
                &#26377;&#29366;&#24577;Session Bean&#19981;&#20165;&#21487;&#20197;&#22312;bean&#30340;&#22810;&#27425;&#35843;&#29992;&#20043;&#38388;&#20445;&#25345;&#29366;&#24577;&#65292;&#32780;&#19988;&#22312;&#22810;&#27425;&#35831;&#27714;&#20043;&#38388;&#20063;&#21487;&#20197;&#20445;&#25345;&#29366;&#24577;&#12290;
                &#19981;&#30001;&#25968;&#25454;&#24211;&#20445;&#23384;&#30340;&#29366;&#24577;&#36890;&#24120;&#24212;&#35813;&#30001;&#26377;&#29366;&#24577;Session Bean&#20445;&#25345;&#12290;&#36825;&#26159;Seam&#21644;&#20854;&#20182;web&#26694;&#26550;&#20043;&#38388;&#30340;&#19968;&#20010;&#26174;&#33879;&#30340;&#19981;&#21516;&#28857;&#12290;
                &#20854;&#20182;&#26694;&#26550;&#25226;&#24403;&#21069;&#20250;&#35805;&#30340;&#20449;&#24687;&#30452;&#25509;&#20445;&#23384;&#22312; <tt class="literal">HttpSession</tt> &#20013;&#65292;&#32780;&#22312;Seam&#20013;&#20320;&#24212;&#35813;&#25226;&#23427;&#20204;&#20445;&#23384;&#22312;&#26377;&#29366;&#24577;Session Bean&#30340;&#23454;&#20363;&#20013;&#65292;&#35813;&#23454;&#20363;&#34987;&#32465;&#23450;&#21040;&#20250;&#35805;&#19978;&#19979;&#25991;&#12290;&#36825;&#21487;&#20197;&#35753;Seam&#26469;&#26367;&#20320;&#31649;&#29702;&#29366;&#24577;&#30340;&#29983;&#21629;&#21608;&#26399;&#65292;&#24182;&#19988;&#20445;&#35777;&#22312;&#22810;&#20010;&#19981;&#21516;&#30340;&#24182;&#21457;&#20250;&#35805;&#20013;&#27809;&#26377;&#29366;&#24577;&#20914;&#31361;&#12290;
           </p><p>
                &#26377;&#29366;&#24577;Session Bean&#32463;&#24120;&#34987;&#20316;&#20026;JSF action listener&#20351;&#29992;&#65292;&#20063;&#21487;&#20197;&#20316;&#20026;JSF&#26174;&#31034;&#25110;&#32773;form&#25552;&#20132;&#30340;backing bean(&#25903;&#25345;bean ,&#25110;&#31216;&#21518;&#21488;bean)&#65292;&#25552;&#20379;&#23646;&#24615;&#20379;&#32452;&#20214;&#35775;&#38382;&#12290;
           </p><p>
                &#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#26377;&#29366;&#24577;Session Bean&#20250;&#34987;&#32465;&#23450;&#21040;Conversation Context&#12290;&#23427;&#20204;&#32477;&#19981;&#20250;&#32465;&#23450;&#21040;page&#25110;stateless context&#12290;
           </p><p>
                &#23545;Session&#33539;&#22260;&#30340;&#26377;&#29366;&#24577;Session Bean&#30340;&#24182;&#21457;&#35831;&#27714;&#65292;&#20250;&#34987;Seam&#25353;&#39034;&#24207;&#20018;&#34892;&#22788;&#29702;&#12290;
           </p><p>
				Seam&#26377;&#29366;&#24577;Session Bean&#32452;&#20214;&#21487;&#20197;&#20351;&#29992; <tt class="literal">Component.getInstance()</tt> &#25110;&#32773; <tt class="literal">@In(create=true)</tt> &#23454;&#20363;&#21270;&#12290;&#23427;&#20204;&#19981;&#33021;&#30452;&#25509;&#20351;&#29992;JNDI&#25110;&#32773; <tt class="literal">new</tt> &#25805;&#20316;&#23454;&#20363;&#21270;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3218"></a>3.2.3.&nbsp;&#23454;&#20307;Bean</h3></div></div><div></div></div><p>
                &#23454;&#20307;Bean&#21487;&#20197;&#34987;&#32465;&#23450;&#21040;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#36215;&#21040;Seam&#32452;&#20214;&#30340;&#20316;&#29992;&#12290;&#22240;&#20026;Entity&#38500;&#20102;&#19978;&#19979;&#25991;&#26631;&#35782;&#20043;&#22806;&#65292;&#36824;&#26377;&#25345;&#20037;&#26631;&#35782;&#65292;Entity&#23454;&#20307;&#36890;&#24120;&#26126;&#30830;&#30340;&#30001;Java Code&#32465;&#23450;&#65292;&#32780;&#38750;&#30001;Seam&#38544;&#24615;&#21021;&#22987;&#21270;&#12290;
           </p><p>
                Entity Bean&#23454;&#20307;&#19981;&#25903;&#25345;&#21452;&#21521;&#27880;&#20837;&#25110;&#32773;&#19978;&#19979;&#25991;&#21010;&#20998;&#12290;&#23545;Entity Bean&#30340;&#35843;&#29992;&#20063;&#19981;&#20250;&#35302;&#21457;&#39564;&#35777;&#12290;
           </p><p>
                Entity Bean&#36890;&#24120;&#19981;&#20316;&#20026;JSF&#30340;action listener&#20351;&#29992;&#65292;&#20294;&#32463;&#24120;&#20316;&#20026;JSF&#32452;&#20214;&#29992;&#20110;&#26174;&#31034;&#25110;&#32773;form&#25552;&#20132;&#30340;&#21518;&#21488;bean,&#25552;&#20379;&#23646;&#24615;&#21151;&#33021;&#12290;
                &#29305;&#21035;&#26159;&#65292;&#24403;Entity&#20316;&#20026;&#21518;&#21488;Bean&#30340;&#26102;&#20505;&#65292;&#23427;&#20250;&#21644;&#19968;&#20010;&#26080;&#29366;&#24577;Session Bean&#25198;&#28436;&#30340;action listener&#32852;&#29992;&#65292;&#26469;&#23454;&#29616;CRUD&#20043;&#31867;&#30340;&#21151;&#33021;&#12290;
           </p><p>
                &#40664;&#35748;&#24773;&#20917;&#19979;&#65292;Entity Bean&#34987;&#32465;&#23450;&#21040;Conversation Context&#12290;&#20182;&#20204;&#27704;&#36828;&#19981;&#33021;&#34987;&#32465;&#23450;&#21040;&#26080;&#29366;&#24577;Context&#12290;
           </p><p>
                &#27880;&#24847;&#65292;&#22312;&#38598;&#32676;&#29615;&#22659;&#20013;&#65292;&#25226;Entity Bean&#30452;&#25509;&#32465;&#23450;&#21040;Conversation&#25110;&#32773;Session&#33539;&#22260;&#30340;Seam&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#19982;&#22312;&#26377;&#29366;&#24577;Session Bean&#20013;&#20445;&#25345;&#19968;&#20010;&#23545;Entity Bean&#30340;&#24341;&#29992;&#30456;&#27604;&#65292;&#24615;&#33021;&#27604;&#36739;&#24046;&#12290;&#22240;&#27492;&#65292;&#24182;&#38750;&#25152;&#26377;&#30340;Seam&#24212;&#29992;&#31243;&#24207;&#37117;&#20250;&#25226;Entity Bean&#23450;&#20041;&#20026;Seam&#32452;&#20214;&#12290;
           </p><p>
				Seam&#23454;&#20307;Bean&#32452;&#20214;&#21487;&#20197;&#20351;&#29992; <tt class="literal">Component.getInstance()</tt>&#12289;<tt class="literal">@In(create=true)</tt> &#25110;&#32773;&#30452;&#25509;&#20351;&#29992; <tt class="literal">new</tt> &#25805;&#20316;&#26469;&#23454;&#20363;&#21270;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3242"></a>3.2.4.&nbsp;JavaBeans</h3></div></div><div></div></div><p>
                JavaBeans&#21487;&#20197;&#20687;&#26080;&#29366;&#24577;&#25110;&#32773;&#26377;&#29366;&#24577;Session Bean&#37027;&#26679;&#20351;&#29992;&#12290;&#20294;&#26159;&#65292;&#23427;&#20204;&#19981;&#33021;&#25552;&#20379;Session Bean&#37027;&#20040;&#22810;&#30340;&#21151;&#33021;&#65288;&#22768;&#26126;&#24335;&#20107;&#21153;&#21010;&#20998;&#12289;&#22768;&#26126;&#24335;&#23433;&#20840;&#24615;&#12289;&#39640;&#25928;&#30340;&#38598;&#32676;&#29366;&#24577;&#22797;&#21046;&#12289;EJB 3.0&#25345;&#20037;&#21270;&#12289;&#36229;&#26102;&#26041;&#27861;&#31561;&#31561;&#65289;&#12290;
           </p><p>
                &#22312;&#21518;&#38754;&#26377;&#19968;&#31456;&#65292;&#25105;&#20204;&#20250;&#23637;&#31034;&#22914;&#20309;&#22312;&#27809;&#26377;EJB&#23481;&#22120;&#30340;&#24773;&#20917;&#19979;&#20351;&#29992;Seam&#21644;Hibernate&#12290;&#27492;&#26102;&#65292;&#32452;&#20214;&#26159;JavaBeans&#65292;&#32780;&#38750;Session Beans&#12290;
                &#20294;&#26159;&#27880;&#24847;&#65292;&#22312;&#24456;&#22810;&#24212;&#29992;&#26381;&#21153;&#22120;&#20013;&#65292;&#23545;Conversation&#25110;Session &#33539;&#22260;&#30340;Seam JavaBean&#32452;&#20214;&#38598;&#32676;&#25805;&#20316;&#65292;&#35201;&#27604;&#23545;&#26377;&#29366;&#24577;Session Bean&#32452;&#20214;&#38598;&#32676;&#24930;&#12290;
           </p><p>
                &#40664;&#35748;&#65292;JavaBeans&#26159;&#32465;&#23450;&#21040;Event Context&#30340;&#12290;
           </p><p>
                &#23545;Session&#33539;&#22260;&#30340;JavaBeans&#30340;&#24182;&#21457;&#35831;&#27714;&#24635;&#26159;&#20250;&#34987;Seam&#36716;&#21270;&#20026;&#20018;&#34892;&#25191;&#34892;&#12290;
           </p><p>
	Seam JavaBean&#32452;&#20214;&#21487;&#20197;&#20351;&#29992; <tt class="literal">Component.getInstance()</tt>&#12289;<tt class="literal">@In(create=true)</tt> &#25110;&#32773;&#30452;&#25509;&#20351;&#29992; <tt class="literal">new</tt> &#25805;&#20316;&#26469;&#23454;&#20363;&#21270;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3264"></a>3.2.5.&nbsp;&#28040;&#24687;&#39537;&#21160;Bean</h3></div></div><div></div></div><p>
                &#28040;&#24687;&#39537;&#21160;Bean&#36890;&#24120;&#20316;&#20026;Seam&#32452;&#20214;&#12290;&#20294;&#26159;&#65292;&#28040;&#24687;&#39537;&#21160;Bean&#19982;&#20854;&#20182;Seam&#32452;&#20214;&#30340;&#35843;&#29992;&#26041;&#24335;&#38750;&#24120;&#19981;&#21516;&#8212;&#8212;&#23427;&#20204;&#24182;&#38750;&#36890;&#36807;Context&#21464;&#37327;&#35843;&#29992;&#65292;&#23427;&#20204;&#20250;&#30417;&#21548;&#21457;&#36865;&#21040;JMS Queue&#25110;&#32773;Topic&#30340;&#28040;&#24687;&#12290;
           </p><p>
                &#28040;&#24687;&#39537;&#21160;Bean&#19981;&#33021;&#34987;&#32465;&#23450;&#21040;Seam&#19978;&#19979;&#25991;&#12290;&#23427;&#20204;&#20063;&#19981;&#33021;&#35775;&#38382;&#23427;&#20204;&#30340;&#8220;&#35843;&#29992;&#32773;&#8221;&#30340;Session&#25110;&#32773;&#20250;&#35805;&#29366;&#24577;&#12290;&#20294;&#26159;&#65292;&#23427;&#20204;&#25903;&#25345;&#21452;&#21521;&#27880;&#20837;&#21644;&#19968;&#20123;&#20854;&#20182;&#30340;Seam&#21151;&#33021;&#12290;
           </p><p>
				&#28040;&#24687;&#39537;&#21160;Bean&#19981;&#20250;&#34987;&#24212;&#29992;&#23454;&#20363;&#21270;&#65292;&#23427;&#26159;&#22312;&#25509;&#21463;&#21040;&#19968;&#26465;&#28040;&#24687;&#26102;&#30001;EJB&#23481;&#22120;&#26469;&#23436;&#25104;&#23454;&#20363;&#21270;&#30340;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3273"></a>3.2.6.&nbsp;&#25318;&#25130;</h3></div></div><div></div></div><p>
                &#20026;&#20102;&#34920;&#28436;Seam&#30340;&#39764;&#26415;&#65288;&#21452;&#21521;&#27880;&#20837;&#65292;&#19978;&#19979;&#25991;&#21010;&#20998;&#65292;&#26657;&#39564;&#31561;&#65289;&#65292;&#23427;&#24517;&#39035;&#23545;&#32452;&#20214;&#35843;&#29992;&#36827;&#34892;&#25318;&#25130;&#12290;
                &#23545;JavaBean&#32780;&#35328;&#65292;Seam&#21487;&#20197;&#23436;&#20840;&#25511;&#21046;&#32452;&#20214;&#30340;&#21021;&#22987;&#21270;&#65292;&#19981;&#38656;&#35201;&#29305;&#21035;&#30340;&#37197;&#32622;&#12290;&#23545;&#20110;Entity Bean&#65292;&#20063;&#19981;&#38656;&#35201;&#25318;&#25130;&#22120;&#65292;&#22240;&#20026;&#21452;&#21521;&#27880;&#20837;&#21644;&#19978;&#19979;&#25991;&#21010;&#20998;&#19981;&#36215;&#20316;&#29992;&#12290;
                &#23545;Session Bean&#65292;&#25105;&#20204;&#24517;&#39035;&#20026;&#23427;&#27880;&#20876;EJB&#25318;&#25130;&#22120;&#12290;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#27880;&#35299;&#65292;&#27604;&#22914;&#65306;
           </p><pre class="programlisting">@Stateless
@Interceptors(SeamInterceptor.class)
public class LoginAction implements Login {
    ...
}</pre><p>
                &#20294;&#26159;&#26356;&#22909;&#30340;&#21150;&#27861;&#26159;&#22312; <tt class="literal">ejb-jar.xml</tt> &#20013;&#23450;&#20041;&#25318;&#25130;&#22120;&#12290;
           </p><pre class="programlisting">&lt;interceptors&gt;
   &lt;interceptor&gt;
      &lt;interceptor-class&gt;org.jboss.seam.ejb.SeamInterceptor&lt;/interceptor-class&gt;
   &lt;/interceptor&gt;
&lt;/interceptors&gt;

&lt;assembly-descriptor&gt;
   &lt;interceptor-binding&gt;
      &lt;ejb-name&gt;*&lt;/ejb-name&gt;
      &lt;interceptor-class&gt;org.jboss.seam.ejb.SeamInterceptor&lt;/interceptor-class&gt;
   &lt;/interceptor-binding&gt;
&lt;/assembly-descriptor&gt;</pre></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3287"></a>3.2.7.&nbsp;&#32452;&#20214;&#21517;&#23383;</h3></div></div><div></div></div><p>
                &#25152;&#26377;Seam&#32452;&#20214;&#37117;&#38656;&#35201;&#21517;&#23383;&#12290;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807; <tt class="literal">@Name</tt> &#27880;&#35299;&#26469;&#21629;&#21517;&#32452;&#20214;&#65306;
           </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    ...
}</pre><p>
                &#36825;&#20010;&#21517;&#23383;&#26159; <span class="emphasis"><em>seam component name</em></span>&#65292;&#21644;EJB&#35268;&#33539;&#23450;&#20041;&#30340;&#20219;&#20309;&#20854;&#20182;&#21517;&#23383;&#37117;&#27809;&#26377;&#20851;&#31995;&#12290;
                &#20294;&#26159;&#65292;Seam&#32452;&#20214;&#21517;&#23383;&#23601;&#30456;&#24403;&#20110;JSF&#31649;&#29702;&#30340;Bean Name&#30340;&#21517;&#23383;&#65292;&#22240;&#27492;&#65292;&#21487;&#20197;&#29702;&#35299;&#20026;&#36825;&#20004;&#20010;&#27010;&#24565;&#26159;&#31561;&#21516;&#30340;&#12290;
           </p><p>
                <tt class="literal">@Name</tt> &#19981;&#26159;&#23450;&#20041;&#32452;&#20214;&#21517;&#31216;&#30340;&#21807;&#19968;&#26041;&#24335;&#65292;&#20294;&#26159;&#25105;&#20204;&#24635;&#24471;&#35201;&#22312; <span class="emphasis"><em>&#26576;&#20010;&#22320;&#26041;</em></span> &#26469;&#25351;&#23450;&#21517;&#23383;&#12290;
                &#21542;&#21017;&#65292;Seam &#25152;&#26377;&#30340;&#27880;&#35299;&#37096;&#20998;&#23601;&#26080;&#27861;&#24037;&#20316;&#12290;
           </p><p>
                &#23601;&#22914;&#21516;&#22312;JSF&#20013;&#65292;Seam&#32452;&#20214;&#23454;&#20363;&#32465;&#23450;&#25104;&#19978;&#19979;&#25991;&#21464;&#37327;&#26102;&#65292;&#20854;&#21517;&#23383;&#36890;&#24120;&#21644;&#32452;&#20214;&#21517;&#30456;&#21516;&#12290;
                &#22240;&#27492;&#65292;&#20363;&#22914;&#25105;&#20204;&#21487;&#20197;&#36890;&#36807; <tt class="literal">Contexts.getStatelessContext().get("loginAction")</tt> &#26469;&#35775;&#38382; <tt class="literal">LoginAction</tt>&#12290;
                &#29305;&#21035;&#26159;&#65292;&#19981;&#31649;Seam&#33258;&#24049;&#20309;&#26102;&#21021;&#22987;&#21270;&#19968;&#20010;&#32452;&#20214;&#65292;&#23427;&#23558;&#36825;&#20010;&#26032;&#23454;&#20363;&#20197;&#32452;&#20214;&#30340;&#21517;&#23383;&#32465;&#23450;&#25104;&#19968;&#20010;&#21464;&#37327;&#12290;
                &#20294;&#26159;&#65292;&#21448;&#21644;JSF&#19968;&#26679;&#65292;&#24212;&#29992;&#31243;&#24207;&#20063;&#21487;&#20197;&#25226;&#32452;&#20214;&#32465;&#23450;&#25104;&#20854;&#20182;&#30340;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#21482;&#38656;&#36890;&#36807;API&#32534;&#31243;&#35843;&#29992;&#12290;
                &#20363;&#22914;&#65292;&#24403;&#21069;&#30331;&#24405;&#30340;&#29992;&#25143;&#65288;<tt class="literal">User</tt>&#65289;&#21487;&#20197;&#34987;&#32465;&#23450;&#25104;&#20026;Session&#19978;&#19979;&#25991;&#20013;&#30340; <tt class="literal">currentUser</tt> &#21464;&#37327;&#65292;&#32780;&#21516;&#26102;&#65292;&#21478;&#19968;&#20010;&#29992;&#20316;&#26576;&#31181;&#31649;&#29702;&#21151;&#33021;&#30340;&#29992;&#25143;&#21017;&#34987;&#32465;&#23450;&#25104;&#23545;&#35805;&#19978;&#19979;&#25991;&#30340; <tt class="literal">user</tt> &#21464;&#37327;&#12290;
           </p><p>
                &#23545;&#38750;&#24120;&#22823;&#22411;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#32463;&#24120;&#20351;&#29992;&#20840;&#38480;&#23450;&#21517;&#65307;&#20869;&#32622;&#30340;Seam&#32452;&#20214;&#23601;&#26159;&#36825;&#26679;&#12290;
           </p><pre class="programlisting">@Name("com.jboss.myapp.loginAction")
@Stateless
@Interceptors(SeamInterceptor.class)
public class LoginAction implements Login {
    ...
}</pre><p>
               &#25105;&#20204;&#21487;&#20197;&#22312;Java&#20195;&#30721;&#21644;JSF&#34920;&#36798;&#24335;&#35821;&#35328;&#20013;&#20351;&#29992;&#20840;&#38480;&#23450;&#30340;&#32452;&#20214;&#21517;&#31216;&#12290;
           </p><pre class="programlisting">&lt;h:commandButton type="submit" value="Login"
                 action="#{com.jboss.myapp.loginAction.login}"/&gt;</pre><p>
                &#36825;&#24456;&#21872;&#21990;&#65292;Seam&#20063;&#25552;&#20379;&#20102;&#25226;&#20840;&#38480;&#23450;&#21517;&#31616;&#20889;&#30340;&#21150;&#27861;&#12290;&#22312; <tt class="literal">components.xml</tt> &#25991;&#20214;&#20013;&#21152;&#20837;&#31867;&#20284;&#36825;&#26679;&#30340;&#19968;&#34892;&#65306;
           </p><pre class="programlisting">&lt;factory name="loginAction" scope="STATELESS" value="#{com.jboss.myapp.loginAction}"/&gt;</pre><p>
                &#25152;&#26377;&#30340;Seam&#20869;&#32622;&#32452;&#20214;&#37117;&#26377;&#20840;&#38480;&#23450;&#21517;&#65292;&#20294;&#22823;&#22810;&#25968;&#37117;&#22312;Seam jar&#25991;&#20214;&#30340; <tt class="literal">components.xml</tt> &#20013;&#31616;&#20889;&#20026;&#31616;&#21333;&#30340;&#21517;&#23383;&#12290;
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3347"></a>3.2.8.&nbsp;&#23450;&#20041;&#32452;&#20214;&#33539;&#22260;&#65288;Defining the Component Scope&#65289;</h3></div></div><div></div></div><p>
                &#25105;&#20204;&#21487;&#20197;&#20351;&#29992; <tt class="literal">@Scope</tt> &#27880;&#35299;&#26469;&#35206;&#30422;&#40664;&#35748;&#30340;&#32452;&#20214;&#33539;&#22260;&#65288;&#19978;&#19979;&#25991;&#65289;&#12290;&#36825;&#21487;&#20197;&#35753;&#25105;&#20204;&#23450;&#20041;&#32452;&#20214;&#23454;&#20363;&#34987;Seam&#21021;&#22987;&#21270;&#21518;&#32465;&#23450;&#21040;&#30340;&#20855;&#20307;&#19978;&#19979;&#25991;&#12290;
           </p><pre class="programlisting">@Name("user")
@Entity
@Scope(SESSION)
public class User {
    ...
}</pre><p>
                <tt class="literal">org.jboss.seam.ScopeType</tt>&#23450;&#20041;&#20102;&#21487;&#33021;&#33539;&#22260;&#30340;&#26522;&#20030;.
           </p></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3362"></a>3.2.9.&nbsp;&#20855;&#26377;&#22810;&#20010;&#35282;&#33394;&#30340;&#32452;&#20214;&#65288;Components with multiple roles&#65289;</h3></div></div><div></div></div><p>
                &#26377;&#20123;Seam&#32452;&#20214;&#31867;&#21487;&#20197;&#22312;&#31995;&#32479;&#20013;&#20855;&#26377;&#22810;&#20010;&#35282;&#33394;&#12290;&#20363;&#22914;&#65292;&#25105;&#20204;&#32463;&#24120;&#26377;&#19968;&#20010; <tt class="literal">User</tt> &#31867;&#29992;&#20316;Session-Scoped&#32452;&#20214;&#65292;&#20195;&#34920;&#24403;&#21069;&#29992;&#25143;&#65292;&#21516;&#26102;&#23427;&#21448;&#22312;&#29992;&#25143;&#31649;&#29702;&#30028;&#38754;&#20013;&#34987;&#29992;&#20316;Conversation-Scoped&#32452;&#20214;&#12290;<tt class="literal">@Role</tt> &#27880;&#35299;&#35753;&#25105;&#20204;&#21487;&#20197;&#23450;&#20041;&#32452;&#20214;&#22312;&#21478;&#19968;&#20010;&#33539;&#22260;&#20013;&#30340;&#39069;&#22806;&#35282;&#33394;&#21517; &#8212;&#8212; &#36825;&#21487;&#20197;&#35753;&#25105;&#20204;&#25226;&#30456;&#21516;&#30340;&#32452;&#20214;&#31867;&#32465;&#23450;&#25104;&#19981;&#21516;&#30340;&#19978;&#19979;&#25991;&#21464;&#37327;&#12290;&#65288;&#20219;&#20309;Seam&#32452;&#20214; <span class="emphasis"><em>&#23454;&#20363;</em></span> &#37117;&#21487;&#20197;&#34987;&#32465;&#23450;&#21040;&#22810;&#20010;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#20294;@Role&#20351;&#24471;&#25105;&#20204;&#20063;&#21487;&#20197;&#22312;&#31867;&#30340;&#32423;&#21035;&#20570;&#21040;&#36825;&#19968;&#28857;&#65292;&#20174;&#32780;&#20139;&#21463;&#33258;&#21160;&#23454;&#20363;&#21270;&#30340;&#20248;&#28857;&#12290;&#65289;
           </p><pre class="programlisting">@Name("user")
@Entity
@Scope(CONVERSATION)
@Role(name="currentUser", scope=SESSION)
public class User {
    ...
}</pre><p>
                <tt class="literal">@Roles</tt> &#27880;&#35299;&#21487;&#20197;&#35753;&#25105;&#20204;&#20026;&#32452;&#20214;&#25351;&#23450;&#20219;&#24847;&#22810;&#30340;&#38468;&#21152;&#35282;&#33394;&#12290;
           </p><pre class="programlisting">@Name("user")
@Entity
@Scope(CONVERSATION)
@Roles({@Role(name="currentUser", scope=SESSION),
        @Role(name="tempUser", scope=EVENT)})
public class User {
    ...
}</pre></div><div class="sect2" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e3385"></a>3.2.10.&nbsp;&#20869;&#32622;&#32452;&#20214;</h3></div></div><div></div></div><p>
                &#21644;&#24456;&#22810;&#20248;&#31168;&#30340;&#26694;&#26550;&#19968;&#26679;&#65292;Seam&#33258;&#20135;&#33258;&#29992;&#65292;&#20027;&#35201;&#23454;&#29616;&#20102;&#19968;&#31995;&#21015;&#30340;&#20869;&#32622;Seam&#25318;&#25130;&#22120;&#65288;&#21518;&#25991;&#35814;&#36848;&#65289;&#21644;Seam&#32452;&#20214;&#12290;&#36825;&#35753;&#24212;&#29992;&#31243;&#24207;&#22312;&#36816;&#34892;&#26102;&#21644;&#20869;&#32622;&#30340;&#32452;&#20214;&#20132;&#20114;&#21464;&#24471;&#24456;&#23481;&#26131;&#65292;&#29978;&#33267;&#21487;&#20197;&#29992;&#33258;&#24049;&#32534;&#20889;&#30340;&#23454;&#29616;&#26469;&#26367;&#25442;&#25481;&#20869;&#32622;&#32452;&#20214;&#65292;&#30001;&#27492;&#26469;&#23450;&#21046;Seam&#30340;&#22522;&#26412;&#21151;&#33021;&#12290;&#20869;&#32622;&#32452;&#20214;&#22312; <tt class="literal">org.jboss.seam.core</tt> &#36825;&#20010;Seam &#21629;&#21517;&#31354;&#38388;&#20013;&#23450;&#20041;&#65292;Java&#21253;&#21517;&#20063;&#26159;&#30456;&#21516;&#30340;&#12290;
           </p><p>
&#20687;&#25152;&#26377;Seam&#32452;&#20214;&#19968;&#26679;&#65292;&#20869;&#32622;&#32452;&#20214;&#20063;&#21487;&#20197;&#34987;&#27880;&#23556;&#65292;&#20294;&#26159;&#23427;&#20204;&#20063;&#25552;&#20379;&#20102;&#20415;&#21033;&#30340;<tt class="literal">instance()</tt>&#38745;&#24577;&#26041;&#27861;&#65306;
           </p><pre class="programlisting">FacesMessages.instance().add("Welcome back, #{user.name}!");</pre></div></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3400"></a>3.3.&nbsp;&#21452;&#21521;&#27880;&#20837;</h2></div></div><div></div></div><p>
            <span class="emphasis"><em>Dependency injection&#65288;&#20381;&#36182;&#27880;&#20837;&#65289;</em></span> &#21644; <span class="emphasis"><em>inversion of control&#65288;&#25511;&#21046;&#21453;&#36716;&#65289;</em></span> &#29616;&#22312;&#23545;&#22823;&#22810;&#25968;Java &#24320;&#21457;&#32773;&#26469;&#35828;&#37117;&#26159;&#29087;&#24713;&#30340;&#27010;&#24565;&#20102;&#12290;&#20381;&#36182;&#27880;&#20837;&#20801;&#35768;&#19968;&#20010;&#32452;&#20214;&#36890;&#36807;&#23481;&#22120;&#8220;&#27880;&#20837;&#8221;&#21478;&#19968;&#20010;&#32452;&#20214;&#21040;&#19968;&#20010;setter&#26041;&#27861;&#25110;&#32773;&#23454;&#20363;&#21464;&#37327;&#30340;&#26041;&#24335;&#65292;&#26469;&#33719;&#24471;&#34987;&#8220;&#27880;&#20837;&#8221;&#32452;&#20214;&#30340;&#24341;&#29992;(reference)&#12290;&#25105;&#20204;&#20043;&#21069;&#30475;&#36807;&#30340;&#25152;&#26377;&#20381;&#36182;&#27880;&#20837;&#30340;&#23454;&#29616;&#65292;&#27880;&#20837;&#21457;&#29983;&#22312;&#32452;&#20214;&#21019;&#24314;&#30340;&#26102;&#20505;&#65292;&#22312;&#27492;&#21518;&#23454;&#20363;&#30340;&#25972;&#20010;&#29983;&#21629;&#21608;&#26399;&#20013;&#19981;&#20877;&#25913;&#21464;&#12290;&#23545;&#26080;&#29366;&#24577;&#32452;&#20214;&#65292;&#36825;&#20040;&#20570;&#26159;&#26377;&#36947;&#29702;&#30340;&#12290;&#20174;&#23458;&#25143;&#31471;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;&#29305;&#23450;&#31181;&#31867;&#30340;&#26080;&#29366;&#24577;&#32452;&#20214;&#30340;&#25152;&#26377;&#23454;&#20363;&#37117;&#26159;&#21487;&#20197;&#26367;&#25442;&#30340;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;Seam&#30528;&#37325;&#22788;&#29702;&#26377;&#29366;&#24577;&#32452;&#20214;&#12290;&#27492;&#26102;&#20256;&#32479;&#30340;&#20381;&#36182;&#27880;&#20837;&#19981;&#20877;&#26159;&#38750;&#24120;&#26377;&#25928;&#20102;&#12290;Seam&#24341;&#20837;&#20102; <span class="emphasis"><em>bijection&#65288;&#21452;&#21521;&#27880;&#20837;&#65289;</em></span> &#36825;&#20010;&#21517;&#35789;&#65292;&#29992;&#26469;&#20316;&#20026;&#27880;&#20837;&#30340;&#24191;&#20041;&#27010;&#25324;&#12290;&#21644;injection&#65288;&#21333;&#21521;&#27880;&#20837;&#65289;&#23545;&#27604;&#65292;bijection&#26159;&#65306;
       </p><div class="itemizedlist"><ul type="disc"><li><p>
                    <span class="emphasis"><em>contextual&#65288;&#19978;&#19979;&#25991;&#30456;&#20851;&#30340;&#65289;</em></span> - &#21452;&#21521;&#27880;&#20837;&#29992;&#26469;&#38024;&#23545;&#19981;&#21516;&#30340;&#19978;&#19979;&#25991;&#26469;&#32452;&#35013;&#26377;&#29366;&#24577;&#32452;&#20214;&#65288;&#22312;&#36739;&#22823;&#33539;&#22260;&#30340;&#19978;&#19979;&#25991;&#20013;&#30340;&#32452;&#20214;&#65292;&#21487;&#20197;&#24341;&#29992;&#36739;&#23567;&#33539;&#22260;&#19978;&#19979;&#25991;&#20013;&#30340;&#32452;&#20214;&#65289;
               </p></li><li><p>
                    <span class="emphasis"><em>bidirectional&#65288;&#21452;&#21521;&#30340;&#65289;</em></span> - &#34987;&#35302;&#21457;&#21518;&#65292;&#20540;&#20174;&#19978;&#19979;&#25991;&#21464;&#37327;&#20013;&#27880;&#23556;&#21040;&#32452;&#20214;&#23646;&#24615;&#20013;&#65292;&#20063;&#21487;&#20197;&#20174;&#32452;&#20214;&#23646;&#24615;<span class="emphasis"><em>outjected&#65288;&#21453;&#21521;&#27880;&#20837;&#65289;</em></span> &#22238;&#19978;&#19979;&#25991;,&#36825;&#26679;&#34987;&#35843;&#29992;&#30340;&#32452;&#20214;&#21487;&#20197;&#21482;&#36890;&#36807;&#25913;&#20889;&#33258;&#24049;&#30340;&#23454;&#20363;&#21464;&#37327;&#23601;&#21516;&#26102;&#25805;&#20316;&#20102;&#19978;&#19979;&#25991;&#21464;&#37327;&#30340;&#20540;
               </p></li><li><p>
                    <span class="emphasis"><em>dynamic&#65288;&#21160;&#24577;&#30340;&#65289;</em></span> - &#22240;&#20026;&#19978;&#19979;&#25991;&#21464;&#37327;&#30340;&#20540;&#38543;&#30528;&#26102;&#38388;&#19981;&#26029;&#25913;&#21464;&#65292;&#32780;&#19988;&#22240;&#20026;Seam&#32452;&#20214;&#26159;&#26377;&#29366;&#24577;&#30340;&#65292;&#21452;&#21521;&#27880;&#20837;&#22312;&#27599;&#27425;&#32452;&#20214;&#34987;&#35843;&#29992;&#30340;&#26102;&#20505;&#37117;&#21457;&#29983;&#12290;
               </p></li></ul></div><p>
            &#22522;&#26412;&#19978;&#65292;&#36890;&#36807;&#35774;&#32622;&#23454;&#20363;&#21464;&#37327;&#26159;&#38656;&#35201;&#27880;&#20837;&#12289;&#21453;&#21521;&#27880;&#20837;&#12289;&#36824;&#26159;&#20108;&#32773;&#30342;&#26159;&#65292;&#21452;&#21521;&#27880;&#20837;&#35753;&#20320;&#23558;&#19978;&#19979;&#25991;&#21464;&#37327;&#26144;&#23556;&#21040;&#32452;&#20214;&#23454;&#20363;&#21464;&#37327;&#12290;&#24403;&#28982;&#65292;&#25105;&#20204;&#20351;&#29992;&#27880;&#35299;&#26469;&#35774;&#32622;&#21452;&#21521;&#27880;&#20837;&#12290;
       </p><p>
             <tt class="literal">@In</tt> &#27880;&#35299;&#25351;&#26126;&#24212;&#35813;&#27880;&#20837;&#20540;&#65292;&#21487;&#33021;&#26159;&#27880;&#20837;&#23454;&#20363;&#21464;&#37327;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    @In User user;
    ...
}</pre><p>
            &#25110;&#32773;&#27880;&#20837;setter&#26041;&#27861;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    User user;

    @In
    public void setUser(User user) {
        this.user=user;
    }

    ...
}</pre><p>
            &#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#38024;&#23545;&#34987;&#27880;&#20837;&#30340;&#23646;&#24615;&#25110;&#32773;&#23454;&#20363;&#21464;&#37327;&#21517;&#65292; Seam&#20250;&#23545;&#25152;&#26377;&#30340;&#19978;&#19979;&#25991;&#36827;&#34892;&#20248;&#20808;&#32423;&#25628;&#32034;&#12290;
            &#22914;&#26524;&#20320;&#24076;&#26395;&#26126;&#30830;&#25351;&#23450;&#19978;&#19979;&#25991;&#21464;&#37327;&#21517;&#65292;&#21487;&#20197;&#36825;&#26679;&#20889;&#65306;<tt class="literal">@In("currentUser")</tt>&#12290;
       </p><p>
            &#22914;&#26524;&#27809;&#26377;&#32452;&#20214;&#23454;&#20363;&#32465;&#23450;&#21040;&#20855;&#21517;&#30340;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#20320;&#21487;&#33021;&#24076;&#26395;Seam&#21019;&#24314;&#19968;&#20010;&#65292;&#20320;&#21487;&#20197;&#25351;&#23450; <tt class="literal">@In(create=true)</tt>&#12290;
            &#22914;&#26524;&#20540;&#26159;&#21487;&#36873;&#30340;&#65288;&#21487;&#20197;&#20026;null&#65289;&#65292;&#35831;&#25351;&#23450; <tt class="literal">@In(required=false)</tt>&#12290;
       </p><p>
            &#23545;&#20110;&#26576;&#20123;&#32452;&#20214;&#65292;&#21040;&#22788;&#25351;&#23450; <tt class="literal">@In(create=true)</tt> &#26159;&#24456;&#32321;&#29712;&#30340;&#12290;
            &#20320;&#21487;&#20197;&#27880;&#35299;&#25972;&#20010;&#32452;&#20214;&#20026; <tt class="literal">@AutoCreate</tt>&#65292;&#23427;&#23601;&#20250;&#22312;&#20219;&#20309;&#38656;&#35201;&#30340;&#26102;&#20505;&#33258;&#21160;&#21019;&#24314;&#65292;&#19981;&#38656;&#35201;&#26126;&#30830;&#30340;&#25351;&#23450; <tt class="literal">create=true</tt>&#12290;
       </p><p>
            &#20320;&#36824;&#21487;&#20197;&#27880;&#20837;&#34920;&#36798;&#24335;&#30340;&#20540;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    @In("#{user.username}") String username;
    ...
}</pre><p>
            &#65288;&#22312;&#19979;&#19968;&#31456;&#65292;&#26377;&#26356;&#22810;&#30340;&#20851;&#20110;&#32452;&#20214;&#29983;&#21629;&#21608;&#26399;&#21644;&#27880;&#23556;&#30340;&#20869;&#23481;&#12290;&#65289;
       </p><p>
            <tt class="literal">@Out</tt> &#27880;&#35299;&#25351;&#23450;&#20102;&#26576;&#20010;&#23646;&#24615;&#38656;&#35201;&#23545;&#22806;&#27880;&#20837;&#65292;&#21487;&#33021;&#26159;&#20174;&#23454;&#20363;&#21464;&#37327;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    @Out User user;
    ...
}</pre><p>
            &#25110;&#32773;&#20174;&#26576;&#20010;getter&#26041;&#27861;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
@Interceptors(SeamInterceptor.class)
public class LoginAction implements Login {
    User user;

    @Out
    public User getUser() {
        return user;
    }

    ...
}</pre><p>
            &#23646;&#24615;&#21487;&#20197;&#26082;&#26159;&#34987;&#27880;&#20837;&#30340;&#65292;&#20063;&#21487;&#20197;&#23545;&#22806;&#27880;&#20837;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    @In @Out User user;
    ...
}</pre><p>
            &#25110;&#32773;&#65306;
       </p><pre class="programlisting">@Name("loginAction")
@Stateless
public class LoginAction implements Login {
    User user;

    @In
    public void setUser(User user) {
        this.user=user;
    }

    @Out
    public User getUser() {
        return user;
    }

    ...
}</pre></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3498"></a>3.4.&nbsp;Lifecycle methods&#65288;&#29983;&#21629;&#21608;&#26399;&#26041;&#27861;&#65289;</h2></div></div><div></div></div><p>
			Session Bean&#21644;&#23454;&#20307;Bean Seam&#32452;&#20214;&#25903;&#25345;&#25152;&#26377;&#36890;&#29992;&#30340;EJB3.0&#29983;&#21629;&#21608;&#26399;&#22238;&#35843;&#65288;<tt class="literal">@PostConstruct</tt>, <tt class="literal">@PreDestroy</tt>, &#31561;&#31561;&#65289;&#12290;&#20294;&#26159;Seam&#20063;&#21516;&#26679;&#25903;&#25345;JavaBean&#32452;&#20214;&#20351;&#29992;&#20219;&#24847;&#30340;&#36825;&#20123;&#22238;&#35843;&#12290;&#28982;&#32780;&#65292;&#19968;&#20294;&#36825;&#20123;&#27880;&#35299;&#22312;J2EE&#29615;&#22659;&#20013;&#22833;&#25928;&#65292;Seam&#23450;&#20041;&#20102;&#20004;&#20010;&#38468;&#21152;&#32452;&#20214;&#23436;&#25104;&#29983;&#21629;&#21608;&#26399;&#22238;&#35843;&#65292;&#36825;&#31561;&#21516;&#20110; <tt class="literal">@PostConstruct</tt> &#21644; <tt class="literal">@PreDestroy</tt>.
       </p><p>
			<tt class="literal">@Create</tt> &#26041;&#27861;&#22312;Seam&#23454;&#20363;&#21270;&#19968;&#20010;&#32452;&#20214;&#21518;&#34987;&#35843;&#29992;&#12290;&#32452;&#20214;&#21482;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010; <tt class="literal">@Create</tt> &#26041;&#27861;&#12290;
       </p><p>
			<tt class="literal">@Destroy</tt> &#26041;&#27861;&#22312;Seam&#32452;&#20214;&#34987;&#32465;&#23450;&#30340;&#19978;&#19979;&#25991;&#32467;&#26463;&#26102;&#34987;&#35843;&#29992;&#12290;&#32452;&#20214;&#21482;&#21487;&#20197;&#23450;&#20041;&#19968;&#20010; <tt class="literal">@Destroy</tt> &#26041;&#27861;&#12290;
       </p><p>
			&#21478;&#22806;&#65292;&#26377;&#29366;&#24577;Session Bean&#32452;&#20214; <span class="emphasis"><em>&#24517;&#39035;</em></span> &#23450;&#20041;&#19968;&#20010;&#26080;&#21442;&#24182;&#27880;&#35299;&#20026; <tt class="literal">@Remove</tt> &#30340;&#26041;&#27861;&#12290;&#36825;&#20010;&#26041;&#27861;&#22312;&#19978;&#19979;&#25991;&#32467;&#26463;&#26102;&#34987;Seam&#35843;&#29992;&#12290;
       </p><p>
            &#26368;&#21518;&#65292;&#30456;&#20851;&#30340;&#27880;&#35299;&#36824;&#26377; <tt class="literal">@Startup</tt>&#65292;&#23427;&#21487;&#20197;&#29992;&#22312;&#20219;&#20309;Application&#25110;&#32773;Session&#33539;&#22260;&#30340;&#32452;&#20214;&#19978;&#12290;
            <tt class="literal">@Startup</tt> &#27880;&#35299;&#21578;&#35785;Seam&#22312;&#19978;&#19979;&#25991;&#24320;&#22987;&#30340;&#26102;&#20505;&#31435;&#21051;&#21021;&#22987;&#21270;&#32452;&#20214;&#65292;&#32780;&#19981;&#26159;&#22312;&#34987;&#23458;&#25143;&#35775;&#38382;&#30340;&#26102;&#20505;&#25165;&#21019;&#24314;&#12290;
            &#25511;&#21046;startup&#32452;&#20214;&#30340;&#21021;&#22987;&#21270;&#39034;&#24207;&#36890;&#36807;&#25351;&#23450; <tt class="literal">@Startup(depends={....})</tt> &#36827;&#34892;&#12290;
       </p></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3550"></a>3.5.&nbsp;&#26465;&#20214;&#35013;&#36733;&#65288;Conditional installation&#65289;</h2></div></div><div></div></div><p>
            <tt class="literal">@Install</tt> &#27880;&#35299;&#35753;&#20320;&#25511;&#21046;&#32452;&#20214;&#30340;&#26465;&#20214;&#35013;&#36733;&#65292;&#20801;&#35768;&#38543;&#30528;&#19981;&#21516;&#30340;&#37096;&#32626;&#24773;&#24418;&#32780;&#25913;&#21464;&#12290;&#20363;&#22914;&#65306;
       </p><div class="itemizedlist"><ul type="disc"><li><p>
        		    &#24076;&#26395;&#22312;&#27979;&#35797;&#20013;mock out&#19968;&#20123;&#22522;&#30784;&#32452;&#20214;&#12290;
        		</p></li><li><p>
        		    &#24076;&#26395;&#22312;&#19968;&#20123;&#29305;&#27530;&#30340;&#37096;&#32626;&#24773;&#24418;&#19979;&#25913;&#21464;&#32452;&#20214;&#30340;&#23454;&#29616;&#12290;
        		</p></li><li><p>
        		    &#24076;&#26395;&#21482;&#26377;&#28385;&#36275;&#20381;&#36182;&#26465;&#20214;&#30340;&#26102;&#20505;&#25165;&#23433;&#35013;&#26576;&#20123;&#32452;&#20214;&#65288;&#23545;&#26694;&#26550;&#20316;&#32773;&#24456;&#26377;&#29992;&#65289;&#12290;
        		</p></li></ul></div><p>
            <tt class="literal">@Install</tt> &#36890;&#36807;&#35753;&#20320;&#25351;&#23450; <span class="emphasis"><em>precedence&#65288;&#20248;&#20808;&#32423;&#65289;</em></span> &#21644; <span class="emphasis"><em>dependencies&#65288;&#20381;&#36182;&#65289;</em></span> &#26469;&#36816;&#20316;&#12290;
       </p><p>
            &#32452;&#20214;&#30340;&#20248;&#20808;&#32423;&#26159;&#19968;&#20010;&#25968;&#23383;&#65292;&#24403;&#22312;classpath&#20013;&#23384;&#22312;&#22810;&#20010;&#21516;&#32452;&#20214;&#21517;&#30340;&#31867;&#30340;&#26102;&#20505;&#65292;seam&#20381;&#38752;&#23427;&#26469;&#20915;&#23450;&#23433;&#35013;&#21738;&#20010;&#32452;&#20214;&#12290;
            Seam&#20250;&#36873;&#21462;&#20248;&#20808;&#32423;&#25968;&#23383;&#26368;&#22823;&#30340;&#12290;&#26377;&#19968;&#20123;&#39044;&#23450;&#20041;&#30340;&#20248;&#20808;&#32423;&#20540;&#65306;&#65288;&#25353;&#21319;&#24207;&#25490;&#21015;&#65289;&#65306;
       </p><div class="orderedlist"><ol type="1"><li><p>
        		    <tt class="literal">BUILT_IN</tt> &#8212; &#20248;&#20808;&#32423;&#26368;&#20302;&#30340;&#32452;&#20214;,&#26159;&#20869;&#32622;&#22312;Seam&#20013;&#30340;&#32452;&#20214;&#12290;
        		</p></li><li><p>
        		    <tt class="literal">FRAMEWORK</tt> &#8212; &#31532;&#19977;&#26041;&#26694;&#26550;&#23450;&#20041;&#30340;&#32452;&#20214;&#21487;&#33021;&#35206;&#30422;&#20869;&#32622;&#32452;&#20214;&#65292;&#20294;&#34987;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#25152;&#37325;&#36733;&#12290;
        		</p></li><li><p>
        		    <tt class="literal">APPLICATION</tt> &#8212; &#40664;&#35748;&#20248;&#20808;&#32423;&#12290;&#22823;&#37096;&#20998;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;&#36866;&#21512;&#36825;&#19968;&#32423;&#21035;&#12290;
        		</p></li><li><p>
        		    <tt class="literal">DEPLOYMENT</tt> &#8212; &#21644;&#37096;&#32626;&#30456;&#20851;&#30340;&#24212;&#29992;&#31243;&#24207;&#32452;&#20214;
        		</p></li><li><p>
        		    <tt class="literal">MOCK</tt> &#8212; &#20026;&#22312;&#27979;&#35797;&#20013;&#20351;&#29992;&#30340;mock objects&#25152;&#20934;&#22791;&#12290;
        		</p></li></ol></div><p>
            &#20551;&#35774;&#25105;&#20204;&#26377;&#19968;&#20010;&#32452;&#20214;&#65292;&#21517;&#20026; <tt class="literal">messageSender</tt> &#65292;&#21644;&#19968;&#20010;JMS&#38431;&#21015;&#20132;&#20114;&#12290;
       </p><pre class="programlisting">@Name("messageSender")
public class MessageSender {
    public void sendMessage() {
        //do something with JMS
    }
}</pre><p>
            &#22312;&#25105;&#20204;&#30340;&#21333;&#20803;&#27979;&#35797;&#20013;&#65292;&#25105;&#20204;&#24182;&#27809;&#26377;JMS&#38431;&#21015;&#21487;&#29992;&#65292;&#22240;&#27492;&#25105;&#20204;&#38656;&#35201;stub&#36825;&#20010;&#26041;&#27861;&#12290;&#25105;&#20204;&#20250;&#21019;&#24314;&#19968;&#20010; <span class="emphasis"><em>mock</em></span> &#32452;&#20214;&#65292;&#22312;&#21333;&#20803;&#27979;&#35797;&#36816;&#34892;&#26102;&#25918;&#22312;classpath&#20013;&#65292;&#20294;&#32477;&#19981;&#20250;&#22312;&#37096;&#32626;&#24212;&#29992;&#31243;&#24207;&#26102;&#20986;&#29616;&#12290;
       </p><pre class="programlisting">@Name("messageSender")
@Install(precedence=MOCK)
public class MockMessageSender extends MessageSender {
    public void sendMessage() {
        //do nothing!
    }
}</pre><p>
            &#24403;seam&#22312;classpath&#20013;&#21457;&#29616;&#22810;&#20010;&#32452;&#20214;&#26102;&#65292;<tt class="literal">precedence</tt> &#24110;&#21161;Seam&#20915;&#23450;&#20351;&#29992;&#21738;&#20010;&#29256;&#26412;&#12290;
       </p><p>
            &#22914;&#26524;&#25105;&#20204;&#33021;&#31934;&#30830;&#25511;&#21046;&#20351;&#29992; classpath&#20013;&#23384;&#22312;&#30340;&#31867;&#65292;&#26159;&#24456;&#32654;&#22937;&#30340;&#12290;
            &#20294;&#26159;&#22914;&#26524;&#25105;&#22312;&#32534;&#20889;&#19968;&#20010;&#21487;&#37325;&#29992;&#30340;&#26694;&#26550;&#65292;&#20855;&#26377;&#24456;&#22810;&#20381;&#36182;&#26465;&#20214;&#65292;&#25105;&#19981;&#24076;&#26395;&#29992;&#37027;&#20040;&#22810;&#30340;jar&#26469;&#32930;&#35299;&#26694;&#26550;&#12290;
            &#25105;&#24076;&#26395;&#36890;&#36807;&#24050;&#32463;&#23433;&#35013;&#20102;&#21738;&#20123;&#20102;&#32452;&#20214;&#65292;&#20197;&#21450;classpath&#20013;&#23384;&#22312;&#21738;&#20123;&#32452;&#20214;&#65292;&#26469;&#20915;&#23450;&#23433;&#35013;&#32452;&#20214;&#12290;
            <tt class="literal">@Install</tt> &#27880;&#35299;&#20063;&#25511;&#21046;&#36825;&#19968;&#21151;&#33021;&#12290;Seam&#20869;&#37096;&#20351;&#29992;&#36825;&#19968;&#26426;&#21046;&#26469;&#25511;&#21046;&#24456;&#22810;&#20869;&#37096;&#32452;&#20214;&#30340;&#26465;&#20214;&#23433;&#35013;&#12290;&#34429;&#28982;&#20320;&#21487;&#33021;&#19981;&#20250;&#22312;&#20320;&#30340;&#31243;&#24207;&#20013;&#20351;&#29992;&#23427;&#12290;
       </p></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3636"></a>3.6.&nbsp;&#26085;&#24535;</h2></div></div><div></div></div><p>
            &#38754;&#23545;&#19979;&#38754;&#30340;&#20195;&#30721;&#65292;&#35841;&#37117;&#20250;&#34987;&#25630;&#24471;&#19971;&#31373;&#29983;&#28895;&#65306;
        </p><pre class="programlisting">private static final Log log = LogFactory.getLog(CreateOrderAction.class);

public Order createOrder(User user, Product product, int quantity) {
    if ( log.isDebugEnabled() ) {
        log.debug("Creating new order for user: " + user.username() +
            " product: " + product.name()
            + " quantity: " + quantity);
    }
    return new Order(user, product, quantity);
}</pre><p>
            &#38590;&#20197;&#24819;&#35937;&#20026;&#20309;&#31616;&#21333;&#30340;log&#20449;&#24687;&#20250;&#34987;&#25630;&#24471;&#22914;&#27492;&#20043;&#22797;&#26434;&#12290;&#29992;&#20110;log&#30340;&#20195;&#30721;&#20989;&#25968;&#27604;&#29992;&#20110;&#23454;&#38469;&#19994;&#21153;&#36923;&#36753;&#30340;&#36824;&#35201;&#22810;&#65281;&#24456;&#24778;&#35766;,Java&#31038;&#21306;10&#24180;&#20869;&#37117;&#27809;&#26377;&#23545;&#27492;&#21152;&#20197;&#25913;&#21464;&#12290;
       </p><p>
            Seam&#25552;&#20379;&#20102;&#21487;&#20197;&#26174;&#33879;&#31616;&#21270;&#19978;&#36848;&#20195;&#30721;&#30340;logging API&#65306;
       </p><pre class="programlisting">@Logger private Log log;

public Order createOrder(User user, Product product, int quantity) {
    log.debug("Creating new order for user: #0 product: #1 quantity: #2", user.username(), product.name(), quantity);
    return new Order(user, product, quantity);
}</pre><p>
            &#26159;&#21542;&#25226; <tt class="literal">log</tt> &#21464;&#37327;&#22768;&#26126;&#20026;static&#24182;&#19981;&#37325;&#35201;&#65292;&#23427;&#37117;&#21487;&#20197;&#24037;&#20316;&#65292;&#38500;&#38750;&#26159;Entity Bean&#32452;&#20214;&#65292;&#38656;&#35201;&#25226; <tt class="literal">log</tt> &#22768;&#26126;&#20026;&#38745;&#24577;&#30340;&#12290;
       </p><p>
            &#27880;&#24847;&#20320;&#24182;&#19981;&#38656;&#35201;&#32321;&#26434;&#30340; <tt class="literal">if ( log.isDebugEnabled() )</tt> &#20445;&#21355;&#35821;&#21477;&#65292;&#22240;&#20026;&#23383;&#31526;&#20018;&#30456;&#21152;&#25805;&#20316;&#26159;&#22312; <tt class="literal">debug()</tt> &#26041;&#27861; <span class="emphasis"><em>&#20869;&#37096;</em></span> &#21457;&#29983;&#30340;&#12290;&#20063;&#35831;&#27880;&#24847;&#36890;&#24120;&#19981;&#38656;&#35201;&#26174;&#24335;&#25351;&#23450;log&#31867;&#22411;&#65292;&#22240;&#20026;Seam&#30693;&#36947;&#21738;&#20010;&#32452;&#20214;&#27491;&#22312;&#27880;&#20837; <tt class="literal">Log</tt>&#12290;
       </p><p>
            &#20551;&#35774; <tt class="literal">User</tt> &#21644; <tt class="literal">Product</tt> &#26159;&#24403;&#21069;&#19978;&#19979;&#25991;&#20013;&#21487;&#29992;&#30340;Seam&#32452;&#20214;&#65292;&#20889;&#36215;&#26469;&#26356;&#21152;&#31616;&#20415;&#65306;
       </p><pre class="programlisting">@Logger private Log log;

public Order createOrder(User user, Product product, int quantity) {
    log.debug("Creating new order for user: #{user.username} product: #{product.name} quantity: #0", quantity);
    return new Order(user, product, quantity);
}</pre><p>
            Seam loging&#33258;&#21160;&#36873;&#25321;&#21457;&#36865;&#32467;&#26524;&#21040;log4j&#25110;&#32773;JDK logging&#12290;&#22914;&#26524;log4j&#22312;classpath&#20013;&#65292;Seam&#20250;&#20351;&#29992;&#23427;&#65292;&#21542;&#21017;&#65292;Seam&#20250;&#20351;&#29992;JDK logging.
       </p></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3684"></a>3.7.&nbsp;<tt class="literal">Mutable</tt>&#25509;&#21475;&#21644;<tt class="literal">@ReadOnly</tt></h2></div></div><div></div></div><p>
            &#24456;&#22810;&#24212;&#29992;&#26381;&#21153;&#22120;&#30340; <tt class="literal">HttpSession</tt> &#38598;&#32676;&#23454;&#29616;&#37117;&#26377;&#38382;&#39064;&#65292;&#23545;&#32465;&#23450;&#21040;Session&#30340;&#21487;&#21464;&#23545;&#35937;&#29366;&#24577;&#30340;&#25913;&#21464;&#21482;&#26377;&#22312;&#26126;&#30830;&#35843;&#29992; <tt class="literal">setAttribute()</tt> &#30340;&#26102;&#20505;&#25165;&#20250;&#34987;&#22797;&#21046;&#12290;
            &#36825;&#26159;Bug&#30340;&#19968;&#20010;&#28304;&#22836;&#65292;&#36825;&#20123;Bug&#38590;&#20197;&#22312;&#24320;&#21457;&#38454;&#27573;&#26377;&#25928;&#25214;&#20986;&#65292;&#22240;&#20026;&#23427;&#20204;&#21482;&#20250;&#22312;&#24212;&#29992;&#26381;&#21153;&#22120;&#22833;&#25928;&#20999;&#25442;&#30340;&#26102;&#20505;&#25165;&#20250;&#34987;&#21457;&#29616;&#12290;
            &#32780;&#19988;&#65292;&#23454;&#38469;&#30340;&#22797;&#21046;&#20449;&#24687;&#21253;&#21547;&#20102;&#32465;&#23450;&#21040;Session&#30340;&#25152;&#26377;&#24207;&#21015;&#21270;&#23545;&#35937;&#22270;&#65292;&#36825;&#26159;&#20302;&#25928;&#30340;&#12290;
       </p><p>
            &#24403;&#28982;&#65292;EJB &#26377;&#29366;&#24577;Session Bean&#24517;&#39035;&#36827;&#34892;&#33258;&#21160;dirty checking&#65292;&#24182;&#36827;&#34892;&#21487;&#21464;&#29366;&#24577;&#30340;&#22797;&#21046;&#65292;&#24182;&#19988;EJB &#23481;&#22120;&#20063;&#24212;&#35813;&#24341;&#20837;&#20248;&#21270;&#65292;&#20363;&#22914;&#23646;&#24615;&#32423;&#21035;&#30340;&#22797;&#21046;&#12290;
            &#20294;&#19981;&#24184;&#30340;&#26159;&#65292;&#24182;&#38750;&#25152;&#26377;&#30340;Seam&#29992;&#25143;&#37117;&#26377;&#36825;&#20040;&#22909;&#30340;&#36816;&#27668;&#65292;&#20182;&#20204;&#30340;&#29615;&#22659;&#21487;&#33021;&#24182;&#19981;&#25903;&#25345;EJB 3.0&#12290;
            &#22240;&#27492;&#65292;&#23545;&#20110;Session&#21644;Conversation&#33539;&#22260;&#20869;&#30340;JavaBean&#21644;Entity Bean&#32452;&#20214;&#65292;&#22312;Web&#23481;&#22120;&#30340;Session&#38598;&#32676;&#20043;&#19978;&#65292;Seam&#25552;&#20379;&#20102;&#39069;&#22806;&#30340;&#38598;&#32676;&#23433;&#20840;&#30340;&#29366;&#24577;&#31649;&#29702;&#23618;&#12290;
       </p><p>
            &#23545;&#20110;Session&#25110;Conversation&#33539;&#22260;&#30340;JavaBean&#32452;&#20214;&#65292;&#27599;&#27425;&#32452;&#20214;&#34987;&#24341;&#29992;&#31243;&#24207;&#35843;&#29992;&#30340;&#26102;&#20505;&#65292;Seam&#33258;&#21160;&#36890;&#36807;&#35843;&#29992;&#19968;&#27425; <tt class="literal">setAttribute()</tt> &#26469;&#35302;&#21457;&#22797;&#21046;&#12290;&#24403;&#28982;&#65292;&#23545;&#22823;&#37096;&#20998;&#26159;&#35835;&#25805;&#20316;&#30340;&#32452;&#20214;&#26469;&#35828;&#65292;&#36825;&#25928;&#29575;&#19981;&#39640;&#12290;&#20320;&#21487;&#20197;&#36890;&#36807;&#23454;&#29616; <tt class="literal">org.jboss.seam.core.Mutable</tt> &#25509;&#21475;&#26469;&#25511;&#21046;&#36825;&#19968;&#34892;&#20026;&#12290;&#25110;&#32773;&#25193;&#23637; <tt class="literal">org.jboss.seam.core.AbstractMutable</tt>&#65292;&#22312;&#32452;&#20214;&#20869;&#23454;&#29616;&#33258;&#24049;&#30340;dirty-checking&#36923;&#36753;&#12290;&#20363;&#22914;&#65292;
       </p><pre class="programlisting">@Name("account")
public class Account extends AbstractMutable
{
    private BigDecimal balance;

    public void setBalance(BigDecimal balance)
    {
        setDirty(this.balance, balance);
        this.balance = balance;
    }

    public BigDecimal getBalance()
    {
        return balance;
    }

    ...

}</pre><p>
            &#25110;&#32773;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992; <tt class="literal">@ReadOnly</tt> &#27880;&#35299;&#26469;&#36798;&#21040;&#31867;&#20284;&#30340;&#25928;&#26524;&#65306;
       </p><pre class="programlisting">@Name("account")
public class Account
{
    private BigDecimal balance;

    public void setBalance(BigDecimal balance)
    {
        this.balance = balance;
    }

    @ReadOnly
    public BigDecimal getBalance()
    {
        return balance;
    }

    ...

}</pre><p>
            &#23545;Session&#25110;Conversation&#33539;&#22260;&#30340;Entity Bean&#32452;&#20214;&#65292;&#22312;&#27599;&#27425;&#34987;&#35831;&#27714;&#30340;&#26102;&#20505;Seam&#33258;&#21160;&#36890;&#36807;&#19968;&#27425; <tt class="literal">setAttribute()</tt> &#35843;&#29992;&#26469;&#35302;&#21457;&#22797;&#21046;&#65292;<span class="emphasis"><em>&#38500;&#38750;&#65288;&#23545;&#35805;&#33539;&#22260;&#30340;&#65289;&#23454;&#20307;&#21644;&#19968;&#20010;Seam&#31649;&#29702;&#30340;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#30456;&#20851;&#32852;&#65292;&#27492;&#26102;&#26080;&#38656;&#22797;&#21046;</em></span>&#12290;&#36825;&#19968;&#31574;&#30053;&#19981;&#26159;&#26368;&#39640;&#25928;&#30340;&#65292;&#22240;&#27492;Session&#25110;Conversation&#33539;&#22260;&#30340;Entity Bean&#24212;&#35813;&#23567;&#24515;&#20351;&#29992;&#12290;&#20320;&#24635;&#26159;&#21487;&#20197;&#32534;&#20889;&#26377;&#29366;&#24577;&#30340;Session Bean&#25110;&#32773;JavaBean&#32452;&#20214;&#26469;&#8220;&#31649;&#29702;&#8221;Entity Bean&#23454;&#20363;&#12290;&#20363;&#22914;&#65292;
       </p><pre class="programlisting">@Stateful
@Name("account")
public class AccountManager extends AbstractMutable
{
    private Account account; // an entity bean

    @Unwrap
    public void getAccount()
    {
        return account;
    }

    ...

}</pre><p>
			&#27880;&#24847;,&#23545;&#20110; <tt class="literal">EntityHome</tt> &#31867;&#65292;Seam&#24212;&#29992;&#26694;&#26550;&#25552;&#20379;&#20102;&#19968;&#20010;&#38750;&#24120;&#22909;&#30340;&#20363;&#23376;&#26469;&#35828;&#26126;&#22914;&#20309;&#20351;&#29992;Seam&#32452;&#20214;&#26469;&#31649;&#29702;&#23454;&#20307;Bean&#30340;&#23454;&#20363;.
       </p></div><div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e3736"></a>3.8.&nbsp;Factory&#21644;Manager&#32452;&#20214;</h2></div></div><div></div></div><p>
            &#25105;&#20204;&#32463;&#24120;&#38656;&#35201;&#19982;&#38750;Seam&#32452;&#20214;&#30340;&#23545;&#35937;&#25171;&#20132;&#36947;&#12290;&#20294;&#26159;&#25105;&#20204;&#20173;&#28982;&#24076;&#26395;&#25226;&#23427;&#20204;&#36890;&#36807; <tt class="literal">@In</tt> &#27880;&#20837;&#25105;&#20204;&#30340;&#32452;&#20214;&#65292;&#24182;&#22312;&#20540;&#21644;&#26041;&#27861;&#34920;&#36798;&#24335;&#20013;&#20351;&#29992;&#23427;&#20204;&#12290;
            &#26377;&#26102;&#20505;&#65292;&#25105;&#20204;&#29978;&#33267;&#38656;&#35201;&#25226;&#23427;&#20204;&#32465;&#23450;&#21040;Seam &#19978;&#19979;&#25991;&#30340;&#29983;&#21629;&#21608;&#26399;&#37324;&#65288;&#20363;&#22914;<tt class="literal">@Destroy</tt>&#65289;&#12290;
            &#25152;&#20197;Seam&#19978;&#19979;&#25991;&#21487;&#20197;&#23481;&#32435;&#38750;Seam&#32452;&#20214;&#30340;&#23545;&#35937;&#65292;&#24182;&#19988;Seam&#25552;&#20379;&#20102;&#19968;&#20123;&#24456;&#22909;&#30340;&#29305;&#24615;&#65292;&#36825;&#20123;&#29305;&#24615;&#20351;&#24471;&#25105;&#20204;&#19982;&#32465;&#23450;&#21040;&#19978;&#19979;&#25991;&#37324;&#30340;&#38750;&#32452;&#20214;&#23545;&#35937;&#25171;&#20132;&#36947;&#26356;&#21152;&#23481;&#26131;&#12290;
       </p><p>
            <span class="emphasis"><em>factory component pattern&#65288;&#24037;&#21378;&#32452;&#20214;&#27169;&#24335;&#65289;</em></span>&#35753;Seam&#32452;&#20214;&#20316;&#20026;&#38750;&#32452;&#20214;&#23545;&#35937;&#30340;&#26500;&#36896;&#22120;&#12290;
            &#24403;&#19978;&#19979;&#25991;&#21464;&#37327;&#34987;&#24341;&#29992;&#65292;&#20294;&#26159;&#27809;&#26377;&#20540;&#34987;&#32465;&#23450;&#21040;&#23427;&#26102;&#65292;&#20250;&#35843;&#29992;&#19968;&#20010;<span class="emphasis"><em>factory method&#65288;&#24037;&#21378;&#26041;&#27861;&#65289;</em></span>&#12290;
            &#25105;&#20204;&#36890;&#36807;<tt class="literal">@Factory</tt>&#27880;&#35299;&#26469;&#23450;&#20041;&#24037;&#21378;&#26041;&#27861;&#12290;
            &#24037;&#21378;&#26041;&#27861;&#25226;&#19968;&#20010;&#20540;&#32465;&#23450;&#21040;&#19978;&#36848;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#24182;&#19988;&#20915;&#23450;&#34987;&#32465;&#23450;&#30340;&#20540;&#30340;&#33539;&#22260;&#12290;&#26377;&#20004;&#31181;&#24037;&#21378;&#26041;&#27861;&#12290;&#31532;&#19968;&#31181;&#36820;&#22238;&#19968;&#20010;&#20540;&#65292;Seam&#20250;&#25226;&#23427;&#32465;&#23450;&#21040;&#19978;&#19979;&#25991;&#37324;&#65306;
       </p><pre class="programlisting">@Factory(scope=CONVERSATION)
public List&lt;Customer&gt; getCustomerList() {
    return ... ;
} </pre><p>
            &#31532;&#20108;&#31181;&#26041;&#27861;&#36820;&#22238; <tt class="literal">void</tt>&#65292;&#23427;&#33258;&#24049;&#25226;&#20540;&#32465;&#23450;&#21040;&#19978;&#19979;&#25991;&#21464;&#37327;&#65306;
       </p><pre class="programlisting">@DataModel List&lt;Customer&gt; customerList;

@Factory("customerList")
public void initCustomerList() {
    customerList = ...  ;
} </pre><p>
            &#20004;&#31181;&#24773;&#20917;&#19979;&#65292;&#24403;&#25105;&#20204;&#24341;&#29992; <tt class="literal">customerList</tt> &#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#32780;&#20854;&#20540;&#20026;null&#26102;&#65292;&#24037;&#21378;&#26041;&#27861;&#34987;&#35843;&#29992;&#65292;&#28982;&#21518;&#23545;&#36825;&#20010;&#20540;&#29983;&#21629;&#21608;&#26399;&#30340;&#20854;&#20182;&#37096;&#20998;&#23601;&#26080;&#27861;&#25805;&#32437;&#20102;&#12290;
            &#26356;&#21152;&#24378;&#22823;&#30340;&#27169;&#24335;&#26159; <span class="emphasis"><em>manager component pattern&#65288;&#31649;&#29702;&#32773;&#32452;&#20214;&#27169;&#24335;&#65289;</em></span>&#12290;
            &#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26377;&#19968;&#20010;Seam&#32452;&#20214;&#32465;&#23450;&#21040;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#23427;&#31649;&#29702;&#30528;&#19978;&#19979;&#25991;&#21464;&#37327;&#30340;&#20540;&#65292;&#23545;&#23458;&#25143;&#31471;&#19981;&#21487;&#35265;&#12290;
       </p><p>
            &#31649;&#29702;&#32773;&#32452;&#20214;&#21487;&#20197;&#26159;&#20219;&#20309;&#32452;&#20214;&#65292;&#23427;&#38656;&#35201;&#19968;&#20010; <tt class="literal">@Unwrap</tt> &#26041;&#27861;&#12290;
            &#35813;&#26041;&#27861;&#36820;&#22238;&#23545;&#23458;&#25143;&#31471;&#21487;&#35265;&#30340;&#20540;&#65292;<span class="emphasis"><em>&#27599;&#27425;</em></span> &#19978;&#19979;&#25991;&#21464;&#37327;&#34987;&#24341;&#29992;&#30340;&#26102;&#20505;&#37117;&#20250;&#34987;&#35843;&#29992;&#12290;
       </p><pre class="programlisting">@Name("customerList")
@Scope(CONVERSATION)
public class CustomerListManager
{
    ...

    @Unwrap
    public List&lt;Customer&gt; getCustomerList() {
        return ... ;
    }
}</pre><p>
			&#24403;&#20320;&#26377;&#19968;&#20010;&#23545;&#35937;&#24182;&#38656;&#35201;&#23545;&#20854;&#32452;&#20214;&#30340;&#29983;&#21629;&#21608;&#26399;&#26356;&#22810;&#30340;&#25511;&#21046;&#26102;&#65292;&#31649;&#29702;&#32452;&#20214;&#27169;&#24335;&#23601;&#26174;&#24471;&#23588;&#20854;&#26377;&#29992;&#12290;
			&#20363;&#22914;&#65292;&#22914;&#26524;&#20320;&#26377;&#19968;&#20010;&#37325;&#37327;&#32423;&#30340;&#23545;&#35937;&#65292;&#24403;&#19978;&#19979;&#25991;&#32467;&#26463;&#26102;&#20320;&#24819;&#23545;&#20854;&#36827;&#34892;&#28165;&#38500;&#25805;&#20316;&#65292;&#20320;&#21487;&#20197;<tt class="literal">@Unwrap</tt>&#23545;&#35937;&#65292;&#24182;&#22312;&#31649;&#29702;&#32452;&#20214;&#30340; <tt class="literal">@Destroy</tt> &#26041;&#27861;&#20013;&#25191;&#34892;&#28165;&#38500;&#25805;&#20316;&#12290;
       </p><pre class="programlisting">@Name("hens")
@Scope(APPLICATION)
public class HenHouse {

    Set&lt;Hen&gt; hens;

    @In(required=false) Hen hen;

    @Unwrap
    public List&lt;Hen&gt; getHens() {
        if (hens == null) {
            // Setup our hens
        }
        return hens;
    }

    @Observer({"chickBorn", "chickenBoughtAtMarket"})
    public addHen() {
        hens.add(hen);
    }

    @Observer("chickenSoldAtMarket")
    public removeHen() {
        hens.remove(hen);
    }

    @Observer("foxGetsIn")
    public removeAllHens() {
        hens.clear();
    }
    ...
} </pre><p>
		&#36825;&#37324;&#65292;&#34987;&#31649;&#29702;&#30340;&#32452;&#20214;&#35266;&#23519;&#37027;&#20123;&#25913;&#21464;&#22312;&#19979;&#38754;&#30340;&#23545;&#35937;&#30340;&#20107;&#20214;&#12290;&#32452;&#20214;&#33258;&#24049;&#31649;&#29702;&#36825;&#20123;&#21160;&#20316;&#65292;&#24182;&#19988;&#30001;&#20110;&#23545;&#35937;&#22312;&#27599;&#19968;&#27425;&#35775;&#38382;&#20013;&#37117;&#34987;&#35299;&#24320;&#65292;&#25152;&#20197;&#36825;&#37324;&#25552;&#20379;&#20102;&#19968;&#20010;&#32479;&#19968;&#30340;&#35270;&#22270;&#12290;
	</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="gettingstarted.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="xml.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;2.&nbsp;&#29992;Seam-gen&#36215;&#27493;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;4.&nbsp;&#37197;&#32622;Seam&#32452;&#20214;</td></tr></table></div></body></html>