<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;6.&nbsp;&#23545;&#35805;&#20197;&#21450;&#24037;&#20316;&#21306;&#31649;&#29702;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="up" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="previous" href="events.html" title="Chapter&nbsp;5.&nbsp;&#20107;&#20214;&#12289;&#25318;&#25130;&#22120;&#21644;&#24322;&#24120;&#22788;&#29702;"><link rel="next" href="jbpm.html" title="Chapter&nbsp;7.&nbsp;&#39029;&#38754;&#27969;&#21644;&#19994;&#21153;&#27969;&#31243;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Chapter&nbsp;6.&nbsp;&#23545;&#35805;&#20197;&#21450;&#24037;&#20316;&#21306;&#31649;&#29702;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="events.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="jbpm.html">Next</a></td></tr></table><hr></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="conversations"></a>Chapter&nbsp;6.&nbsp;&#23545;&#35805;&#20197;&#21450;&#24037;&#20316;&#21306;&#31649;&#29702;</h2></div></div><div></div></div><p>
		&#29616;&#22312;&#35813;&#26356;&#35814;&#32454;&#22320;&#20102;&#35299;&#19968;&#19979;Seam&#30340;&#23545;&#35805;&#27169;&#22411;&#20102;&#12290;
    </p><p>
		&#20174;&#21382;&#21490;&#19978;&#30475;&#65292;Seam&#30340;&#8220;&#23545;&#35805;Conversation&#8221;&#27010;&#24565;&#26159;&#30001;&#19977;&#20010;&#19981;&#21516;&#30340;&#27010;&#24565;&#21512;&#24182;&#32780;&#25104;&#30340;&#12290;
    </p><div class="itemizedlist"><ul type="disc"><li><p>
            <span class="emphasis"><em>&#24037;&#20316;&#21306;&#65288;workspace&#65289;</em></span> &#30340;&#27010;&#24565;&#65292;&#26159;&#25105;2002&#24180;&#22312;&#32473;&#33521;&#22269;&#25919;&#24220;&#20570;&#39033;&#30446;&#20013;&#36935;&#21040;&#30340;&#27010;&#24565;&#65292;&#24403;&#26102;&#25105;&#34987;&#36843;&#22312;struts&#20043;&#19978;&#23454;&#29616;&#24037;&#20316;&#38388;&#65292;&#25105;&#31048;&#27714;&#27704;&#36828;&#19981;&#35201;&#20877;&#37325;&#22797;&#36825;&#26679;&#30340;&#36973;&#36935;&#12290;
        </p></li><li><p>
            &#35821;&#20041;&#20048;&#35266;&#30340; <span class="emphasis"><em>&#24212;&#29992;&#31243;&#24207;&#20107;&#21153;&#65288;application transaction with optimistic semantics&#65289;</em></span> &#30340;&#27010;&#24565;,&#20197;&#21450;&#22522;&#20110;&#26080;&#29366;&#24577;&#26500;&#26550;&#30340;&#29616;&#26377;&#26694;&#26550;&#30340;&#23454;&#29616;&#65292;&#37117;&#26080;&#27861;&#25552;&#20379;&#23545;&#34987;&#25193;&#23637;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#30340;&#26377;&#25928;&#31649;&#29702;&#12290;
            &#65288;Hibernate&#22242;&#38431;&#30830;&#23454;&#24050;&#32463;&#21463;&#22815;&#20102;&#30001;&#20110; <tt class="literal">LazyInitializationException</tt> &#24322;&#24120;&#30340;&#25351;&#36131;&#65292;&#20294;&#36825;&#23454;&#38469;&#19978;&#24182;&#19981;&#26159;Hibernate&#33258;&#36523;&#30340;&#38169;&#35823;&#65292;&#32780;&#26159;&#22240;&#20026;&#20687;Spring&#26694;&#26550;&#36825;&#26679;&#30340;&#26080;&#29366;&#24577;&#26500;&#26550;&#65292;&#25110;&#32773;J2EE&#20013;&#20256;&#32479;&#30340; <span class="emphasis"><em>&#26080;&#29366;&#24577;&#20250;&#35805;Facade</em></span> &#65288;&#21453;&#65289;&#27169;&#24335;&#25903;&#25345;&#26497;&#31471;&#38480;&#21046;&#30340;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#27169;&#22411;&#25152;&#36896;&#25104;&#30340;&#12290;&#65289;
        </p></li><li><p>
			&#24037;&#20316;&#27969; <span class="emphasis"><em>&#20219;&#21153;</em></span>&#30340;&#27010;&#24565;&#12290;
        </p></li></ul></div><p>
		&#36890;&#36807;&#32479;&#19968;&#20197;&#19978;&#36825;&#20123;&#27010;&#24565;&#24182;&#25552;&#20379;&#24213;&#23618;&#26694;&#26550;&#30340;&#25903;&#25345;&#65292;&#25105;&#20204;&#23601;&#26377;&#20102;&#19968;&#20010;&#24378;&#22823;&#30340;&#26500;&#36896;&#33021;&#21147;&#65292;&#23427;&#20351;&#25105;&#20204;&#33021;&#22815;&#29992;&#27604;&#20197;&#21069;&#26356;&#23569;&#30340;&#20195;&#30721;&#26500;&#24314;&#20986;&#21151;&#33021;&#26356;&#21152;&#20016;&#23500;&#19988;&#26356;&#21152;&#39640;&#25928;&#30340;&#24212;&#29992;&#31243;&#24207;&#12290;
    </p><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e4992"></a>6.1.&nbsp;Seam&#30340;&#23545;&#35805;&#27169;&#22411;</h2></div></div><div></div></div><p>
		&#25105;&#20204;&#30446;&#21069;&#20026;&#27490;&#25152;&#30475;&#21040;&#30340;&#20363;&#23376;&#20165;&#20165;&#20351;&#29992;&#38750;&#24120;&#31616;&#21333;&#30340;&#23545;&#35805;&#27169;&#22411;&#65292;&#23427;&#36981;&#24490;&#20197;&#19979;&#36825;&#20123;&#35268;&#21017;&#65306;
    </p><div class="itemizedlist"><ul type="disc"><li><p>
			&#22312;&#24212;&#29992;JSF&#35831;&#27714;&#20540;&#12289;&#22788;&#29702;&#39564;&#35777;&#12289;&#26356;&#26032;&#27169;&#22411;&#20540;&#12289;&#35843;&#29992;&#24212;&#29992;&#31243;&#24207;&#65292;&#20197;&#21450;&#28210;&#26579;JSF&#35831;&#27714;&#29983;&#21629;&#21608;&#26399;&#30340;&#21709;&#24212;&#38454;&#27573;&#26399;&#38388;&#65292;&#22987;&#32456;&#37117;&#26377;&#19968;&#20010;&#28608;&#27963;&#30340;&#20250;&#35805;&#19978;&#19979;&#25991;&#12290;
        </p></li><li><p>
            &#22312;JSF&#35831;&#27714;&#29983;&#21629;&#21608;&#26399;&#24674;&#22797;&#35270;&#22270;&#38454;&#27573;&#30340;&#26368;&#21518;&#65292;Seam&#23558;&#20250;&#35797;&#22270;&#24674;&#22797;&#20043;&#21069;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#20219;&#20309;&#23545;&#35805;&#19978;&#19979;&#25991;&#12290;
            &#22914;&#26524;&#36825;&#31181;&#19978;&#19979;&#25991;&#19981;&#23384;&#22312;&#65292;Seam&#23558;&#20250;&#21019;&#24314;&#19968;&#20010;&#26032;&#30340;&#20020;&#26102;&#23545;&#35805;&#19978;&#19979;&#25991;&#12290;
        </p></li><li><p>
            &#24403;&#36935;&#21040; <tt class="literal">@Begin</tt> &#26041;&#27861;&#26102;&#65292;&#20020;&#26102;&#23545;&#35805;&#19978;&#19979;&#25991;&#20250;&#34987;&#25552;&#21319;&#20026;&#8220;&#38271;&#26102;&#38388;&#36816;&#34892;&#8221;&#30340;&#23545;&#35805;&#12290;
        </p></li><li><p>
			&#24403;&#36935;&#21040; <tt class="literal">@End</tt> &#26041;&#27861;&#26102;&#65292;&#20219;&#20309;&#8220;&#38271;&#26102;&#38388;&#36816;&#34892;&#8221;&#23545;&#35805;&#19978;&#19979;&#25991;&#37117;&#23558;&#20250;&#34987;&#38477;&#32423;&#20026;&#20020;&#26102;&#23545;&#35805;&#12290;
        </p></li><li><p>
			&#22312;JSF&#35831;&#27714;&#29983;&#21629;&#21608;&#26399;&#28210;&#26579;&#38454;&#27573;&#30340;&#26368;&#21518;&#65292;Seam&#20250;&#20445;&#23384;&#8220;&#38271;&#26102;&#38388;&#36816;&#34892;&#8221;&#23545;&#35805;&#30340;&#20869;&#23481;&#65292;&#25110;&#32773;&#38144;&#27585;&#20020;&#26102;&#23545;&#35805;&#19978;&#19979;&#25991;&#30340;&#20869;&#23481;&#12290;
        </p></li><li><p>
            &#20219;&#20309;&#8220;faces request&#8221;&#65288;&#19968;&#31181;JSF postback&#65289;&#37117;&#20250;&#20256;&#25773;&#23545;&#35805;&#19978;&#19979;&#25991;&#12290;
            &#22312;&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#38750;&#8220;faces request&#8221;&#65288;&#20363;&#22914;GET&#35831;&#27714;&#65289;&#37117;&#19981;&#20250;&#20256;&#25773;&#23545;&#35805;&#19978;&#19979;&#25991;&#65292;&#27442;&#30693;&#35814;&#24773;&#65292;&#35831;&#30475;&#19979;&#38754;&#20998;&#35299;&#12290;
        </p></li><li><p>
            &#22914;&#26524;JSF&#35831;&#27714;&#29983;&#21629;&#21608;&#26399;&#34987;&#19968;&#20010;&#37325;&#23450;&#21521;redirect&#21629;&#20196;&#20013;&#27490;&#65292;Seam&#23558;&#20250;&#36879;&#26126;&#22320;&#20445;&#23384;&#24182;&#24674;&#22797;&#24403;&#21069;&#30340;&#23545;&#35805;&#19978;&#19979;&#25991;&#8212;
            &#38500;&#38750;&#35813;&#23545;&#35805;&#24050;&#32463;&#36890;&#36807; <tt class="literal">@End(beforeRedirect=true)</tt> &#20013;&#27490;&#12290;
        </p></li></ul></div><p>
			Seam&#36879;&#26126;&#22320;&#22312;JSF postback&#20197;&#21450;&#37325;&#23450;&#21521;redirect&#26102;&#20256;&#36882;&#23545;&#35805;&#19978;&#19979;&#25991;&#12290;
			&#22914;&#26524;&#20320;&#19981;&#38656;&#35201;&#20570;&#20219;&#20309;&#29305;&#27530;&#30340;&#20107;&#24773;&#65292;&#20351;&#29992; <span class="emphasis"><em>&#8220;non-faces request&#8221;</em></span> &#65288;&#20363;&#22914;GET&#35831;&#27714;&#65289;&#23601;&#19981;&#20250;&#20256;&#36882;&#23545;&#35805;&#19978;&#19979;&#25991;&#65292;&#24182;&#19988;&#23427;&#20250;&#22312;&#19968;&#20010;&#26032;&#30340;&#20020;&#26102;&#23545;&#35805;&#20013;&#34987;&#22788;&#29702;&#12290;&#36825;&#36890;&#24120;&#65288;&#20294;&#24182;&#38750;&#24635;&#26159;&#65289;&#26159;&#25105;&#20204;&#26399;&#26395;&#30340;&#19968;&#31181;&#34892;&#20026;&#12290;
        </p><p>
			&#22914;&#26524;&#20320;&#24076;&#26395;&#22312;&#8220;non-faces request&#8221;&#20013;&#20256;&#36882;Seam&#23545;&#35805;&#65292;&#23601;&#38656;&#35201;&#26174;&#24335;&#22320;&#23558;Seam&#30340; <span class="emphasis"><em>conversation id</em></span> &#32534;&#20889;&#20026;&#19968;&#20010;request&#21442;&#25968;&#65306;
        </p><pre class="programlisting">&lt;a href="main.jsf?conversationId=#{conversation.id}"&gt;Continue&lt;/a&gt;</pre><p>
 			&#25110;&#32773;&#26356;JSF&#30340;&#20570;&#27861;&#26159;&#65306;
        </p><pre class="programlisting">&lt;h:outputLink value="main.jsf"&gt;
    &lt;f:param name="conversationId" value="#{conversation.id}"/&gt;
    &lt;h:outputText value="Continue"/&gt;
&lt;/h:outputLink&gt;</pre><p>
 			&#22914;&#26524;&#20320;&#20351;&#29992;Seam&#26631;&#31614;&#24211;&#65292;&#23601;&#31561;&#21516;&#20110;&#65306;
        </p><pre class="programlisting">&lt;h:outputLink value="main.jsf"&gt;
    &lt;s:conversationId/&gt;
    &lt;h:outputText value="Continue"/&gt;
&lt;/h:outputLink&gt;</pre><p>
			&#22914;&#26524;&#20320;&#19981;&#24819;&#32473;&#19968;&#20010;postback&#20256;&#25773;&#20250;&#35805;&#19978;&#19979;&#25991;&#65292;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#31867;&#20284;&#30340;&#23567;&#31373;&#38376;&#65306;
        </p><pre class="programlisting">&lt;h:commandLink action="main" value="Exit"&gt;
    &lt;f:param name="conversationPropagation" value="none"/&gt;
&lt;/h:commandLink&gt;</pre><p>
			&#22914;&#26524;&#20320;&#20351;&#29992;Seam&#26631;&#31614;&#24211;&#65292;&#21017;&#31561;&#21516;&#20110;&#65306;
        </p><pre class="programlisting">&lt;h:commandLink action="main" value="Exit"&gt;
    &lt;s:conversationPropagation type="none"/&gt;
&lt;/h:commandLink&gt;</pre><p>
			&#27880;&#24847;&#19981;&#20351;&#29992;&#23545;&#35805;&#19978;&#19979;&#25991;&#20256;&#25773;&#19982;&#32467;&#26463;&#23545;&#35805;&#32477;&#23545;&#19981;&#26159;&#21516;&#19968;&#22238;&#20107;&#12290;
        </p><p>
			&#35831;&#27714;&#21442;&#25968; <tt class="literal">conversationPropagation</tt>&#65292;&#25110;&#32773; <tt class="literal">&lt;s:conversationPropagation&gt;</tt> &#26631;&#31614;&#29978;&#33267;&#37117;&#21487;&#20197;&#29992;&#26469;&#24320;&#22987;&#21644;&#32467;&#26463;&#23545;&#35805;&#65292;&#25110;&#32773;&#24320;&#22987;&#19968;&#20010;&#23884;&#22871;&#23545;&#35805;&#12290;
        </p><pre class="programlisting">&lt;h:commandLink action="main" value="Exit"&gt;
    &lt;s:conversationPropagation type="end"/&gt;
&lt;/h:commandLink&gt;</pre><pre class="programlisting">&lt;h:commandLink action="main" value="Select Child"&gt;
    &lt;s:conversationPropagation type="nested"/&gt;
&lt;/h:commandLink&gt;</pre><pre class="programlisting">&lt;h:commandLink action="main" value="Select Hotel"&gt;
    &lt;s:conversationPropagation type="begin"/&gt;
&lt;/h:commandLink&gt;</pre><pre class="programlisting">&lt;h:commandLink action="main" value="Select Hotel"&gt;
    &lt;s:conversationPropagation type="join"/&gt;
&lt;/h:commandLink&gt;</pre><p>
		&#36825;&#31181;&#20250;&#35805;&#27169;&#22411;&#21487;&#20197;&#38750;&#24120;&#23481;&#26131;&#22320;&#21019;&#24314;&#22522;&#20110;&#22810;&#31383;&#21475;&#25805;&#20316;&#30340;&#24212;&#29992;&#31995;&#32479;&#12290;&#23545;&#20110;&#35768;&#22810;&#24212;&#29992;&#31243;&#24207;&#26469;&#35828;&#65292;&#36825;&#24050;&#32463;&#36275;&#22815;&#20102;&#12290;
		&#20294;&#26159;&#21478;&#22806;&#19968;&#20123;&#22797;&#26434;&#30340;&#24212;&#29992;&#31243;&#24207;&#36824;&#20250;&#38656;&#35201;&#20197;&#19979;&#39069;&#22806;&#38656;&#27714;&#20013;&#30340;&#19968;&#28857;&#25110;&#20004;&#28857;&#12290;
    </p><div class="itemizedlist"><ul type="disc"><li><p>
			&#19968;&#20010;&#23545;&#35805;&#33539;&#22260;&#36328;&#36234;&#22810;&#20010;&#26356;&#23567;&#30340;&#29992;&#25143;&#20132;&#20114;&#21333;&#20803;&#65292;&#36825;&#20123;&#23567;&#21333;&#20803;&#36880;&#20010;&#25110;&#32773;&#21516;&#27493;&#22320;&#25191;&#34892;&#12290;
			&#26356;&#23567;&#30340; <span class="emphasis"><em>&#23884;&#22871;&#23545;&#35805;</em></span> &#25317;&#26377;&#23427;&#20204;&#33258;&#24049;&#30340;&#19968;&#22871;&#29420;&#31435;&#30340;&#23545;&#35805;&#29366;&#24577;&#65292;&#24182;&#19988;&#20063;&#21487;&#20197;&#35775;&#38382;&#22806;&#37096;&#23545;&#35805;&#30340;&#29366;&#24577;&#12290;
        </p></li><li><p>
			&#29992;&#25143;&#33021;&#22815;&#22312;&#21516;&#19968;&#20010;&#27983;&#35272;&#31383;&#21475;&#20013;&#30340;&#22810;&#20010;&#23545;&#35805;&#20043;&#38388;&#36827;&#34892;&#20999;&#25442;&#12290;&#36825;&#31181;&#21151;&#33021;&#31216;&#20570; <span class="emphasis"><em>&#24037;&#20316;&#21306;&#31649;&#29702;</em></span> &#12290;
        </p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5089"></a>6.2.&nbsp;&#23884;&#22871;&#23545;&#35805;</h2></div></div><div></div></div><p>
            &#23884;&#22871;&#23545;&#35805;&#26159;&#36890;&#36807;&#22312;&#19968;&#20010;&#29616;&#26377;&#23545;&#35805;&#30340;&#33539;&#22260;&#20869;&#35843;&#29992;&#19968;&#20010;&#21517;&#20026; <tt class="literal">@Begin(nested=true)</tt> &#30340;&#26041;&#27861;&#36827;&#34892;&#21019;&#24314;&#30340;&#12290;
            &#23884;&#22871;&#23545;&#35805;&#26377;&#23427;&#33258;&#24049;&#30340;&#23545;&#35805;&#19978;&#19979;&#25991;&#65292;&#36824;&#21487;&#20197;&#21482;&#35835;&#22320;&#35775;&#38382;&#22806;&#37096;&#23545;&#35805;&#30340;&#19978;&#19979;&#25991;&#65288;&#23427;&#21487;&#20197;&#35835;&#21462;&#22806;&#37096;&#23545;&#35805;&#30340;&#19978;&#19979;&#25991;&#21464;&#37327;&#65292;&#20294;&#26159;&#19981;&#21487;&#20197;&#20889;&#65289;&#12290;
            &#38543;&#21518;&#24403;&#36935;&#21040; <tt class="literal">@End</tt> &#26102;&#65292;&#23884;&#22871;&#23545;&#35805;&#20250;&#34987;&#38144;&#27585;&#65292;&#24182;&#19988;&#22806;&#37096;&#23545;&#35805;&#20250;&#24377;&#20986;&#20250;&#35805;&#22534;&#26632;&#32487;&#32493;&#36816;&#34892;&#12290;
            &#29702;&#35770;&#19978;&#65292;&#23545;&#35805;&#21487;&#20197;&#23884;&#22871;&#21040;&#20219;&#24847;&#23618;&#28145;&#12290;
        </p><p>
			&#26576;&#20010;&#29992;&#25143;&#27963;&#21160;&#65288;&#24037;&#20316;&#21306;&#31649;&#29702;&#65292;&#25110;&#36820;&#22238;&#25353;&#38062;&#65289;&#21487;&#20197;&#22312;&#20869;&#37096;&#23545;&#35805;&#32467;&#26463;&#20043;&#21069;&#23601;&#24674;&#22797;&#22806;&#37096;&#23545;&#35805;&#12290;
			&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#19968;&#20010;&#22806;&#37096;&#23545;&#35805;&#23601;&#26377;&#21487;&#33021;&#21516;&#26102;&#25317;&#26377;&#22810;&#20010;&#23884;&#22871;&#23545;&#35805;&#12290;
			&#22914;&#26524;&#22806;&#37096;&#23545;&#35805;&#22312;&#23884;&#22871;&#23545;&#35805;&#20043;&#21069;&#23601;&#34987;&#32467;&#26463;&#65292;Seam&#23558;&#20250;&#25226;&#23884;&#22871;&#23545;&#35805;&#21644;&#22806;&#37096;&#23545;&#35805;&#19968;&#36215;&#38144;&#27585;&#25481;&#12290;
        </p><p>
			&#23545;&#35805;&#21487;&#20197;&#34987;&#35748;&#20026;&#26159;&#19968;&#20010; <span class="emphasis"><em>&#36830;&#32493;&#30340;&#29366;&#24577;</em></span> &#12290;
			&#23884;&#22871;&#23545;&#35805;&#20801;&#35768;&#24212;&#29992;&#31243;&#24207;&#22312;&#19981;&#21516;&#30340;&#29992;&#25143;&#20132;&#20114;&#28857;&#25429;&#25417;&#19968;&#33268;&#36830;&#32493;&#30340;&#29366;&#24577;&#65292;&#22240;&#27492;&#24517;&#39035;&#30830;&#20445;&#22312;&#36820;&#22238;&#25353;&#38062;&#20197;&#21450;&#24037;&#20316;&#21306;&#31649;&#29702;&#30340;&#38754;&#19978;&#26377;&#30495;&#27491;&#30340;&#27491;&#30830;&#34892;&#20026;&#12290;
        </p><p>
			TODO&#65306;&#35828;&#26126;&#24403;&#20320;&#28857;&#20987;&#36820;&#22238;&#25353;&#38062;&#26102;&#23884;&#22871;&#23545;&#35805;&#22914;&#20309;&#38450;&#27490;&#38169;&#35823;&#21457;&#29983;&#30340;&#19968;&#20010;&#20363;&#23376;&#12290;
        </p><p>
			&#36890;&#24120;&#65292;&#22914;&#26524;&#19968;&#20010;&#32452;&#20214;&#23384;&#22312;&#20110;&#24403;&#21069;&#23884;&#22871;&#23545;&#35805;&#30340;&#29238;&#23545;&#35805;&#20013;&#65292;&#23884;&#22871;&#23545;&#35805;&#20250;&#20351;&#29992;&#21516;&#19968;&#20010;&#23454;&#20363;&#12290;
			&#23569;&#25968;&#24773;&#20917;&#19979;&#65292;&#22312;&#27599;&#20010;&#23884;&#22871;&#23545;&#35805;&#20013;&#37117;&#20351;&#29992;&#19981;&#21516;&#30340;&#23454;&#20363;&#20250;&#24456;&#26377;&#29992;&#65292;&#20197;&#20415;&#23384;&#22312;&#20110;&#29238;&#23545;&#35805;&#20013;&#30340;&#32452;&#20214;&#23454;&#20363;&#23545;&#20854;&#23376;&#23545;&#35805;&#26159;&#19981;&#21487;&#35265;&#30340;&#12290;
			&#20320;&#21487;&#20197;&#36890;&#36807;&#32473;&#36825;&#20010;&#32452;&#20214;&#27880;&#35299; <tt class="literal">@PerNestedConversation</tt> &#26469;&#23454;&#29616;&#12290;
        </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5114"></a>6.3.&nbsp;&#20351;&#29992;GET&#35831;&#27714;&#26469;&#24320;&#22987;&#19968;&#20010;&#23545;&#35805;</h2></div></div><div></div></div><p>
			JSF&#24182;&#27809;&#26377;&#23450;&#20041;&#20219;&#20309;&#31867;&#22411;&#30340;action&#30417;&#21548;&#22120;&#65292;&#36825;&#31181;&#30417;&#21548;&#22120;&#20250;&#22312;&#36890;&#36807;&#38750;JSF&#35831;&#27714;&#8220;non-faces request&#8221;&#35775;&#38382;&#39029;&#38754;&#30340;&#26102;&#20505;&#34987;&#35302;&#21457;&#65288;&#20363;&#22914;&#65292;&#19968;&#20010;HTTP GET&#35831;&#27714;&#65289;&#12290;
			&#36825;&#31181;&#35302;&#21457;&#20250;&#21457;&#29983;&#22312;&#24403;&#29992;&#25143;&#29992;&#20070;&#31614;&#20445;&#23384;&#20102;&#36825;&#20010;&#39029;&#38754;&#65292;&#25110;&#32773;&#22312;&#25105;&#20204;&#36890;&#36807; <tt class="literal">&lt;h:outputLink&gt;</tt> &#35775;&#38382;&#39029;&#38754;&#30340;&#26102;&#20505;&#12290;
        </p><p>
			&#26377;&#26102;&#20505;&#65292;&#25105;&#20204;&#24076;&#26395;&#22312;&#35775;&#38382;&#39029;&#38754;&#30340;&#26102;&#20505;&#31435;&#21363;&#24320;&#22987;&#19968;&#20010;&#23545;&#35805;&#12290;
			&#30001;&#20110;&#27809;&#26377;JSF action&#26041;&#27861;&#65292;&#25105;&#20204;&#19981;&#33021;&#20197;&#23547;&#24120;&#30340;&#36890;&#36807;&#29992; <tt class="literal">@Begin</tt> &#26631;&#27880;action&#30340;&#26041;&#24335;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;
        </p><p>
			&#24403;&#39029;&#38754;&#38656;&#35201;&#25226;&#19968;&#20123;&#29366;&#24577;&#25235;&#21462;&#21040;&#19978;&#19979;&#25991;&#21464;&#37327;&#20013;&#26102;&#65292;&#21478;&#19968;&#20010;&#38382;&#39064;&#20063;&#23601;&#38543;&#20043;&#20135;&#29983;&#20102;&#12290;&#25105;&#20204;&#24050;&#32463;&#30475;&#21040;&#26377;&#20004;&#31181;&#26041;&#27861;&#21487;&#20197;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
			&#22914;&#26524;&#36825;&#20010;&#29366;&#24577;&#26159;Seam&#32452;&#20214;&#25152;&#25345;&#26377;&#30340;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#36890;&#36807; <tt class="literal">@Create</tt> &#26041;&#27861;&#26469;&#25235;&#21462;&#12290;
			&#22914;&#26524;&#19981;&#26159;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;&#20026;&#36825;&#20010;&#19978;&#19979;&#25991;&#21464;&#37327;&#23450;&#20041;&#19968;&#20010; <tt class="literal">@Factory</tt> &#26041;&#27861;&#12290;
        </p><p>
			&#22914;&#26524;&#20197;&#19978;&#20004;&#31181;&#21150;&#27861;&#37117;&#19981;&#36866;&#21512;&#20320;&#65292;Seam&#36824;&#20801;&#35768;&#20320;&#22312; <tt class="literal">pages.xml</tt> &#25991;&#20214;&#20013;&#23450;&#20041;&#19968;&#20010; <span class="emphasis"><em>page action</em></span> &#12290;
        </p><pre class="programlisting">&lt;pages&gt;
    &lt;page view-id="/messageList.jsp" action="#{messageManager.list}"/&gt;
    ...
&lt;/pages&gt;</pre><p>
            &#36825;&#20010;action&#26041;&#27861;&#22312;&#24320;&#22987;&#28210;&#26579;&#21709;&#24212;&#38454;&#27573;&#30340;&#26102;&#20505;&#34987;&#35843;&#29992;&#65292;&#21363;&#22312;&#39029;&#38754;&#23601;&#35201;&#34987;&#28210;&#26579;&#30340;&#20219;&#20309;&#26102;&#20505;&#12290;
            &#22914;&#26524;&#39029;&#38754;action&#36820;&#22238;&#19968;&#20010;&#38750;&#31354;&#30340;&#20540;&#65292;Seam&#23558;&#20250;&#26681;&#25454;Seam&#23548;&#33322;&#35268;&#21017;&#22788;&#29702;&#20219;&#20309;&#21512;&#36866;&#30340;JSF&#65292;&#21487;&#33021;&#23548;&#33268;&#28210;&#26579;&#21478;&#22806;&#19968;&#20010;&#23436;&#20840;&#19981;&#21516;&#30340;&#39029;&#38754;&#12290;
        </p><p>
			&#22914;&#26524;&#20320;&#22312;&#28210;&#26579;&#39029;&#38754;&#20043;&#21069;&#24819;&#35201;&#20570;&#30340; <span class="emphasis"><em>&#20165;&#20165;</em></span> &#26159;&#24320;&#22987;&#19968;&#20010;&#23545;&#35805;&#65292;&#37027;&#20320;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#20869;&#24314;&#30340;action&#26041;&#27861;&#65292;&#23427;&#27491;&#22909;&#20855;&#22791;&#36825;&#31181;&#21151;&#33021;&#65306;
        </p><pre class="programlisting">&lt;pages&gt;
    &lt;page view-id="/messageList.jsp" action="#{conversation.begin}"/&gt;
    ...
&lt;/pages&gt;</pre><p>
			&#27880;&#24847;&#20320;&#20063;&#21487;&#20197;&#20174;JSF&#25511;&#21046;&#22120;&#20013;&#35843;&#29992;&#20869;&#24314;&#30340;action&#26469;&#24320;&#22987;&#19968;&#20010;&#23545;&#35805;&#65292;&#21516;&#26679;&#22320;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992; <tt class="literal">#{conversation.end}</tt> &#26469;&#32467;&#26463;&#19968;&#20010;&#23545;&#35805;&#12290;
        </p><p>
			&#22914;&#26524;&#20320;&#24819;&#35201;&#26356;&#22810;&#30340;&#25511;&#21046;&#65292;&#20197;&#21152;&#20837;&#29616;&#26377;&#30340;&#23545;&#35805;&#25110;&#24320;&#22987;&#19968;&#20010;&#23884;&#22871;&#23545;&#35805;&#65292;&#24320;&#22987;&#19968;&#20010;&#39029;&#38754;&#27969;&#25110;&#32773;&#24320;&#22987;&#19968;&#20010;&#21407;&#23376;&#30340;&#23545;&#35805;&#65292;&#20320;&#24212;&#35813;&#20351;&#29992; <tt class="literal">&lt;begin-conversation&gt;</tt> &#20803;&#32032;&#12290;
        </p><pre class="programlisting">&lt;pages&gt;
    &lt;page view-id="/messageList.jsp"&gt;
       &lt;begin-conversation nested="true" pageflow="AddItem"/&gt;
    &lt;page&gt;
    ...
&lt;/pages&gt;</pre><p>
			<tt class="literal">&lt;end-conversation&gt;</tt>&#20803;&#32032;&#20063;&#21487;&#20197;&#32467;&#26463;&#19968;&#20010;&#23545;&#35805;&#12290;
        </p><pre class="programlisting">&lt;pages&gt;
    &lt;page view-id="/home.jsp"&gt;
       &lt;end-conversation/&gt;
    &lt;page&gt;
    ...
&lt;/pages&gt;</pre><p>
			&#20026;&#20102;&#35299;&#20915;&#31532;&#19968;&#20010;&#38382;&#39064;&#65292;&#25105;&#20204;&#29616;&#22312;&#26377;&#20116;&#31181;&#36873;&#25321;&#65306;
        </p><div class="itemizedlist"><ul type="disc"><li><p>
				&#29992; <tt class="literal">@Begin</tt> &#27880;&#35299; <tt class="literal">@Create</tt> &#26041;&#27861;
            </p></li><li><p>
                &#29992; <tt class="literal">@Begin</tt> &#27880;&#35299; <tt class="literal">@Factory</tt> &#26041;&#27861;
            </p></li><li><p>
                &#29992; <tt class="literal">@Begin</tt> &#27880;&#35299;Seam&#39029;&#38754;action
            </p></li><li><p>
                &#22312; <tt class="literal">pages.xml</tt> &#20013;&#20351;&#29992; <tt class="literal">&lt;begin-conversation&gt;</tt>
            </p></li><li><p>
				&#21033;&#29992; <tt class="literal">#{conversation.begin}</tt> &#20316;&#20026;Seam&#39029;&#38754;action&#26041;&#27861;
            </p></li></ul></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5215"></a>6.4.&nbsp;&#21033;&#29992;<tt class="literal">&lt;s:link&gt;</tt>&#20197;&#21450;<tt class="literal">&lt;s:button&gt;</tt></h2></div></div><div></div></div><p>
            JSF&#21629;&#20196;&#38142;&#22987;&#32456;&#36890;&#36807;JavaScript&#26469;&#25191;&#34892;&#19968;&#20010;&#34920;&#21333;&#25552;&#20132;&#65292;&#23427;&#25171;&#30772;&#20102;&#27983;&#35272;&#22120;&#30340;&#8220;&#22312;&#26032;&#31383;&#21475;&#20013;&#25171;&#24320;&#8221;&#25110;&#32773;&#8220;&#22312;&#26032;&#26631;&#31614;&#20013;&#25171;&#24320;&#8221;&#36825;&#31181;&#29305;&#28857;&#12290;
            &#22312;&#26222;&#36890;&#30340;JSF&#20013;&#65292;&#22914;&#26524;&#20320;&#38656;&#35201;&#36825;&#39033;&#21151;&#33021;&#65292;&#23601;&#38656;&#35201;&#20351;&#29992; <tt class="literal">&lt;h:outputLink&gt;</tt>&#12290;
            &#20294;&#26159; <tt class="literal">&lt;h:outputLink&gt;</tt> &#26631;&#31614;&#26377;&#20004;&#22823;&#38480;&#21046;&#12290;
        </p><div class="itemizedlist"><ul type="disc"><li><p>
            JSF&#27809;&#26377;&#25552;&#20379;&#23558;action&#30417;&#21548;&#22120;&#38468;&#21152;&#32473; <tt class="literal">&lt;h:outputLink&gt;</tt> &#30340;&#26041;&#27861;&#12290;
        </p></li><li><p>
            &#30001;&#20110;&#23454;&#38469;&#19978;&#27809;&#26377;&#25552;&#20132;&#34920;&#21333;&#65292;JSF&#24182;&#27809;&#26377;&#20256;&#25773; <tt class="literal">DataModel</tt> &#20013;&#30340;&#36873;&#20013;&#34892;&#12290;
        </p></li></ul></div><p>
			Seam&#25552;&#20379;&#20102;&#19968;&#20010; <span class="emphasis"><em>page action</em></span> &#30340;&#27010;&#24565;&#26469;&#24110;&#21161;&#35299;&#20915;&#31532;&#19968;&#20010;&#38382;&#39064;&#65292;&#20294;&#26159;&#36825;&#23545;&#20110;&#31532;&#20108;&#20010;&#38382;&#39064;&#21364;&#26080;&#33021;&#20026;&#21147;&#12290;
			&#25105;&#20204; <span class="emphasis"><em>&#21487;&#20197;</em></span> &#21033;&#29992;REST&#30340;&#26041;&#27861;&#20256;&#36882;&#35831;&#27714;&#21442;&#25968;&#20197;&#21450;&#37325;&#26032;&#26597;&#35810;&#26381;&#21153;&#31471;&#30340;&#36873;&#20013;&#23545;&#35937;&#26469;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#12290;
			&#22312;&#26576;&#20123;&#24773;&#20917;&#19979;&#8212;&#8212;&#20363;&#22914;Seam&#21338;&#23458;&#19978;&#33539;&#20363;&#24212;&#29992;&#31243;&#24207;&#37027;&#26679;&#8212;&#8212;&#36825;&#23454;&#38469;&#19978;&#26368;&#22909;&#30340;&#26041;&#27861;&#12290;REST&#39118;&#26684;&#25903;&#25345;&#20070;&#31614;&#65292;&#22240;&#20026;&#23427;&#19981;&#38656;&#35201;&#26381;&#21153;&#22120;&#31471;&#30340;&#29366;&#24577;&#12290;
			&#22312;&#20854;&#20182;&#37027;&#20123;&#25105;&#20204;&#19981;&#38656;&#35201;&#20851;&#24515;&#20070;&#31614;&#30340;&#24773;&#20917;&#19979;&#65292;&#20351;&#29992; <tt class="literal">@DataModel</tt> &#20197;&#21450; <tt class="literal">@DataModelSelection</tt> &#23601;&#24456;&#26041;&#20415;&#20063;&#24456;&#36879;&#26126;&#65281;
        </p><p>
			&#20026;&#20102;&#22635;&#34917;&#36825;&#39033;&#32570;&#22833;&#30340;&#21151;&#33021;&#65292;&#20063;&#20026;&#20102;&#20351;&#23545;&#35805;&#20256;&#25773;&#30340;&#31649;&#29702;&#21464;&#24471;&#26356;&#21152;&#31616;&#21333;&#65292;Seam&#25552;&#20379; <tt class="literal">&lt;s:link&gt;</tt> &#36825;&#26679;&#19968;&#20010;JSF&#26631;&#31614;&#12290;
        </p><p>
			&#36825;&#20010;&#36830;&#25509;&#21487;&#20197;&#20165;&#25351;&#23450;JSF&#35270;&#22270;&#30340;id&#65306;
        </p><pre class="programlisting">&lt;s:link view="/login.xhtml" value="Login"/&gt;</pre><p>
			&#25110;&#32773;&#65292;&#23427;&#21487;&#20197;&#25351;&#23450;&#19968;&#20010;action&#26041;&#27861;&#65288;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;action&#30340;&#36755;&#20986;&#23558;&#20250;&#20915;&#23450;&#32467;&#26524;&#39029;&#38754;&#65289;&#65306;
        </p><pre class="programlisting">&lt;s:link action="#{login.logout}" value="Logout"/&gt;</pre><p>
			&#22914;&#26524;&#20320;&#25226;JSF&#35270;&#22270;id&#21644;action&#26041;&#27861;&#36825; <span class="emphasis"><em>&#20004;&#32773;</em></span> &#37117;&#25351;&#23450;&#30340;&#35805;&#65292;&#8220;&#35270;&#22270;&#8221;&#23558;&#20250;&#34987;&#20351;&#29992;&#65292;
			<span class="emphasis"><em>&#38500;&#38750;</em></span>action&#26041;&#27861;&#36820;&#22238;&#19968;&#20010;&#38750;&#31354;&#30340;&#32467;&#26524;&#65306;
        </p><pre class="programlisting">&lt;s:link view="/loggedOut.xhtml"  action="#{login.logout}" value="Logout"/&gt;</pre><p>
			&#36825;&#20010;&#36830;&#25509;&#33258;&#21160;&#22320;&#21033;&#29992;&#20869;&#37096;&#30340; <tt class="literal">&lt;h:dataTable&gt;</tt> &#20256;&#25773; <tt class="literal">DataModel</tt> &#30340;&#25152;&#36873;&#34892;&#12290;
        </p><pre class="programlisting">&lt;s:link view="/hotel.xhtml" action="#{hotelSearch.selectHotel}" value="#{hotel.name}"/&gt;</pre><p>
			&#20320;&#21487;&#20197;&#19981;&#25351;&#23450;&#29616;&#26377;&#23545;&#35805;&#30340;&#33539;&#22260;&#65306;
        </p><pre class="programlisting">&lt;s:link view="/main.xhtml" propagation="none"/&gt;</pre><p>
			&#20320;&#21487;&#20197;&#24320;&#22987;&#12289;&#32467;&#26463;&#25110;&#32773;&#23884;&#22871;&#23545;&#35805;&#65306;
        </p><pre class="programlisting">&lt;s:link action="#{issueEditor.viewComment}" propagation="nest"/&gt;</pre><p>
			&#22914;&#26524;&#19968;&#20010;&#36830;&#25509;&#24320;&#22987;&#20102;&#19968;&#20010;&#23545;&#35805;&#65292;&#20320;&#29978;&#33267;&#21487;&#20197;&#25351;&#23450;&#19968;&#20010;&#35201;&#20351;&#29992;&#30340;&#39029;&#38754;&#27969;&#65306;
        </p><pre class="programlisting">&lt;s:link action="#{documentEditor.getDocument}" propagation="begin"
        pageflow="EditDocument"/&gt;</pre><p>
			&#22914;&#26524;&#20351;&#29992;jBPM&#20219;&#21153;&#21015;&#34920;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#20351;&#29992; <tt class="literal">taskInstance</tt> &#23646;&#24615;&#65306;
        </p><pre class="programlisting">&lt;s:link action="#{documentApproval.approveOrReject}" taskInstance="#{task}"/&gt;</pre><p>
			&#65288;&#35831;&#35265;DVD Store&#28436;&#31034;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#38024;&#23545;&#20197;&#19978;&#29992;&#27861;&#30340;&#33539;&#20363;&#12290;&#65289;
        </p><p>
			&#26368;&#21518;&#65292;&#22914;&#26524;&#20320;&#24076;&#26395;&#8220;&#38142;&#25509;&#8221;&#34987;&#28210;&#26579;&#25104;&#20026;&#19968;&#20010;&#25353;&#38062;&#65292;&#23601;&#20351;&#29992; <tt class="literal">&lt;s:button&gt;</tt>&#65306;
        </p><pre class="programlisting">&lt;s:button action="#{login.logout}" value="Logout"/&gt;</pre></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5319"></a>6.5.&nbsp;&#25104;&#21151;&#20449;&#24687;</h2></div></div><div></div></div><p>
			&#32473;&#29992;&#25143;&#26174;&#31034;&#19968;&#26465;action&#25191;&#34892;&#25104;&#21151;&#25110;&#32773;&#22833;&#36133;&#30340;&#28040;&#24687;&#26159;&#30456;&#24403;&#24120;&#35265;&#30340;&#21151;&#33021;&#12290;&#20026;&#27492;&#20351;&#29992;JSF&#30340; <tt class="literal">FacesMessage</tt> &#26159;&#38750;&#24120;&#26041;&#20415;&#30340;&#12290;
			&#19981;&#24184;&#30340;&#26159;&#65292;&#25104;&#21151;&#30340;action&#36890;&#24120;&#38656;&#35201;&#19968;&#20010;&#27983;&#35272;&#22120;&#37325;&#23450;&#21521;&#12290;&#36825;&#20351;&#24471;&#22312;&#26222;&#36890;&#30340;JSF&#20013;&#26174;&#31034;&#25104;&#21151;&#20449;&#24687;&#21464;&#24471;&#30456;&#24403;&#22256;&#38590;&#12290;
        </p><p>
			&#20869;&#24314;&#30340;&#20250;&#35805;&#33539;&#22260;&#30340;Seam&#32452;&#20214; <tt class="literal">facesMessages</tt> &#35299;&#20915;&#20102;&#36825;&#20010;&#38382;&#39064;&#12290;
			&#65288;&#20320;&#24517;&#39035;&#23433;&#35013;Seam&#37325;&#23450;&#21521;&#36807;&#28388;&#22120;&#12290;&#65289;
        </p><pre class="programlisting">@Name("editDocumentAction")
@Stateless
public class EditDocumentBean implements EditDocument {
    @In EntityManager em;
    @In Document document;
    @In FacesMessages facesMessages;

    public String update() {
        em.merge(document);
        facesMessages.add("Document updated");
    }
}</pre><p>
			&#23545;&#20110;&#24403;&#21069;&#30340;&#20250;&#35805;&#26469;&#35828;&#65292;&#20219;&#20309;&#21152;&#20837;&#21040; <tt class="literal">facesMessages</tt> &#30340;&#28040;&#24687;&#37117;&#27491;&#22909;&#29992;&#22312;&#19979;&#19968;&#20010;&#28210;&#26579;&#38454;&#27573;&#20013;&#12290;
			&#29978;&#33267;&#24403;&#27809;&#26377;&#8220;&#38271;&#26102;&#38388;&#36816;&#34892;&#8221;&#23545;&#35805;&#30340;&#26102;&#20505;&#20063;&#20250;&#22863;&#25928;&#65292;&#22240;&#20026;Seam&#29978;&#33267;&#22312;&#37325;&#23450;&#21521;&#36807;&#31243;&#20013;&#20445;&#30041;&#20102;&#20020;&#26102;&#23545;&#35805;&#12290;
        </p><p>
			&#20320;&#29978;&#33267;&#21487;&#20197;&#22312;faces message&#27010;&#36848;&#20013;&#21253;&#21547;JSF EL&#34920;&#36798;&#24335;&#65306;
        </p><pre class="programlisting">facesMessages.add("Document #{document.title} was updated");</pre><p>
			&#20320;&#21487;&#20197;&#25353;&#29031;&#36890;&#24120;&#30340;&#26041;&#24335;&#26174;&#31034;&#28040;&#24687;&#65292;&#20363;&#22914;&#65306;
        </p><pre class="programlisting">&lt;h:messages globalOnly="true"/&gt;</pre></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5347"></a>6.6.&nbsp;&#20351;&#29992;&#8220;&#26174;&#24335;&#8221;&#30340;&#23545;&#35805;id</h2></div></div><div></div></div><p>
            &#36890;&#24120;&#24773;&#20917;&#19979;&#65292;Seam&#20250;&#32473;&#27599;&#20010;&#23545;&#35805;&#20135;&#29983;&#19968;&#20010;&#26080;&#24847;&#20041;&#19988;&#21807;&#19968;&#30340;id&#12290;&#20320;&#21487;&#20197;&#22312;&#20320;&#24320;&#22987;&#19968;&#20010;&#23545;&#35805;&#30340;&#26102;&#20505;&#23450;&#21046;id&#30340;&#20540;&#12290;
        </p><p>
			&#36825;&#20010;&#29305;&#24615;&#21487;&#20197;&#29992;&#26469;&#23450;&#21046;&#20250;&#35805;id&#29983;&#25104;&#31639;&#27861;&#65292;&#20687;&#36825;&#26679;&#65306;
        </p><pre class="programlisting">@Begin(id="#{myConversationIdGenerator.nextId}")
public void editHotel() { ... }</pre><p>
			&#25110;&#32773;&#23427;&#21487;&#20197;&#29992;&#26469;&#20998;&#37197;&#19968;&#20010;&#26377;&#24847;&#20041;&#30340;&#23545;&#35805;id&#65306;
        </p><pre class="programlisting">@Begin(id="hotel#{hotel.id}")
public String editHotel() { ... }</pre><pre class="programlisting">@Begin(id="hotel#{hotelsDataModel.rowData.id}")
public String selectHotel() { ... }</pre><pre class="programlisting">@Begin(id="entry#{params['blogId']}")
public String viewBlogEntry() { ... }</pre><pre class="programlisting">@BeginTask(id="task#{taskInstance.id}")
public String approveDocument() { ... }</pre><p>
            &#27627;&#26080;&#30097;&#38382;&#65292;&#27599;&#24403;&#36873;&#20013;&#19968;&#23478;&#29305;&#27530;&#30340;&#37202;&#24215;&#12289;&#19968;&#31687;&#29305;&#27530;&#30340;&#21338;&#23458;&#25110;&#32773;&#19968;&#39033;&#29305;&#27530;&#30340;&#20219;&#21153;&#26102;&#65292;&#36825;&#20123;&#20363;&#23376;&#37117;&#20250;&#20135;&#29983;&#19968;&#20010;&#30456;&#21516;&#30340;&#23545;&#35805;id&#12290;
            &#37027;&#20040;&#65292;&#22914;&#26524;&#19968;&#30456;&#26032;&#23545;&#35805;&#24320;&#22987;&#26102;&#24050;&#32463;&#23384;&#22312;&#19968;&#20010;&#21253;&#21547;&#30456;&#21516;&#23545;&#35805;id&#30340;&#23545;&#35805;&#26102;&#65292;&#20250;&#21457;&#29983;&#20160;&#20040;&#24773;&#20917;&#21602;&#65311;
            &#21999;&#65292;Seam&#31455;&#28982;&#20250;&#21457;&#29616;&#29616;&#26377;&#30340;&#23545;&#35805;&#65292;&#24182;&#37325;&#23450;&#21521;&#21040;&#35813;&#23545;&#35805;&#65292;&#32780;&#19981;&#21435;&#20877;&#27425;&#36816;&#34892; <tt class="literal">@Begin</tt> &#26041;&#27861;&#12290;
            &#36825;&#20010;&#29305;&#24615;&#20250;&#24110;&#21161;&#25105;&#20204;&#25511;&#21046;&#22312;&#20351;&#29992;&#24037;&#20316;&#21306;&#31649;&#29702;&#26102;&#21019;&#24314;&#30340;&#22810;&#20010;&#24037;&#20316;&#21306;&#12290;
        </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5371"></a>6.7.&nbsp;&#24037;&#20316;&#21306;&#31649;&#29702;</h2></div></div><div></div></div><p>
			&#24037;&#20316;&#21306;&#31649;&#29702;&#25351;&#30340;&#26159;&#21487;&#20197;&#22312;&#19968;&#20010;&#21333;&#29420;&#30340;&#31383;&#21475;&#20013;"&#20999;&#25442;"&#22810;&#20010;&#23545;&#35805;&#30340;&#33021;&#21147;&#12290;
			Seam&#22312;Java&#20195;&#30721;&#32423;&#21035;&#23436;&#20840;&#36879;&#26126;&#22320;&#31649;&#29702;&#24037;&#20316;&#21306;&#12290;&#20026;&#20102;&#21551;&#29992;&#24037;&#20316;&#21306;&#31649;&#29702;&#65292;&#20320;&#25152;&#38656;&#35201;&#20570;&#30340;&#20840;&#37096;&#20107;&#24773;&#22914;&#19979;&#65306;
        </p><div class="itemizedlist"><ul type="disc"><li><p>
				&#20026;&#27599;&#20010;&#35270;&#22270;id&#65288;&#22312;&#20351;&#29992;JSF&#25110;Seam&#23548;&#33322;&#35268;&#21017;&#26102;&#65289;&#25110;&#32773;&#39029;&#38754;&#33410;&#28857;&#65288;&#22312;&#20351;&#29992;JPDL&#39029;&#38754;&#27969;&#26102;&#65289;&#25552;&#20379;&#19968;&#20010; <span class="emphasis"><em>&#25551;&#36848;</em></span> &#25991;&#26412;&#12290;
				&#36825;&#20010;&#25551;&#36848;&#25991;&#26412;&#36890;&#36807;&#24037;&#20316;&#21306;&#20999;&#25442;&#22120;&#26174;&#31034;&#32473;&#29992;&#25143;&#12290;
            </p></li><li><p>
				&#22312;&#20320;&#30340;&#39029;&#38754;&#20013;&#21253;&#21547;&#19968;&#20010;&#25110;&#22810;&#20010;&#26631;&#20934;JSP&#25110;facelets&#29255;&#26029;&#30340;&#24037;&#20316;&#21306;&#36716;&#25442;&#22120;&#12290;
				&#26631;&#20934;&#29255;&#26029;&#25903;&#25345;&#36890;&#36807;&#19979;&#25289;&#33756;&#21333;&#12289;&#23545;&#35805;&#21015;&#34920;&#25110;&#32773;&#23548;&#33322;&#25511;&#20214;&#26469;&#31649;&#29702;&#24037;&#20316;&#21306;&#12290;
                </p></li></ul></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5386"></a>6.7.1.&nbsp;&#24037;&#20316;&#21306;&#31649;&#29702;&#21450;JSF&#23548;&#33322;</h3></div></div><div></div></div><p>
				&#24403;&#20320;&#20351;&#29992;JSF&#25110;&#32773;Seam&#23548;&#33322;&#35268;&#21017;&#30340;&#26102;&#20505;&#65292;Seam&#20250;&#36890;&#36807;&#24674;&#22797;&#23545;&#35805;&#30340;&#24403;&#21069; <tt class="literal">view-id</tt> &#20999;&#25442;&#21040;&#35813;&#23545;&#35805;&#12290;
				&#24037;&#20316;&#21306;&#30340;&#25551;&#36848;&#25991;&#26412;&#22312;&#19968;&#20010;&#21517;&#20026; <tt class="literal">pages.xml</tt> &#30340;&#25991;&#20214;&#20013;&#23450;&#20041;&#65292;
				Seam&#24076;&#26395;&#22312; <tt class="literal">WEB-INF</tt> &#30446;&#24405;&#20013;&#25214;&#21040;&#23427;&#65292;&#36825;&#20010;&#25991;&#20214;&#23601;&#25918;&#22312; <tt class="literal">faces-config.xml</tt> &#26049;&#36793;&#12290;
            </p><pre class="programlisting">&lt;pages&gt;
    &lt;page view-id="/main.xhtml"&gt;Search hotels: #{hotelBooking.searchString}&lt;/page&gt;
    &lt;page view-id="/hotel.xhtml"&gt;View hotel: #{hotel.name}&lt;/page&gt;
    &lt;page view-id="/book.xhtml"&gt;Book hotel: #{hotel.name}&lt;/page&gt;
    &lt;page view-id="/confirm.xhtml"&gt;Confirm: #{booking.description}&lt;/page&gt;
&lt;/pages&gt;</pre><p>
			   &#27880;&#24847;&#65292;&#22914;&#26524;&#25214;&#19981;&#21040;&#36825;&#20010;&#25991;&#20214;&#65292;Seam&#24212;&#29992;&#31243;&#24207;&#20250;&#32487;&#32493;&#27491;&#24120;&#22320;&#36816;&#34892;&#65281;&#21482;&#19981;&#36807;&#20250;&#22833;&#21435;&#20999;&#25442;&#24037;&#20316;&#21306;&#30340;&#21151;&#33021;&#12290;
           </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5407"></a>6.7.2.&nbsp;&#24037;&#20316;&#21306;&#31649;&#29702;&#21644;jPDL&#39029;&#38754;&#27969;</h3></div></div><div></div></div><p>
                &#24403;&#20320;&#20351;&#29992;jPDL&#39029;&#38754;&#27969;&#31243;&#23450;&#20041;&#30340;&#26102;&#20505;&#65292;Seam&#36890;&#36807;&#24674;&#22797;&#24403;&#21069;jBPM&#27969;&#31243;&#29366;&#24577;&#20999;&#25442;&#21040;&#19968;&#20010;&#23545;&#35805;&#12290;
                &#36825;&#26159;&#19968;&#20010;&#26356;&#21152;&#28789;&#27963;&#30340;&#27169;&#22411;&#65292;&#22240;&#20026;&#23427;&#20801;&#35768;&#21516;&#19968;&#20010; <tt class="literal">view-id</tt> &#26681;&#25454;&#24403;&#21069;&#30340; <tt class="literal">&lt;&#39029;&#38754;&gt;</tt> &#33410;&#28857;&#32780;&#25317;&#26377;&#19981;&#21516;&#30340;&#25551;&#36848;&#12290;
                &#36825;&#20010;&#25551;&#36848;&#25991;&#26412;&#36890;&#36807; <tt class="literal">&lt;page&gt;</tt> &#33410;&#28857;&#26469;&#23450;&#20041;&#12290;
            </p><pre class="programlisting">&lt;pageflow-definition name="shopping"&gt;

   &lt;start-state name="start"&gt;
      &lt;transition to="browse"/&gt;
   &lt;/start-state&gt;

   &lt;page name="browse" view-id="/browse.xhtml"&gt;
      &lt;description&gt;DVD Search: #{search.searchPattern}&lt;/description&gt;
      &lt;transition to="browse"/&gt;
      &lt;transition name="checkout" to="checkout"/&gt;
   &lt;/page&gt;

   &lt;page name="checkout" view-id="/checkout.xhtml"&gt;
      &lt;description&gt;Purchase: $#{cart.total}&lt;/description&gt;
      &lt;transition to="checkout"/&gt;
      &lt;transition name="complete" to="complete"/&gt;
   &lt;/page&gt;

   &lt;page name="complete" view-id="/complete.xhtml"&gt;
      &lt;end-conversation /&gt;
   &lt;/page&gt;

&lt;/pageflow-definition&gt;</pre></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5423"></a>6.7.3.&nbsp;&#23545;&#35805;&#36716;&#25442;&#22120;</h3></div></div><div></div></div><p>
				&#22312;&#20320;&#30340;JSP&#25110;facelets&#39029;&#38754;&#20013;&#21253;&#21547;&#20197;&#19979;&#20195;&#30721;&#29255;&#26029;&#65292;&#20197;&#33719;&#24471;&#20351;&#20320;&#21487;&#20197;&#36716;&#25442;&#21040;&#20219;&#20309;&#24403;&#21069;&#23545;&#35805;&#25110;&#32773;&#24212;&#29992;&#31243;&#24207;&#30340;&#20219;&#20309;&#20854;&#20182;&#39029;&#38754;&#30340;&#19968;&#20010;&#19979;&#25289;&#33756;&#21333;&#65306;
            </p><pre class="programlisting">&lt;h:selectOneMenu value="#{switcher.conversationIdOrOutcome}"&gt;
    &lt;f:selectItem itemLabel="Find Issues" itemValue="findIssue"/&gt;
    &lt;f:selectItem itemLabel="Create Issue" itemValue="editIssue"/&gt;
    &lt;f:selectItems value="#{switcher.selectItems}"/&gt;
&lt;/h:selectOneMenu&gt;
&lt;h:commandButton action="#{switcher.select}" value="Switch"/&gt;</pre><p>
                In this example, we have a menu that includes an item for each
                conversation, together with two additional items that let the
                user begin a new conversation.
				&#22312;&#36825;&#20010;&#20363;&#23376;&#20013;&#65292;&#25105;&#20204;&#26377;&#19968;&#33756;&#21333;&#65292;&#23427;&#20026;&#27599;&#19968;&#20010;&#23545;&#35805;&#37117;&#21253;&#21547;&#20102;&#19968;&#20010;&#26465;&#30446;&#65292;&#21478;&#22806;&#36824;&#26377;&#20004;&#20010;&#35753;&#29992;&#25143;&#24320;&#22987;&#26032;&#23545;&#35805;&#30340;&#26465;&#30446;&#12290;
            </p><p>
                Only conversations with a description will be included in the
                drop-down menu.
            </p><div class="mediaobject" align="center"><img src="images/switcher.png" align="middle"></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5439"></a>6.7.4.&nbsp;&#23545;&#35805;&#21015;&#34920;</h3></div></div><div></div></div><p>
				&#38500;&#20102;&#23545;&#35805;&#21015;&#34920;&#20250;&#26174;&#31034;&#25104;&#20026;&#19968;&#20010;&#34920;&#26684;&#20197;&#22806;&#65292;&#23427;&#19982;&#23545;&#35805;&#36716;&#25442;&#22120;&#38750;&#24120;&#30456;&#20284;&#65306;
            </p><pre class="programlisting">&lt;h:dataTable value="#{conversationList}" var="entry"
        rendered="#{not empty conversationList}"&gt;
    &lt;h:column&gt;
        &lt;f:facet name="header"&gt;Workspace&lt;/f:facet&gt;
        &lt;h:commandLink action="#{entry.select}" value="#{entry.description}"/&gt;
        &lt;h:outputText value="[current]" rendered="#{entry.current}"/&gt;
    &lt;/h:column&gt;
    &lt;h:column&gt;
        &lt;f:facet name="header"&gt;Activity&lt;/f:facet&gt;
        &lt;h:outputText value="#{entry.startDatetime}"&gt;
            &lt;f:convertDateTime type="time" pattern="hh:mm a"/&gt;
        &lt;/h:outputText&gt;
        &lt;h:outputText value=" - "/&gt;
        &lt;h:outputText value="#{entry.lastDatetime}"&gt;
            &lt;f:convertDateTime type="time" pattern="hh:mm a"/&gt;
        &lt;/h:outputText&gt;
    &lt;/h:column&gt;
    &lt;h:column&gt;
        &lt;f:facet name="header"&gt;Action&lt;/f:facet&gt;
        &lt;h:commandButton action="#{entry.select}" value="#{msg.Switch}"/&gt;
        &lt;h:commandButton action="#{entry.destroy}" value="#{msg.Destroy}"/&gt;
    &lt;/h:column&gt;
&lt;/h:dataTable&gt;</pre><p>
				&#25105;&#20204;&#35774;&#24819;&#20320;&#24819;&#35201;&#26681;&#25454;&#20320;&#33258;&#24049;&#30340;&#24212;&#29992;&#31243;&#24207;&#21435;&#23450;&#21046;&#36825;&#20010;&#12290;
            </p><div class="mediaobject" align="center"><img src="images/list.png" align="middle"></div><p>
                &#21482;&#26377;&#24102;&#26377;&#25551;&#36848;&#30340;&#23545;&#35805;&#25165;&#20250;&#34987;&#21253;&#21547;&#22312;&#21015;&#34920;&#20013;&#12290;
            </p><p>
				&#27880;&#24847;&#23545;&#35805;&#21015;&#34920;&#20801;&#35768;&#29992;&#25143;&#38144;&#27585;&#24037;&#20316;&#21306;&#12290;
            </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5457"></a>6.7.5.&nbsp;&#23548;&#33322;&#25511;&#20214;</h3></div></div><div></div></div><p>
				&#23548;&#33322;&#25511;&#20214;&#22312;&#20351;&#29992;&#23884;&#22871;&#23545;&#35805;&#27169;&#24335;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#24456;&#26377;&#29992;&#12290;&#23548;&#33322;&#25511;&#20214;&#26159;&#24403;&#21069;&#23545;&#35805;&#22534;&#26632;&#20013;&#23545;&#35805;&#38142;&#25509;&#30340;&#19968;&#20010;&#21015;&#34920;&#12290;
            </p><pre class="programlisting">&lt;ui:repeat value="#{conversationStack}" var="entry"&gt;
    &lt;h:outputText value=" | "/&gt;
    &lt;h:commandLink value="#{entry.description}" action="#{entry.select}"/&gt;
&lt;/ui:repeat</pre><div class="mediaobject" align="center"><img src="images/breadcrumbs.png" align="middle"></div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5469"></a>6.8.&nbsp;&#23545;&#35805;&#32452;&#20214;&#21644;JSF&#32452;&#20214;&#32465;&#23450;</h2></div></div><div></div></div><p>
			&#23545;&#35805;&#32452;&#20214;&#26377;&#19968;&#20010;&#23567;&#23567;&#30340;&#38480;&#21046;&#65306;&#23427;&#20204;&#19981;&#33021;&#22815;&#34987;&#29992;&#26469;&#20445;&#23384;&#23545;JSF&#32452;&#20214;&#30340;&#32465;&#23450;&#12290;
			&#65288;&#38500;&#38750;&#32477;&#23545;&#24517;&#35201;&#65292;&#21542;&#21017;&#25105;&#20204;&#36890;&#24120;&#19981;&#21916;&#27426;&#20351;&#29992;JSF&#30340;&#36825;&#20010;&#29305;&#24615;&#65292;&#22240;&#20026;&#23427;&#21019;&#24314;&#20102;&#20174;&#24212;&#29992;&#31243;&#24207;&#36923;&#36753;&#21040;&#35270;&#22270;&#30340;&#24378;&#20381;&#36182;&#20851;&#31995;&#12290;&#65289;
			&#22312;&#19968;&#20010;postback&#35831;&#27714;&#20013;&#65292;&#32452;&#20214;&#32465;&#23450;&#20250;&#22312;&#35270;&#22270;&#24674;&#22797;&#38454;&#27573;&#20013;&#19988;&#22312;Seam&#23545;&#35805;&#19978;&#19979;&#25991;&#24674;&#22797;&#20043;&#21069;&#34987;&#26356;&#26032;&#12290;
        </p><p>
            &#20026;&#20102;&#35299;&#20915;&#36825;&#20010;&#38382;&#39064;&#65292;&#20351;&#29992;&#19968;&#20010;&#20107;&#20214;&#33539;&#22260;&#30340;&#32452;&#20214;&#26469;&#20445;&#23384;&#32452;&#20214;&#32465;&#23450;&#65292;&#24182;&#23558;&#23427;&#27880;&#20837;&#21040;&#38656;&#35201;&#23427;&#30340;&#23545;&#35805;&#33539;&#22260;&#32452;&#20214;&#20013;&#12290;
        </p><pre class="programlisting">@Name("grid")
@Scope(ScopeType.EVENT)
public class Grid
{
    private HtmlPanelGrid htmlPanelGrid;

    // getters and setters
    ...
}</pre><pre class="programlisting">@Name("gridEditor")
@Scope(ScopeType.CONVERSATION)
public class GridEditor
{
    @In(required=false)
    private Grid grid;

    ...
}</pre><p>
		  &#21478;&#22806;&#19968;&#31181;&#36873;&#25321;&#26159;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#38544;&#24335;&#30340; <tt class="literal">uiComponent</tt> &#21477;&#26564;&#26469;&#35775;&#38382;JSF&#32452;&#20214;&#26641;&#12290;
		  &#19979;&#38754;&#36825;&#20010;&#20363;&#23376;&#35775;&#38382;&#22312;&#36845;&#20195;&#20013;&#25903;&#25345;&#25968;&#25454;&#34920;&#30340; <tt class="literal">UIData</tt> &#32452;&#20214;&#30340; <tt class="literal">getRowIndex()</tt> &#65292;&#23427;&#25171;&#21360;&#24403;&#21069;&#30340;&#34892;&#25968;&#65306;
       </p><pre class="programlisting">
&lt;h:dataTable id="lineItemTable" var="lineItem" value="#{orderHome.lineItems}"&gt;
   &lt;h:column&gt;
      Row: #{uiComponent['lineItemTable'].rowIndex}
   &lt;/h:column&gt;
   ...
&lt;/h:dataTable&gt;</pre><p>
		  &#22312;&#36825;&#20010;map&#20013;&#65292;&#21487;&#20197;&#24471;&#21040;JSF UI&#32452;&#20214;&#21644;&#23427;&#20204;&#30340;&#23458;&#25143;&#26631;&#35782;&#31526;&#12290;
       </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e5495"></a>6.9.&nbsp;&#23545;&#35805;&#32452;&#20214;&#30340;&#24182;&#21457;&#35843;&#29992;</h2></div></div><div></div></div><p>
        &#22312; ??? &#20013;&#21487;&#20197;&#25214;&#21040;Seam&#32452;&#20214;&#24182;&#21457;&#35843;&#29992;&#30340;&#20840;&#37096;&#35752;&#35770;&#12290;
        &#22312;&#36825;&#37324;&#65292;&#25105;&#20204;&#35201;&#35752;&#35770;&#26159;&#24120;&#35265;&#30340;&#19968;&#31181;&#24182;&#21457;&#24773;&#24418;&#65292;&#22312;&#36825;&#31181;&#24773;&#24418;&#19979;&#65292;&#20320;&#20250;&#36935;&#21040;&#20174;AJAX&#35831;&#27714;&#20013;&#35775;&#38382;&#23545;&#35805;&#32452;&#20214;&#30340;&#24182;&#21457;&#8212;&#12290;
        &#25105;&#20204;&#23601;&#35201;&#35752;&#35770;&#19968;&#20010;Ajax&#23458;&#25143;&#31471;&#24211;&#24212;&#35813;&#25552;&#20379;&#29992;&#26469;&#25511;&#21046;&#28304;&#33258;&#23458;&#25143;&#31471;&#30340;&#20107;&#20214;&#30340;&#36873;&#39033;&#8212;&#65292;&#24182;&#30475;&#30475;RickFaces&#20026;&#20320;&#25552;&#20379;&#30340;&#36873;&#39033;&#12290;
      </p><p>
		&#23545;&#35805;&#32452;&#20214;&#23454;&#38469;&#19978;&#24182;&#19981;&#20801;&#35768;&#30495;&#27491;&#30340;&#24182;&#21457;&#35775;&#38382;&#65292;&#22240;&#27492;Seam&#20250;&#32473;&#27599;&#19968;&#20010;&#35831;&#27714;&#25490;&#19968;&#20010;&#38431;&#21015;&#24182;&#20381;&#27425;&#22788;&#29702;&#23427;&#20204;&#12290;&#36825;&#26679;&#20801;&#35768;&#27599;&#20010;&#35831;&#27714;&#37117;&#20197;&#19968;&#31181;&#29305;&#23450;&#30340;&#26041;&#24335;&#34987;&#25191;&#34892;&#12290;
		&#20294;&#26159;&#65292;&#31616;&#21333;&#30340;&#38431;&#21015;&#19981;&#26159;&#37027;&#20040;&#24378;&#22823;&#8212;&#39318;&#20808;&#65292;&#30001;&#20110;&#26576;&#20123;&#21407;&#22240;&#65292;&#22914;&#26524;&#19968;&#20010;&#26041;&#27861;&#38656;&#35201;&#38750;&#24120;&#38271;&#30340;&#26102;&#38388;&#26469;&#23436;&#25104;&#65292;&#24182;&#19988;&#27599;&#27425;&#29983;&#25104;&#19968;&#20010;&#38169;&#35823;&#30340;&#35831;&#27714;&#26102;&#23601;&#19968;&#27425;&#21448;&#19968;&#27425;&#30340;&#21453;&#22797;&#36816;&#34892;&#65288;&#28508;&#22312;&#25298;&#32477;&#26381;&#21153;&#25915;&#20987;&#30340;&#21487;&#33021;&#65289;&#12290;
		&#20854;&#27425;,AJAX&#32463;&#24120;&#34987;&#29992;&#20110;&#32473;&#29992;&#25143;&#25552;&#20379;&#24555;&#36895;&#30340;&#29366;&#24577;&#26356;&#26032;&#65292;&#22240;&#27492;&#25345;&#32493;&#22320;&#38271;&#26102;&#38388;&#36816;&#34892;&#35813;&#21160;&#20316;&#24182;&#27809;&#26377;&#20160;&#20040;&#29992;&#22788;&#12290;
      </p><p>
		&#22240;&#27492;Seam&#32473;action&#20107;&#20214;&#25490;&#38431;&#31561;&#24453;&#19968;&#27573;&#26102;&#38388;&#65288;&#24182;&#21457;&#30340;&#35831;&#27714;&#36229;&#26102;&#65289;&#65307;
		&#22914;&#26524;&#19981;&#33021;&#21450;&#26102;&#22788;&#29702;&#20107;&#20214;&#65292;&#23427;&#23601;&#20250;&#21019;&#24314;&#19968;&#20010;&#20020;&#26102;&#30340;&#23545;&#35805;&#24182;&#19988;&#32473;&#29992;&#25143;&#25171;&#21360;&#19968;&#26465;&#20449;&#24687;&#65292;&#35753;&#20182;&#20204;&#20102;&#35299;&#24773;&#20917;&#12290;
		&#25152;&#20197;&#19981;&#35201;&#32473;&#26381;&#21153;&#22120;&#21457;&#36865;&#27867;&#28389;&#30340;AJAX&#20107;&#20214;&#65292;&#36825;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#12290;
      </p><p>
		&#25105;&#20204;&#21487;&#20197;&#22312;components.xml&#25991;&#20214;&#20013;&#32473;&#24182;&#21457;&#30340;&#35831;&#27714;&#36229;&#26102;&#35774;&#32622;&#19968;&#20010;&#21512;&#29702;&#30340;&#36229;&#26102;&#40664;&#35748;&#20540;&#65288;ms&#65289;&#12290;
      </p><pre class="programlisting">&lt;core:manager concurrent-request-timeout="500" /&gt;</pre><p>
	  &#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#25105;&#20204;&#24050;&#32463;&#35752;&#35770;&#20102;&#21516;&#27493;&#30340;AJAX&#35831;&#27714;&#8212;&#8212; &#23458;&#25143;&#31471;&#21578;&#35785;&#26381;&#21153;&#22120;&#21457;&#29983;&#20102;&#19968;&#20010;&#20107;&#20214;&#65292;&#28982;&#21518;&#26681;&#25454;&#36820;&#22238;&#20540;&#26469;&#37325;&#26032;&#28210;&#26579;&#23616;&#37096;&#39029;&#38754;&#12290;
	  &#24403;AJAX&#35831;&#27714;&#26159;&#36731;&#37327;&#32423;&#26102;&#65292;&#37319;&#29992;&#36825;&#31181;&#26041;&#27861;&#23601;&#30456;&#24403;&#22909;&#65288;&#36825;&#20123;&#26041;&#27861;&#30340;&#35843;&#29992;&#20063;&#31616;&#21333;&#65292;&#22914;&#65306;&#35745;&#31639;&#19968;&#21015;&#25968;&#23383;&#30340;&#24635;&#21644;&#65289;&#12290;
	  &#20294;&#26159;&#24403;&#25105;&#20204;&#38656;&#35201;&#20570;&#22797;&#26434;&#30340;&#35745;&#31639;&#26102;&#25105;&#20204;&#24212;&#35813;&#24590;&#20040;&#20570;&#21602;&#65311;
    </p><p>
	  &#23545;&#20110;&#22823;&#37327;&#30340;&#35745;&#31639;&#25105;&#20204;&#24212;&#24403;&#20351;&#29992;&#30495;&#27491;&#30340;&#24322;&#27493;&#65288;&#22522;&#20110;&#36718;&#35810;&#8220;Poll&#8221;&#30340;&#65289;&#26041;&#27861; &#8212;
	  &#23458;&#25143;&#31471;&#21457;&#36865;&#19968;&#20010;AJAX&#35831;&#27714;&#21040;&#26381;&#21153;&#22120;&#65292;&#36825;&#20351;&#24471;&#19968;&#20010;action&#22312;&#26381;&#21153;&#22120;&#31471;&#34987;&#24322;&#27493;&#22320;&#25191;&#34892;&#65288;&#22240;&#27492;&#31435;&#21363;&#23601;&#20250;&#21709;&#24212;&#23458;&#25143;&#31471;&#65289;&#65307;&#28982;&#21518;&#23458;&#25143;&#31471;&#20250;&#22312;&#26381;&#21153;&#22120;&#20013;&#26597;&#35810;&#26356;&#26032;&#12290;
	  &#24403;&#20320;&#36816;&#34892;&#19968;&#20010;&#38271;&#26102;&#38388;&#36816;&#34892;&#30340;&#25805;&#20316;&#26102;&#23427;&#24456;&#26377;&#29992;&#65292;&#22240;&#20026;&#27599;&#19968;&#20010;action&#37117;&#21487;&#20197;&#25191;&#34892;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65288;&#20320;&#19981;&#20250;&#24076;&#26395;&#26576;&#20123;action&#30001;&#20110;&#37325;&#22797;&#25110;&#32773;&#36229;&#26102;&#32780;&#34987;&#20002;&#24323;&#65289;&#12290;
    </p><p>
      <span class="emphasis"><em>&#25105;&#20204;&#24212;&#22914;&#20309;&#26469;&#35774;&#35745;&#23545;&#35805;&#30340;AJAX&#24212;&#29992;&#31243;&#24207;&#21602;&#65311;</em></span>
    </p><p>
	  &#39318;&#20808;&#65292;&#20320;&#38656;&#35201;&#20915;&#23450;&#26159;&#21542;&#24819;&#20351;&#29992;&#26356;&#31616;&#21333;&#30340;&#8220;&#21516;&#27493;&#8221;&#35831;&#26041;&#24335;&#65292;&#25110;&#32773;&#26159;&#21542;&#24819;&#35201;&#21033;&#29992;&#8220;Poll&#39118;&#26684;&#8221;&#30340;&#26041;&#27861;&#12290;
    </p><p>
	  &#22914;&#26524;&#20320;&#35201;&#20351;&#29992;&#8220;&#21516;&#27493;&#8221;&#35831;&#27714;&#30340;&#26041;&#27861;&#65292;&#37027;&#20040;&#20320;&#38656;&#35201;&#35780;&#20272;&#19968;&#19979;&#20320;&#30340;AJAX&#35831;&#27714;&#38656;&#35201;&#22810;&#38271;&#26102;&#38388;&#25165;&#21487;&#20197;&#32467;&#26463;&#8212;&#8212;&#23427;&#26159;&#19981;&#26159;&#27604;&#24182;&#21457;&#35831;&#27714;&#36229;&#26102;&#20540;&#35201;&#30701;&#65311;
	  &#22914;&#26524;&#19981;&#26159;&#65292;&#20320;&#20063;&#35768;&#35201;&#20462;&#25913;&#36825;&#20010;&#26041;&#27861;&#30340;&#24182;&#21457;&#35831;&#27714;&#36229;&#26102;&#26102;&#38388;&#65288;&#22914;&#19978;&#25152;&#36848;&#65289;&#12290;
	  &#25509;&#19979;&#26469;&#20320;&#25110;&#35768;&#38656;&#35201;&#22312;&#23458;&#25143;&#31471;&#32473;&#35831;&#27714;&#25490;&#19968;&#20010;&#38431;&#65292;&#38450;&#27490;&#35831;&#27714;&#20840;&#37096;&#28044;&#20837;&#26381;&#21153;&#22120;&#12290;
	  &#22914;&#26524;&#36825;&#26159;&#19968;&#20010;&#32463;&#24120;&#21457;&#29983;&#30340;&#20107;&#20214;&#65288;&#20363;&#22914;&#65292;&#25353;&#38062;&#25353;&#19979;&#21644;&#36755;&#20837;&#22495;&#30340;onblur&#65289;&#65292;&#24182;&#19988;&#31435;&#21363;&#26356;&#26032;&#23458;&#25143;&#31471;&#21448;&#19981;&#26159;&#20248;&#20808;&#38656;&#35201;&#32771;&#34385;&#30340;&#24773;&#20917;&#65292;&#20320;&#23601;&#24212;&#35813;&#22312;&#23458;&#25143;&#31471;&#35774;&#32622;&#19968;&#20010;&#35831;&#27714;&#24310;&#26102;&#12290;
	  &#24403;&#28040;&#32791;&#23436;&#20320;&#30340;&#35831;&#27714;&#24310;&#26102;&#30340;&#26102;&#20505;&#65292;&#35813;&#20107;&#20214;&#20013;&#30340;&#25805;&#20316;&#20063;&#20250;&#22312;&#26381;&#21153;&#22120;&#27573;&#25490;&#25104;&#19968;&#20010;&#38431;&#21015;&#12290;
    </p><p>
	  &#26368;&#21518;&#65292;&#23458;&#25143;&#31471;&#24211;&#21487;&#33021;&#20250;&#25552;&#20379;&#19968;&#20010;&#36873;&#39033;&#65292;&#23427;&#21487;&#20197;&#25918;&#24323;&#26368;&#36817;&#26410;&#23436;&#25104;&#30340;&#37325;&#22797;&#35831;&#27714;&#12290;
	  &#23545;&#36825;&#20010;&#36873;&#39033;&#20320;&#38656;&#35201;&#24456;&#35880;&#24910;&#65292;&#22240;&#20026;&#22312;&#26381;&#21153;&#31471;&#27809;&#33021;&#25918;&#24323;&#26410;&#23436;&#25104;&#30340;&#35831;&#27714;&#26102;&#65292;&#36825;&#20010;&#36873;&#39033;&#21487;&#33021;&#23548;&#33268;&#35831;&#27714;&#20840;&#37096;&#28044;&#20837;&#26381;&#21153;&#22120;&#31471;&#12290;
    </p><p>
	  &#20351;&#29992;&#8220;Poll&#39118;&#26684;&#8221;&#30340;&#35774;&#35745;&#27604;&#36739;&#19981;&#38656;&#35201;&#32454;&#35843;&#12290;
	  &#20320;&#21482;&#35201;&#32473;&#20320;&#30340;action&#26041;&#27861; <tt class="literal">@Asynchronous</tt> &#36827;&#34892;&#26631;&#27880;&#65292;&#24182;&#30830;&#23450;&#19968;&#20010;&#26597;&#35810;&#26102;&#38388;&#38388;&#38548;&#23601;&#21487;&#20197;&#20102;&#65306;
    </p><pre class="programlisting">int total;

// This method is called when an event occurs on the client
// It takes a really long time to execute
@Asynchronous
public void calculateTotal() {
   total = someReallyComplicatedCalculation();
}

// This method is called as the result of the poll
// It's very quick to execute
public int getTotal() {
   return total;
}</pre><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e5534"></a>6.9.1.&nbsp;RichFaces Ajax</h3></div></div><div></div></div><p>
		RichFaces AJAX&#26159;&#26368;&#24120;&#19982;Seam&#19968;&#36215;&#20351;&#29992;&#30340;Ajax&#24211;&#65292;&#23427;&#25552;&#20379;&#20102;&#19978;&#38754;&#35752;&#35770;&#36807;&#30340;&#25152;&#26377;&#25511;&#21046;&#65306;
      </p><div class="itemizedlist"><ul type="disc"><li><p>
            <tt class="literal">eventsQueue</tt> &#8212; &#25552;&#20379;&#19968;&#20010;&#25918;&#32622;&#20107;&#20214;&#30340;&#38431;&#21015;&#12290;&#25152;&#26377;&#30340;&#20107;&#20214;&#37117;&#25490;&#25104;&#38431;&#21015;&#65292;&#24182;&#19988;&#35831;&#27714;&#34987;&#20381;&#27425;&#21457;&#36865;&#32473;&#26381;&#21153;&#22120;&#31471;&#12290;
            &#24403;&#26381;&#21153;&#22120;&#27809;&#26377;&#34987;&#25298;&#32477;&#26381;&#21153;&#25915;&#20987;&#26102;&#65292;&#33509;&#19968;&#20010;&#35831;&#27714;&#22312;&#26381;&#21153;&#22120;&#19978;&#38656;&#35201;&#33457;&#36153;&#19968;&#20123;&#26102;&#38388;&#26469;&#25191;&#34892;&#26102;&#65292;&#36825;&#20010;&#26159;&#24456;&#26377;&#29992;&#30340;&#65288;&#27604;&#22914;&#65306;&#22823;&#37327;&#30340;&#35745;&#31639;&#65292;&#20174;&#24930;&#30340;&#25968;&#25454;&#28304;&#37324;&#33719;&#21462;&#20449;&#24687;&#65289;&#12290;
          </p></li><li><p>
            &#22914;&#26524;&#26368;&#36817;&#22312;&#38431;&#21015;&#20013;&#24050;&#32463;&#26377;&#8216;&#30456;&#20284;&#30340;&#8217;&#35831;&#27714;&#65292; <tt class="literal">ignoreDupResponses</tt> &#8212; &#23601;&#20250;&#24573;&#30053;&#30001;&#35813;&#35831;&#27714;&#20135;&#29983;&#30340;&#21709;&#24212;&#12290;
            ignoreDupResponses="true" <span class="emphasis"><em>&#19981;&#20250;&#21462;&#28040;</em></span> &#35831;&#27714;&#22312;&#26381;&#21153;&#31471;&#30340;&#22788;&#29702; &#8212; &#23427;&#21482;&#26159;&#22312;&#23458;&#25143;&#31471;&#38450;&#27490;&#19981;&#24517;&#35201;&#30340;&#26356;&#26032;&#12290;
          </p><p>
			&#36825;&#20010;&#36873;&#39033;&#19982;Seam&#23545;&#35805;&#19968;&#36215;&#20351;&#29992;&#26102;&#24212;&#35813;&#24456;&#23567;&#24515;&#65292;&#22240;&#20026;&#23427;&#20801;&#35768;&#21019;&#24314;&#22810;&#20010;&#24182;&#21457;&#35831;&#27714;&#12290;
          </p></li><li><p>
			<tt class="literal">requestDelay</tt> &#8212; &#23450;&#20041;&#35831;&#27714;&#23384;&#22312;&#20110;&#38431;&#21015;&#20013;&#30340;&#26102;&#38388;&#65288;ms&#65289;&#12290;
            &#22914;&#26524;&#36825;&#20010;&#35831;&#27714;&#22312;&#36825;&#20010;&#26102;&#38388;&#20869;&#27809;&#26377;&#34987;&#22788;&#29702;&#65292;&#23427;&#23601;&#20250;&#34987;&#21457;&#36865;&#65288;&#19981;&#31649;&#26159;&#21542;&#25509;&#25910;&#21040;response&#65289;&#25110;&#32773;&#20002;&#24323;&#65288;&#22914;&#26524;&#38431;&#21015;&#20013;&#26377;&#26356;&#36817;&#30340;&#30456;&#20284;&#20107;&#20214;&#65289;&#12290;
          </p><p>
			&#36825;&#20010;&#36873;&#39033;&#19982;Seam&#30340;&#23545;&#35805;&#19968;&#36215;&#20351;&#29992;&#24212;&#35813;&#24456;&#23567;&#24515;&#65292;&#22240;&#20026;&#23427;&#20801;&#35768;&#21019;&#24314;&#22810;&#20010;&#24182;&#21457;&#35831;&#27714;&#12290;
			&#20320;&#35201;&#30830;&#23450;&#20320;&#25152;&#35774;&#32622;&#30340;&#24310;&#26102;&#26102;&#38388;&#65288;&#32467;&#21512;&#24182;&#21457;&#35831;&#27714;&#36229;&#26102;&#30340;&#26102;&#38388;&#65289;&#35201;&#38271;&#20110;action&#30340;&#25191;&#34892;&#26102;&#38388;&#12290;
          </p></li><li><p>
            <tt class="literal">&lt;a:poll reRender="total" interval="1000" /&gt;</tt> &#8212; &#35831;&#27714;&#26381;&#21153;&#22120;&#31471;&#65292;&#24182;&#37325;&#26032;&#28210;&#26579;&#19968;&#20010;&#38656;&#35201;&#30340;&#21306;&#22495;&#12290;
          </p></li></ul></div></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="events.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="jbpm.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;5.&nbsp;&#20107;&#20214;&#12289;&#25318;&#25130;&#22120;&#21644;&#24322;&#24120;&#22788;&#29702;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;7.&nbsp;&#39029;&#38754;&#27969;&#21644;&#19994;&#21153;&#27969;&#31243;</td></tr></table></div></body></html>