<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>JBoss Seam&#31616;&#20171;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="up" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="previous" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="next" href="tutorial.html" title="Chapter&nbsp;1.&nbsp;Seam &#20837;&#38376;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">JBoss Seam&#31616;&#20171;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="tutorial.html">Next</a></td></tr></table><hr></div><div class="preface" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="d0e10"></a>JBoss Seam&#31616;&#20171;</h2></div></div><div></div></div><p>
            Seam&#26159;&#19968;&#31181;&#20225;&#19994;&#32423;Java&#30340;&#24212;&#29992;&#31243;&#24207;&#26694;&#26550;&#12290;&#23427;&#30340;&#28789;&#24863;&#28304;&#33258;&#19979;&#21015;&#21407;&#21017;&#65306;
        </p><div class="variablelist"><dl><dt><span class="term"><span class="emphasis"><em>&#21482;&#26377;&#19968;&#31181;&#8220;&#24037;&#20855;&#8221;</em></span></span></dt><dd><p>
                        Seam&#20026;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#25152;&#26377;&#30340;&#19994;&#21153;&#36923;&#36753;&#23450;&#20041;&#20102;&#19968;&#31181;&#32479;&#19968;&#30340;&#32452;&#20214;&#27169;&#22411;&#12290;
						Seam&#32452;&#20214;&#21487;&#33021;&#26159;&#26377;&#29366;&#24577;&#30340;&#65292;&#21253;&#21547;&#19982;&#20960;&#20010;&#23450;&#20041;&#33391;&#22909;&#30340;&#19978;&#19979;&#25991;&#20013;&#20219;&#20309;&#19968;&#20010;&#30456;&#20851;&#32852;&#30340;&#29366;&#24577;&#65292;
						&#21253;&#25324;&#38271;&#26102;&#38388;&#36816;&#34892;&#19978;&#19979;&#25991;&#12289;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#12289;<span class="emphasis"><em>&#19994;&#21153;&#27969;&#31243;&#19978;&#19979;&#25991;</em></span>&#65292;
                        &#20197;&#21450;&#29992;&#25143;&#20132;&#20114;&#20013;&#33021;&#22815;&#36328;&#22810;&#20010;Web&#35831;&#27714;&#20445;&#23384;&#30340;<span class="emphasis"><em>&#23545;&#35805;&#19978;&#19979;&#25991;</em></span>&#12290;
                    </p><p>
                        Seam&#20013;&#30340;&#34920;&#29616;&#23618;&#32452;&#20214;&#21644;&#19994;&#21153;&#36923;&#36753;&#32452;&#20214;&#20043;&#38388;&#24182;&#27809;&#26377;&#21306;&#21035;&#12290;
						&#20320;&#21487;&#20197;&#26681;&#25454;&#20320;&#35774;&#35745;&#30340;&#20219;&#20309;&#26550;&#26500;&#32473;&#24212;&#29992;&#31243;&#24207;&#36827;&#34892;&#20998;&#23618;&#65292;&#32780;&#19981;&#26159;&#24378;&#21046;&#23558;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#36923;&#36753;&#30828;&#22622;&#36827;&#19968;&#20010;&#30001;&#20320;&#30446;&#21069;&#22312;&#20351;&#29992;&#30340;&#20219;&#20309;&#26694;&#26550;&#32452;&#21512;&#25152;&#24378;&#21152;&#32473;&#20320;&#30340;&#19981;&#36866;&#24403;&#30340;&#20998;&#23618;&#37197;&#32622;&#20013;&#12290;
                    </p><p>
                        &#19982;&#31616;&#21333;&#30340;Java EE&#25110;&#32773;J2EE&#32452;&#20214;&#19981;&#21516;&#65292;Seam&#32452;&#20214;&#21487;&#20197;<span class="emphasis"><em>&#21516;&#26102;</em></span>&#35775;&#38382;&#19982;Web&#35831;&#27714;&#30456;&#20851;&#30340;&#29366;&#24577;&#65292;&#20197;&#21450;&#20445;&#23384;&#22312;&#20107;&#21153;&#36164;&#28304;&#20013;&#30340;&#29366;&#24577;&#65288;&#32780;&#19981;&#24517;&#36890;&#36807;&#26041;&#27861;&#21442;&#25968;&#25163;&#24037;&#20256;&#25773;Web&#35831;&#27714;&#29366;&#24577;&#65289;&#12290;
						&#20320;&#21487;&#33021;&#21453;&#23545;&#35828;&#30001;&#26087;&#24335;&#30340;J2EE&#24179;&#21488;&#24378;&#21152;&#32473;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#20998;&#23618;&#26159;&#20214;&#22909;&#19996;&#35199;&#65292;&#27809;&#26377;&#20160;&#20040;&#21487;&#20197;&#38459;&#27490;&#20320;&#21033;&#29992;Seam&#21019;&#24314;&#19968;&#20010;&#30456;&#24403;&#30340;&#20998;&#23618;&#26550;&#26500;&#8212;
						&#21306;&#21035;&#22312;&#20110;&#65292;<span class="emphasis"><em>&#20320;</em></span>&#35201;&#33258;&#24049;&#26550;&#26500;&#24212;&#29992;&#31243;&#24207;&#65292;&#24182;&#20915;&#23450;&#26377;&#21738;&#20123;&#23618;&#65292;&#20197;&#21450;&#23427;&#20204;&#26159;&#22914;&#20309;&#21512;&#20316;&#30340;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#23558;JSF&#19982;EJB 3.0&#25972;&#21512;</em></span></span></dt><dd><p>
                    	JSF&#21644;EJB 3.0&#26159;Java EE5&#30340;&#20004;&#20010;&#26368;&#22909;&#30340;&#26032;&#29305;&#24615;&#12290;EJB3&#26159;&#26381;&#21153;&#22120;&#31471;&#19994;&#21153;&#21644;&#25345;&#20037;&#36923;&#36753;&#30340;&#20840;&#26032;&#32452;&#20214;&#27169;&#22411;&#12290;
                    	&#21516;&#26102;&#65292;JSF&#20063;&#26159;&#34920;&#29616;&#23618;&#30340;&#19968;&#20010;&#20248;&#31168;&#32452;&#20214;&#27169;&#22411;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;&#36825;&#20108;&#32773;&#37117;&#26080;&#27861;&#29420;&#33258;&#35299;&#20915;&#25152;&#26377;&#30340;&#35745;&#31639;&#38382;&#39064;&#12290;
						&#23454;&#38469;&#19978;&#65292;JSF&#21644;EJB3&#32467;&#21512;&#20351;&#29992;&#21518;&#36816;&#20316;&#24471;&#26368;&#22909;&#12290;
						&#20294;&#26159;Java EE5&#35268;&#33539;&#24182;&#27809;&#26377;&#25552;&#20379;&#22914;&#20309;&#25972;&#21512;&#36825;&#20004;&#20010;&#32452;&#20214;&#27169;&#22411;&#30340;&#26631;&#20934;&#26041;&#27861;&#12290;
						&#25152;&#24184;&#65292;&#36825;&#20004;&#31181;&#27169;&#22411;&#30340;&#21019;&#24314;&#32773;&#37117;&#21069;&#30651;&#21040;&#20102;&#36825;&#31181;&#29366;&#20917;&#65292;&#24182;&#19988;&#25552;&#20379;&#20102;&#26631;&#20934;&#30340;&#25193;&#23637;&#28857;&#65292;&#20801;&#35768;&#23545;&#21508;&#33258;&#36827;&#34892;&#25193;&#23637;&#65292;&#25110;&#32773;&#19982;&#20854;&#20182;&#35299;&#20915;&#26041;&#26696;&#38598;&#25104;&#12290;
                    </p><p>
                        Seam&#23558;JSF&#21644;EJB3&#30340;&#32452;&#20214;&#27169;&#22411;&#21512;&#20108;&#20026;&#19968;&#65292;&#28040;&#38500;&#20102;&#33014;&#21512;&#20195;&#30721;&#65292;&#20351;&#24471;&#24320;&#21457;&#32773;&#19987;&#27880;&#20110;&#19994;&#21153;&#38382;&#39064;&#12290;
                    </p><p>
						&#32534;&#20889;&#8220;&#19968;&#20999;&#8221;&#37117;&#26159;EJB&#30340;Seam&#24212;&#29992;&#31243;&#24207;&#26159;&#26377;&#21487;&#33021;&#30340;&#12290;&#22914;&#26524;&#20320;&#20064;&#24815;&#25226;EJB&#24403;&#20316;&#26159;&#32454;&#31890;&#24230;&#30340;&#25152;&#35859;&#8220;&#37325;&#37327;&#21270;&#8221;&#30340;&#23545;&#35937;&#65292;&#36825;&#21487;&#33021;&#20250;&#20196;&#20320;&#24456;&#21507;&#24778;&#12290;
						&#28982;&#32780;&#65292;&#20174;&#24320;&#21457;&#20154;&#21592;&#30340;&#35282;&#24230;&#26469;&#30475;&#65292;3.0&#29256;&#26412;&#24050;&#32463;&#23436;&#20840;&#25913;&#21464;&#20102;EJB&#30340;&#26412;&#36136;&#12290;
						EJB&#26159;&#19968;&#20010;&#32454;&#31890;&#24230;&#30340;&#23545;&#35937;&#8212;&#27809;&#26377;&#20160;&#20040;&#19996;&#35199;&#20250;&#27604;&#27880;&#35299;&#30340;JavaBean&#26356;&#22797;&#26434;&#20102;&#12290;Seam&#29978;&#33267;&#40723;&#21169;&#20320;&#20351;&#29992;&#20250;&#35805;Bean&#20316;&#20026;JSF&#21160;&#20316;&#30417;&#21548;&#32773;&#65281;
                    </p><p>
                        &#21478;&#19968;&#26041;&#38754;&#65292;&#22914;&#26524;&#20320;&#23425;&#21487;&#19981;&#22312;&#36825;&#20010;&#26102;&#20505;&#37319;&#29992;EJB 3.0&#65292;&#19981;&#29992;&#21193;&#24378;&#12290;
						&#20107;&#23454;&#19978;&#65292;&#20219;&#20309;Java&#31867;&#37117;&#21487;&#20197;&#26159;&#19968;&#20010;Seam&#32452;&#20214;&#65292;&#24182;&#19988;Seam&#25552;&#20379;&#20102;&#20320;&#26399;&#24453;&#20174;&#8220;&#36731;&#37327;&#21270;&#8221;&#30340;&#23481;&#22120;&#65292;&#29978;&#33267;&#20219;&#20309;&#32452;&#20214;&#12289;EJB&#25110;&#32773;&#20854;&#20182;&#19996;&#35199;&#20013;&#33719;&#24471;&#30340;&#25152;&#26377;&#21151;&#33021;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#38598;&#25104;AJAX</em></span></span></dt><dd><p>
                        Seam&#25903;&#25345;&#20004;&#20010;&#26368;&#22909;&#30340;&#12289;&#24320;&#28304;&#30340;&#22522;&#20110;JSF&#30340;AJAX&#35299;&#20915;&#26041;&#26696;&#65306;JBoss RichFaces&#21644;ICEfaces&#12290;
						&#36825;&#20004;&#20010;&#35299;&#20915;&#26041;&#26696;&#35753;&#20320;&#26080;&#38656;&#32534;&#20889;&#20219;&#20309;JavaSctipt&#20195;&#30721;&#23601;&#21487;&#20197;&#20026;&#20320;&#30340;&#30028;&#38754;&#28155;&#21152;AJAX&#21151;&#33021;&#12290;
                    </p><p>
                        Seam&#20063;&#25552;&#20379;&#20102;&#20869;&#32622;&#30340;JavaSctipt&#36828;&#31243;&#35775;&#38382;&#23618;&#65292;&#23427;&#35753;&#20320;&#24322;&#27493;&#22320;&#20174;&#23458;&#25143;&#31471;JavaScript&#20013;&#35843;&#29992;&#32452;&#20214;&#65292;&#32780;&#19981;&#38656;&#35201;&#20013;&#38388;&#30340;action&#23618;&#12290;
						&#20320;&#36824;&#21487;&#20197;&#35746;&#38405;&#26381;&#21153;&#22120;&#31471;&#30340;JMS&#20027;&#39064;&#65292;&#24182;&#36890;&#36807;AJAX&#30340;push&#26041;&#27861;&#25509;&#25910;&#20449;&#24687;&#12290;
                    </p><p>
                        &#20551;&#33509;&#19981;&#26159;&#26377;Seam&#20869;&#32622;&#30340;&#24182;&#21457;&#21644;&#29366;&#24577;&#31649;&#29702;&#33021;&#21147;&#65292;&#20197;&#19978;&#36825;&#20123;&#26041;&#27861;&#23558;&#37117;&#26080;&#27861;&#24456;&#22909;&#22320;&#36816;&#20316;&#12290;
						&#36825;&#20004;&#31181;&#26041;&#27861;&#30830;&#20445;&#26381;&#21153;&#22120;&#31471;&#33021;&#22815;&#23433;&#20840;&#32780;&#39640;&#25928;&#22320;&#22788;&#29702;&#22810;&#20010;&#24182;&#21457;&#32454;&#31890;&#24230;&#30340;&#24322;&#27493;AJAX&#35831;&#27714;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#23558;&#19994;&#21153;&#27969;&#31243;&#20316;&#20026;&#39318;&#35201;&#30340;&#22522;&#30784;&#24314;&#31569;</em></span></span></dt><dd><p>
                        Seam&#21487;&#20197;&#36873;&#25321;&#36890;&#36807;jBPM&#25552;&#20379;&#36879;&#26126;&#30340;&#19994;&#21153;&#27969;&#31243;&#31649;&#29702;&#12290;&#20351;&#29992;jBPM&#21644;Seam&#20849;&#21516;&#23454;&#29616;&#22797;&#26434;&#30340;&#24037;&#20316;&#27969;&#12289;&#21512;&#20316;&#21644;&#20219;&#21153;&#31649;&#29702;&#65292;&#31616;&#21333;&#21040;&#20102;&#35753;&#20154;&#38590;&#20197;&#32622;&#20449;&#30340;&#31243;&#24230;&#12290;
                    </p><p>
                        Seam&#29978;&#33267;&#20801;&#35768;&#20320;&#21033;&#29992;&#19982;jBPM&#32473;&#19994;&#21153;&#27969;&#31243;&#23450;&#20041;&#25152;&#20351;&#29992;&#30340;&#30456;&#21516;&#35821;&#35328;&#65288;jPDL)&#26469;&#23450;&#20041;&#34920;&#29616;&#23618;&#39029;&#38754;&#27969;&#12290;
                    </p><p>
                        JSF&#20026;&#34920;&#31034;&#23618;&#25552;&#20379;&#20102;&#38750;&#24120;&#20016;&#23500;&#30340;&#20107;&#20214;&#27169;&#22411;&#12290;
						&#36890;&#36807;&#20197;&#23436;&#20840;&#30456;&#21516;&#30340;&#20107;&#20214;&#22788;&#29702;&#26426;&#21046;&#26292;&#38706;&#19982;jBPM&#19994;&#21153;&#27969;&#31243;&#30456;&#20851;&#30340;&#20107;&#20214;&#65292;Seam&#24378;&#21270;&#20102;&#36825;&#19968;&#27169;&#22411;&#65292;&#36825;&#23601;&#20026;Seam&#30340;&#32479;&#19968;&#32452;&#20214;&#27169;&#22411;&#25552;&#20379;&#20102;&#32479;&#19968;&#30340;&#20107;&#20214;&#27169;&#22411;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#22768;&#26126;&#24335;&#29366;&#24577;&#31649;&#29702;</em></span></span></dt><dd><p>
                        &#20174;EJB&#26089;&#26399;&#24320;&#22987;&#65292;&#25105;&#20204;&#24050;&#32463;&#20064;&#24815;&#20110;&#22768;&#26126;&#24335;&#20107;&#21153;&#31649;&#29702;&#21644;J2EE&#22768;&#26126;&#24335;&#23433;&#20840;&#30340;&#27010;&#24565;&#12290;EJB 3.0&#36824;&#24341;&#20837;&#20102;&#22768;&#26126;&#24335;&#25345;&#20037;&#19978;&#19979;&#25991;&#31649;&#29702;&#12290;
                        &#19968;&#20010;&#26356;&#24191;&#27867;&#30340;&#31649;&#29702;&#29366;&#24577;&#38382;&#39064;--&#31649;&#29702;&#19982;&#26576;&#20010;&#29305;&#27530;<span class="emphasis"><em>context</em></span>&#20851;&#32852;&#30340;&#29366;&#24577;&#65292;&#26377;&#19977;&#20010;&#29305;&#20363;&#65292;&#23427;&#30830;&#20445;&#36825;&#20010;&#19978;&#19979;&#25991;&#32467;&#26463;&#26102;&#36827;&#34892;&#25152;&#26377;&#24517;&#35201;&#30340;&#28165;&#29702;&#12290;
						Seam&#25226;&#22768;&#26126;&#24335;&#29366;&#24577;&#31649;&#29702;&#30340;&#27010;&#24565;&#25512;&#36827;&#30340;&#36828;&#24471;&#22810;&#65292;&#24182;&#25226;&#23427;&#24212;&#29992;&#20110;<span class="emphasis"><em>&#24212;&#29992;&#31243;&#24207;&#29366;&#24577;&#65288;application state&#65289;</em></span>&#12290;
						J2EE&#24212;&#29992;&#31243;&#24207;&#19968;&#33324;&#36890;&#36807;&#25163;&#24037;&#23454;&#29616;&#29366;&#24577;&#31649;&#29702;&#65292;&#36890;&#36807;&#33719;&#21462;&#21644;&#35774;&#32622;Servlet Session&#21644;Request&#23646;&#24615;&#12290;
                        &#20551;&#33509;&#31243;&#24207;&#27809;&#33021;&#28165;&#38500;Session&#23646;&#24615;&#65292;&#25110;&#32773;&#22312;&#22810;&#31383;&#21475;&#30340;&#24212;&#29992;&#31243;&#24207;&#20013;&#65292;&#19982;&#19981;&#21516;&#30340;&#24037;&#20316;&#27969;&#20851;&#32852;&#30340;Session&#25968;&#25454;&#21457;&#29983;&#20914;&#31361;&#65292;&#36825;&#31181;&#29366;&#24577;&#31649;&#29702;&#30340;&#26041;&#27861;&#23601;&#20250;&#25104;&#20026;&#24456;&#22810;Bug&#21644;&#20869;&#23384;&#27844;&#28431;&#30340;&#26681;&#28304;&#12290;
						Seam&#26377;&#21487;&#33021;&#20960;&#20046;&#23436;&#20840;&#28040;&#38500;&#36825;&#31867;Bug&#12290;
                    </p><p>
                        &#22768;&#26126;&#24335;&#24212;&#29992;&#31243;&#24207;&#29366;&#24577;&#31649;&#29702;&#36890;&#36807;Seam&#23450;&#20041;&#30340;&#20016;&#23500;&#30340;<span class="emphasis"><em>context model&#65288;&#19978;&#19979;&#25991;&#27169;&#22411;&#65289;</em></span>&#32780;&#25104;&#20026;&#21487;&#33021;&#12290;
                        Seam&#25193;&#23637;&#20102;Servlet&#35268;&#33539;&#8212;&#23450;&#20041;&#30340;&#19978;&#19979;&#25991;&#27169;&#22411;&#8212;&#8212;&#35831;&#27714;&#12289;&#20250;&#35805;&#12289;&#24212;&#29992;&#31243;&#24207;&#8212;&#22686;&#21152;&#20102;&#20004;&#20010;&#26032;&#30340;&#19978;&#19979;&#25991;&#8212;
						&#23545;&#35805;&#21644;&#19994;&#21153;&#27969;&#31243;&#8212;&#65292;&#20174;&#19994;&#21153;&#36923;&#36753;&#30340;&#35282;&#24230;&#26469;&#30475;&#23427;&#20204;&#26356;&#20855;&#24847;&#20041;&#12290;
                    </p><p>
                        &#19968;&#26086;&#20320;&#24320;&#22987;&#20351;&#29992;&#23545;&#35805;&#65292;&#23558;&#20250;&#24778;&#35766;&#20110;&#35768;&#22810;&#20107;&#24773;&#21464;&#24471;&#26356;&#21152;&#23481;&#26131;&#20102;&#12290;&#20320;&#26366;&#32463;&#22312;&#20687;Hibernate&#25110;&#32773;JPA&#36825;&#26679;&#30340;ORM&#35299;&#20915;&#26041;&#26696;&#20013;&#30171;&#33510;&#22320;&#22788;&#29702;&#36807;&#24310;&#36831;&#30340;&#20851;&#32852;&#25235;&#21462;&#21527;&#65311;
						Seam&#23545;&#35805;&#33539;&#22260;&#30340;&#25345;&#20037;&#21270;&#19978;&#19979;&#25991;&#24847;&#21619;&#30528;&#20320;&#23558;&#20960;&#20046;&#30475;&#19981;&#21040; <tt class="literal">LazyInitializationException</tt>&#12290;
						&#20320;&#26366;&#32463;&#36935;&#21040;&#36807;&#21047;&#26032;&#65288;Refresh&#65289;&#25353;&#38062;&#25110;&#32773;&#21518;&#36864;&#65288;Back&#65289;&#25353;&#38062;&#30340;&#38382;&#39064;&#21527;&#65311;&#25110;&#32773;&#26377;&#36807;&#37325;&#22797;&#25552;&#20132;&#34920;&#21333;&#30340;&#38382;&#39064;&#21527;&#65311;
						&#26377;&#36890;&#36807;post-then-redirect&#20256;&#25773;&#20449;&#24687;&#30340;&#38382;&#39064;&#21527;&#65311;Seam&#30340;&#23545;&#35805;&#31649;&#29702;&#35299;&#20915;&#20102;&#36825;&#20123;&#38382;&#39064;&#65292;&#29978;&#33267;&#26080;&#38656;&#20320;&#30495;&#27491;&#21435;&#20851;&#27880;&#23427;&#20204;&#12290;
						&#23427;&#20204;&#37117;&#26159;&#33258;Web&#26368;&#26089;&#26399;&#20197;&#26469;&#26222;&#36941;&#30340;&#19981;&#33391;&#29366;&#24577;&#31649;&#29702;&#26550;&#26500;&#30340;&#24449;&#20806;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>Bijection&#65288;&#21452;&#21521;&#27880;&#20837;&#65289;</em></span></span></dt><dd><p>
                        <span class="emphasis"><em>Inversion of Control&#65288;&#25511;&#21046;&#21453;&#36716;&#65289;</em></span> &#25110;&#32773; <span class="emphasis"><em>dependency injection&#65288;&#20381;&#36182;&#27880;&#20837;&#65289;</em></span> &#30340;&#27010;&#24565;&#20986;&#29616;&#22312;JSF&#21644;EJB3&#20197;&#21450;&#24456;&#22810;&#25152;&#35859;&#30340;&#8220;&#36731;&#22411;&#23481;&#22120;&#8221;&#20013;&#12290;
						&#36825;&#31867;&#23481;&#22120;&#22823;&#22810;&#27880;&#37325;&#20110;&#23454;&#29616; <span class="emphasis"><em>stateless services&#65288;&#26080;&#29366;&#24577;&#26381;&#21153;&#65289;</em></span> &#30340;&#32452;&#20214;&#27880;&#23556;&#12290;
						&#21363;&#20415;&#22312;&#25903;&#25345;&#23545;&#26377;&#29366;&#24577;&#30340;&#32452;&#20214;&#36827;&#34892;&#27880;&#23556;&#30340;&#24773;&#20917;&#19979;&#65288;&#20363;&#22914;JSF&#65289;&#65292;&#20107;&#23454;&#19978;&#20063;&#38590;&#20197;&#29992;&#20110;&#22788;&#29702;&#24212;&#29992;&#31243;&#24207;&#29366;&#24577;&#65292;
                        &#22240;&#20026;&#26377;&#29366;&#24577;&#32452;&#20214;&#30340;&#33539;&#22260;&#38590;&#20197;&#26377;&#25928;&#32780;&#28789;&#27963;&#22320;&#23450;&#20041;&#65292;&#24182;&#19988;&#23646;&#20110;&#26356;&#24191;&#33539;&#22260;&#30340;&#32452;&#20214;&#19981;&#33021;&#34987;&#27880;&#20837;&#21040;&#23646;&#20110;&#26356;&#31364;&#33539;&#22260;&#30340;&#32452;&#20214;&#20013;&#12290;
                    </p><p>
                        <span class="emphasis"><em>Bijection&#65288;&#21452;&#21521;&#27880;&#20837;&#65289;</em></span>&#21644;IoC&#30340;&#19981;&#21516;&#20043;&#22788;&#22312;&#20110;&#23427;&#26159;<span class="emphasis"><em>&#21160;&#24577;</em></span>&#30340;&#12289;<span class="emphasis"><em>&#35821;&#22659;&#30456;&#20851;</em></span>&#30340;&#20197;&#21450;<span class="emphasis"><em>&#21452;&#21521;</em></span>&#30340;&#12290;
                        &#20320;&#21487;&#20197;&#25226;&#36825;&#19968;&#26426;&#21046;&#29702;&#35299;&#25104;&#23558;&#35821;&#22659;&#30456;&#20851;&#30340;&#21464;&#37327;&#65288;&#19982;&#24403;&#21069;&#32447;&#31243;&#32465;&#23450;&#30340;&#21508;&#31181;&#19978;&#19979;&#25991;&#20013;&#30340;&#21517;&#31216;&#65289;&#23545;&#24212;&#21040;&#32452;&#20214;&#30340;&#23646;&#24615;&#20013;&#12290;
                        &#21452;&#21521;&#27880;&#20837;&#20801;&#35768;&#30001;&#23481;&#22120;&#23545;&#26377;&#29366;&#24577;&#30340;&#32452;&#20214;&#36827;&#34892;&#33258;&#21160;&#32452;&#35013;&#12290;&#23427;&#29978;&#33267;&#20801;&#35768;&#32452;&#20214;&#21487;&#20197;&#23433;&#20840;&#32780;&#31616;&#21333;&#22320;&#22788;&#29702;&#19978;&#19979;&#25991;&#21464;&#37327;&#30340;&#20540;&#65292;&#21482;&#38656;&#35201;&#25226;&#23427;&#36171;&#32473;&#32452;&#20214;&#30340;&#23646;&#24615;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#24037;&#20316;&#21306;&#31649;&#29702;&#65288;Workspace Management&#65289;&#21644;&#22810;&#31383;&#21475;&#27983;&#35272;</em></span></span></dt><dd><p>
                        Seam&#24212;&#29992;&#31243;&#24207;&#35753;&#29992;&#25143;&#33258;&#30001;&#22320;&#22312;&#22810;&#20010;&#27983;&#35272;&#22120;&#31383;&#21475;&#20013;&#20999;&#25442;&#65292;&#27599;&#20010;&#31383;&#21475;&#37117;&#19982;&#19968;&#20010;&#19981;&#21516;&#30340;&#12289;&#23433;&#20840;&#38548;&#31163;&#30340;&#23545;&#35805;&#20851;&#32852;&#12290;
						&#24212;&#29992;&#31243;&#24207;&#29978;&#33267;&#21487;&#20197;&#21033;&#29992; <span class="emphasis"><em>workspace management</em></span>&#65292;&#20801;&#35768;&#29992;&#25143;&#22312;&#19968;&#20010;&#27983;&#35272;&#22120;&#31383;&#21475;&#30340;&#22810;&#20010;&#23545;&#35805;&#65288;&#24037;&#20316;&#21306;&#65289;&#20043;&#38388;&#36827;&#34892;&#20999;&#25442;&#12290;
						Seam&#19981;&#20165;&#25552;&#20379;&#27491;&#30830;&#30340;&#22810;&#31383;&#21475;&#25805;&#20316;&#65292;&#36824;&#25552;&#20379;&#22312;&#19968;&#20010;&#31383;&#21475;&#20013;&#27169;&#25311;&#22810;&#20010;&#31383;&#21475;&#30340;&#25805;&#20316;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#26356;&#21916;&#27426;XML&#27880;&#35299;</em></span></span></dt><dd><p>
                        &#20256;&#32479;&#19978;&#65292;&#20851;&#20110;&#21040;&#24213;&#21738;&#20123;&#20803;&#20449;&#24687;&#21487;&#20197;&#31639;&#20316;&#37197;&#32622;&#65292;Java&#31038;&#21306;&#19968;&#30452;&#22788;&#20110;&#19968;&#31181;&#26497;&#20026;&#28151;&#20081;&#30340;&#29366;&#24577;&#12290;
						J2EE&#21644;&#27969;&#34892;&#30340;&#8220;&#36731;&#22411;&#8221;&#23481;&#22120;&#20026;&#30495;&#27491;&#21487;&#20197;&#22312;&#19981;&#21516;&#30340;&#31995;&#32479;&#37096;&#32626;&#20043;&#38388;&#37197;&#32622;&#30340;&#19996;&#35199;&#65292;&#20197;&#21450;&#20219;&#20309;&#19981;&#23481;&#26131;&#29992;Java&#34920;&#36798;&#30340;&#20854;&#20182;&#22768;&#26126;&#37117;&#25552;&#20379;&#20102;&#22522;&#20110;XML&#30340;&#37096;&#32626;&#25551;&#36848;&#31526;&#12290;
						Java 5 &#27880;&#35299;&#25913;&#21464;&#20102;&#25152;&#26377;&#36825;&#19968;&#20999;&#12290;
                    </p><p>
                        EJB3.0 &#25509;&#21463;&#27880;&#35299;&#21644;&#8220;&#23545;&#20363;&#22806;&#37197;&#32622;&#8221;&#65292;&#36825;&#25104;&#20102;&#20197;&#22768;&#26126;&#30340;&#24418;&#24335;&#20026;&#23481;&#22120;&#25552;&#20379;&#20449;&#24687;&#30340;&#26368;&#31616;&#26131;&#26041;&#27861;&#12290;&#19981;&#24184;&#30340;&#26159;&#65292;JSF&#20173;&#28982;&#22312;&#21313;&#20998;&#20381;&#36182;&#31528;&#37325;&#30340;XML&#37197;&#32622;&#25991;&#20214;&#12290;
						Seam&#25193;&#23637;&#20102;EJB 3.0 &#25552;&#20379;&#30340;&#27880;&#35299;&#65292;&#20197;&#29992;&#20110;&#22768;&#26126;&#24335;&#29366;&#24577;&#31649;&#29702;&#21644;&#22768;&#26126;&#24335;&#19978;&#19979;&#25991;&#21010;&#20998;&#12290;
						&#36825;&#35753;&#20320;&#25670;&#33073;&#20102;&#23545;&#32321;&#29712;&#30340;JSF managed bean(JSF&#21463;&#31649;bean&#65289;&#30340;&#37197;&#32622;&#65292;&#20943;&#23569;&#20102;&#25152;&#38656;&#30340;XML&#65292;&#21482;&#21097;&#19979;&#37027;&#20123;&#30495;&#27491;&#23646;&#20110;XML&#30340;&#20449;&#24687;&#65288;JSF&#23548;&#33322;&#35268;&#21017;&#65289;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#38598;&#25104;&#27979;&#35797;&#36731;&#32780;&#26131;&#20030;</em></span></span></dt><dd><p>
                        Seam&#32452;&#20214;&#20316;&#20026;POJO&#65292;&#22825;&#29983;&#23601;&#26159;&#21487;&#20197;&#36827;&#34892;&#21333;&#20803;&#27979;&#35797;&#30340;&#12290;&#20294;&#26159;&#23545;&#20110;&#22797;&#26434;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#21482;&#26377;&#21333;&#20803;&#27979;&#35797;&#21017;&#36824;&#19981;&#22815;&#12290;
						&#23545;&#20110;Java Web&#24212;&#29992;&#31243;&#24207;&#26469;&#35828;&#65292;&#38598;&#25104;&#27979;&#35797;&#19968;&#33324;&#26159;&#19968;&#39033;&#31528;&#25305;&#19988;&#22256;&#38590;&#30340;&#20219;&#21153;&#12290;&#22240;&#27492;&#65292;Seam&#20026;Seam&#24212;&#29992;&#31243;&#24207;&#25552;&#20379;&#20102;&#21487;&#27979;&#35797;&#24615;&#20316;&#20026;&#35813;&#26694;&#26550;&#30340;&#19968;&#39033;&#26680;&#24515;&#21151;&#33021;&#12290;
						&#20320;&#21487;&#20197;&#36731;&#26131;&#22320;&#32534;&#20889;&#37325;&#29616;&#19982;&#29992;&#25143;&#23436;&#25972;&#20132;&#20114;&#30340;JUnit&#25110;TestNG&#27979;&#35797;&#65292;&#26469;&#28436;&#20064;&#38500;&#20102;&#35270;&#22270;View&#65288;JSP&#25110;&#32773;Facelets&#39029;&#38754;&#65289;&#20043;&#22806;&#30340;&#25152;&#26377;&#31995;&#32479;&#32452;&#20214;&#12290;
						&#20320;&#21487;&#20197;&#30452;&#25509;&#20174;&#20320;&#30340;IDE&#20013;&#36816;&#34892;&#36825;&#20123;&#27979;&#35797;&#65292;Seam&#20250;&#22312;&#37027;&#37324;&#33258;&#21160;&#22320;&#21033;&#29992;JBoss Embeddable&#37096;&#32626;EJB&#32452;&#20214;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#35268;&#33539;&#20063;&#38750;&#23613;&#21892;&#23613;&#32654;</em></span></span></dt><dd><p>
                        &#25105;&#20204;&#35748;&#20026;&#26368;&#26032;&#30340;Java EE&#35268;&#33539;&#24456;&#19981;&#38169;&#12290;&#20294;&#26159;&#25105;&#20204;&#30693;&#36947;&#23427;&#36824;&#36828;&#19981;&#22815;&#23436;&#32654;&#12290;
                        &#22312;&#35268;&#33539;&#20013;&#26377;&#35768;&#22810;&#28431;&#27934;&#65288;&#20363;&#22914;&#65292;GET&#35831;&#27714;&#30340;JSF&#29983;&#21629;&#21608;&#26399;&#20013;&#30340;&#23616;&#38480;&#24615;&#65289;&#65292;Seam&#20462;&#27491;&#20102;&#36825;&#20123;&#28431;&#27934;&#12290;
                        Seam&#30340;&#21019;&#24314;&#32773;&#20204;&#27491;&#19982;JCP&#19987;&#23478;&#32452;&#19968;&#36947;&#65292;&#30830;&#20445;&#36825;&#20123;&#20462;&#27491;&#24674;&#22797;&#21040;&#26631;&#20934;&#30340;&#19979;&#19968;&#27425;&#20462;&#35746;&#20013;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>Web&#24212;&#29992;&#31243;&#24207;&#19981;&#21482;&#26159;&#26381;&#21153;HTML&#39029;&#38754;</em></span></span></dt><dd><p>
                        &#24403;&#20170;&#30340;Web&#26694;&#26550;&#35748;&#20026;&#22826;&#23567;&#20102;&#12290;&#23427;&#20204;&#35753;&#20320;&#21483;&#29992;&#25143;&#36755;&#20837;&#34920;&#21333;&#65292;&#24182;&#36827;&#20837;&#21040;&#20320;&#30340;Java&#23545;&#35937;&#12290;&#28982;&#21518;&#23427;&#20204;&#23601;&#35753;&#20320;&#24748;&#30528;&#12290;
                        &#30495;&#27491;&#23436;&#25972;&#30340;Web&#24212;&#29992;&#31243;&#24207;&#26694;&#26550;&#24212;&#35813;&#35299;&#20915;&#20687;&#25345;&#20037;&#21270;&#12289;&#24182;&#21457;&#12289;&#24322;&#27493;&#12289;&#29366;&#24577;&#31649;&#29702;&#12289;&#23433;&#20840;&#12289;&#30005;&#23376;&#37038;&#20214;&#12289;&#20449;&#24687;&#12289;PDF&#21644;&#22270;&#34920;&#29983;&#25104;&#12289;&#24037;&#20316;&#27969;&#12289;wikitext&#28210;&#26579;&#12289;Web Services&#12289;&#32531;&#23384;&#31561;&#31561;&#26356;&#22810;&#30340;&#38382;&#39064;&#12290;
                       &#19968;&#26086;&#20320;&#23581;&#21040;&#20102;Seam&#30340;&#29980;&#22836;&#65292;&#23601;&#20250;&#24778;&#35766;&#22320;&#21457;&#29616;&#35768;&#22810;&#38382;&#39064;&#37117;&#21464;&#24471;&#26356;&#21152;&#31616;&#21333;&#20102;......
                    </p><p>
                        Seam&#20026;&#25345;&#20037;&#21270;&#38598;&#25104;&#20102;JPA&#21644;Hibernate 3&#65292;&#20026;&#36731;&#37327;&#21270;&#30340;&#24322;&#27493;&#24615;&#38598;&#25104;&#20102;EJB Timer Service&#21644;Quartz&#65292;&#20026;&#24037;&#20316;&#27969;&#38598;&#25104;&#20102;jBPM&#65292;&#20026;&#19994;&#21153;&#35268;&#21017;&#38598;&#25104;&#20102;JBoss&#35268;&#21017;&#65292;&#20026;&#30005;&#23376;&#37038;&#20214;&#38598;&#25104;&#20102;Meldware Mail&#65292;&#20026;&#23436;&#25972;&#30340;&#25991;&#26412;&#25628;&#32034;&#38598;&#25104;&#20102;Hibernate Search&#21644;Lucene&#65292;&#20026;&#28040;&#24687;&#38598;&#25104;&#20102;JMS&#65292;&#20197;&#21450;&#20026;&#39029;&#38754;&#29255;&#26029;&#25429;&#25417;&#38598;&#25104;&#20102;JBoss Cache&#12290;
                        Seam&#22312;JAAS&#21644;JBoss&#35268;&#21017;&#20043;&#19978;&#65292;&#21019;&#24314;&#20102;&#19968;&#20010;&#26032;&#30340;&#22522;&#20110;&#35268;&#21017;&#30340;&#23433;&#20840;&#26694;&#26550;&#12290;&#29978;&#33267;&#26377;&#29992;&#26469;&#28210;&#26579;PDF&#12289;&#22312;&#32447;&#30005;&#23376;&#37038;&#20214;&#21644;&#22270;&#34920;&#21450;wikitext&#30340;JSF&#26631;&#31614;&#24211;&#12290;
                        Seam&#32452;&#20214;&#21487;&#20197;&#21516;&#26102;&#20316;&#20026;&#19968;&#20010;Web Service&#36827;&#34892;&#35843;&#29992;&#65292;&#24322;&#27493;&#22320;&#20174;&#23458;&#25143;&#31471;JavaScript&#25110;&#32773;Google Web Toolkit&#65292;&#25110;&#32773;&#24403;&#28982;&#20063;&#21487;&#20197;&#30452;&#25509;&#20174;JSF&#35843;&#29992;&#12290;
                    </p></dd><dt><span class="term"><span class="emphasis"><em>&#31435;&#21051;&#24320;&#22987;&#21543;&#65281;</em></span></span></dt><dd><p>
                        Seam&#22312;&#20219;&#20309;Java EE&#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;&#20013;&#37117;&#21487;&#20197;&#36816;&#34892;&#65292;&#29978;&#33267;&#22312;Tomcat&#20013;&#20063;&#21487;&#20197;&#12290;&#22914;&#26524;&#20320;&#30340;&#29615;&#22659;&#25903;&#25345;EJB 3.0&#65292;&#22909;&#26497;&#20102;&#65281;
                        &#22914;&#26524;&#19981;&#25903;&#25345;&#65292;&#20063;&#27809;&#20851;&#31995;&#65292;&#20320;&#21487;&#20197;&#20351;&#29992;Seam&#20026;&#25345;&#20037;&#21270;&#20869;&#32622;&#30340;&#21253;&#21547;JPA&#25110;&#32773;Hibernate3&#30340;&#20107;&#21153;&#31649;&#29702;&#12290;
                        &#25110;&#32773;&#65292;&#20320;&#21487;&#20197;&#22312;Tomcat&#20013;&#37096;&#32626;JBoss Embedded&#65292;&#21516;&#26102;&#20139;&#26377;&#23545;EJB 3.0 &#30340;&#23436;&#25972;&#25903;&#25345;&#12290;
                    </p></dd></dl></div><div class="mediaobject" align="center"><img src="images/architecture.png" align="middle"></div><p>
            &#26368;&#32456;&#20320;&#20250;&#21457;&#29616;&#65292;Seam&#12289;JSF&#21644;EJB3&#30340;&#32452;&#21512;&#23601;&#26159;&#29992;Java&#32534;&#20889;&#22797;&#26434;Web&#24212;&#29992;&#31243;&#24207;&#30340; <span class="emphasis"><em>&#26368;</em></span> &#31616;&#21333;&#21150;&#27861;&#12290;&#20320;&#19981;&#20250;&#30456;&#20449;&#25152;&#38656;&#30340;&#20195;&#30721;&#26159;&#22810;&#20040;&#22320;&#23569;&#65281;
        </p><p>
		 &#26412;&#25991;&#26723;&#32763;&#35793;&#30001;&#20446;&#40654;&#25935;&#20316;&#20026;Leader&#32452;&#32455;&#12290;&#32763;&#35793;&#21450;&#19968;&#23457;&#12289;&#20108;&#23457;&#21517;&#21333;&#35265;&#19979;&#12290;&#29579;&#29747;&#12289;&#39532;&#36234;&#23545;&#20840;&#20070;&#36827;&#34892;&#20102;&#19977;&#23457;&#12290;&#20446;&#40654;&#25935;&#36827;&#34892;&#20102;&#20840;&#20070;&#32479;&#31295;&#21450;&#21457;&#24067;&#30340;build&#24037;&#20316;&#12290;
				</p><div class="table"><a name="d0e188"></a><p class="title"><b>Table&nbsp;1.&nbsp;&#32763;&#35793;&#21450;&#23457;&#26680;&#20154;&#21592;&#21015;&#34920;</b></p><table summary="&#32763;&#35793;&#21450;&#23457;&#26680;&#20154;&#21592;&#21015;&#34920;" width="100%" border="1"><colgroup><col align="center"><col align="center"><col align="center"><col align="center"><col align="center"></colgroup><thead><tr><th align="center">&#31456;&#33410;</th><th align="center">KB</th><th align="center">&#39029;&#25968;</th><th align="center">&#32763;&#35793;</th><th align="center">&#19968;&#23457;</th><th align="center">&#20108;&#23457;</th></tr></thead><tbody><tr><td align="left">master.xml </td><td align="left">17K</td><td align="left">&nbsp;</td><td align="left">CaoXiaogang</td><td align="left">Echo</td><td align="left">YuLimin</td></tr><tr><td align="left">1. tutorial.xml (1.1-1.4)</td><td align="left">130K</td><td align="left">20P</td><td align="left">seanchan</td><td align="left">Jacky</td><td align="left">DigitalSonic</td></tr><tr><td align="left">&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;&#12288;(1.5-1.11) </td><td align="left">&nbsp;</td><td align="left">24P </td><td align="left">DigitalSonic </td><td align="left">Jacky </td><td align="left">ronghao </td></tr><tr><td align="left">2. gettingstarted.xml </td><td align="left">21K </td><td align="left">6P </td><td align="left">seanchan </td><td align="left">zaya </td><td align="left">DigitalSonic </td></tr><tr><td align="left">3. concepts.xml </td><td align="left">56K </td><td align="left">16P </td><td align="left">CaoXiaogang </td><td align="left">kuuyee </td><td align="left">ronghao </td></tr><tr><td align="left">4. xml.xml </td><td align="left">25K </td><td align="left">7P </td><td align="left">downpour </td><td align="left">Echo </td><td align="left">YuLimin </td></tr><tr><td align="left">5. events.xml </td><td align="left">39K </td><td align="left">11P </td><td align="left">mochow </td><td align="left">xihuyu2000 </td><td align="left">Echo </td></tr><tr><td align="left">6. conversations.xml </td><td align="left">34K </td><td align="left">10P </td><td align="left">magice </td><td align="left">Echo </td><td align="left">YuLimin </td></tr><tr><td align="left">7. jbpm.xml </td><td align="left">32K </td><td align="left">10P </td><td align="left">&#24046;&#27801; </td><td align="left">ronghao </td><td align="left">Echo </td></tr><tr><td align="left">8. persistence.xml </td><td align="left">23K </td><td align="left">6P </td><td align="left">pesome </td><td align="left">caoer </td><td align="left">DigitalSonic </td></tr><tr><td align="left">9. validation.xml </td><td align="left">9K </td><td align="left">4P </td><td align="left">pesome </td><td align="left">DigitalSonic </td><td align="left">YuLimin </td></tr><tr><td align="left">10. groovy.xml </td><td align="left">11K </td><td align="left">4P </td><td align="left">kuuyee </td><td align="left">DigitalSonic </td><td align="left">YuLimin </td></tr><tr><td align="left">11. framework.xml </td><td align="left">20K </td><td align="left">7P </td><td align="left">alexchang </td><td align="left">CaoXiaogang </td><td align="left">YuLimin </td></tr><tr><td align="left">12. drools.xml </td><td align="left">7K </td><td align="left">3P </td><td align="left">DigitalSonic </td><td align="left">shaozhou </td><td align="left">Echo </td></tr><tr><td align="left">13. security.xml </td><td align="left">51K </td><td align="left">14P </td><td align="left">YuLimin </td><td align="left">xihuyu2000 </td><td align="left">Echo </td></tr><tr><td align="left">14. i18n.xml </td><td align="left">14K </td><td align="left">4P </td><td align="left">YY </td><td align="left">DigitalSonic </td><td align="left">Echo </td></tr><tr><td align="left">15. text.xml </td><td align="left">7K </td><td align="left">3P </td><td align="left">DigitalSonic </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">Echo </td></tr><tr><td align="left">16. itext.xml </td><td align="left">51K </td><td align="left">11P </td><td align="left">lyfcdy </td><td align="left">Echo </td><td align="left">YuLimin </td></tr><tr><td align="left">17. mail.xml </td><td align="left">26K </td><td align="left">7P </td><td align="left">chentianyi </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">Echo </td></tr><tr><td align="left">18. jms.xml </td><td align="left">11K </td><td align="left">5P </td><td align="left">YuLimin </td><td align="left">caoer </td><td align="left">Echo </td></tr><tr><td align="left">19. cache.xml </td><td align="left">11K </td><td align="left">3P </td><td align="left">crazycy </td><td align="left">CaoXiaogang </td><td align="left">DigitalSonic </td></tr><tr><td align="left">20. webservices.xml </td><td align="left">9K </td><td align="left">3P </td><td align="left">Echo </td><td align="left">YuLimin </td><td align="left">Echo </td></tr><tr><td align="left">21. remoting.xml </td><td align="left">37K </td><td align="left">13P </td><td align="left">crazycy </td><td align="left">agile_boy </td><td align="left">Echo </td></tr><tr><td align="left">22. gwt.xml </td><td align="left">10K </td><td align="left">4P </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">Echo </td><td align="left">YuLimin </td></tr><tr><td align="left">23. spring.xml </td><td align="left">13K </td><td align="left">4P </td><td align="left">YY </td><td align="left">caoer </td><td align="left">DigitalSonic </td></tr><tr><td align="left">24. hsearch.xml </td><td align="left">7K </td><td align="left">3P </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">agile_boy </td><td align="left">Echo </td></tr><tr><td align="left">25. configuration.xml </td><td align="left">48K </td><td align="left">15P </td><td align="left">yeby </td><td align="left">kuuyee </td><td align="left">Echo </td></tr><tr><td align="left">26. annotations.xml </td><td align="left">64K </td><td align="left">14P </td><td align="left">caoer </td><td align="left">CaoXiaogang </td><td align="left">YuLimin </td></tr><tr><td align="left">27. components.xml </td><td align="left">68K </td><td align="left">11P </td><td align="left">jiaochar </td><td align="left">zaya </td><td align="left">HuYan </td></tr><tr><td align="left">28. controls.xml </td><td align="left">47K </td><td align="left">13P </td><td align="left">Echo </td><td align="left">YuLimin </td><td align="left">Catherine </td></tr><tr><td align="left">29. elenhancements.xml </td><td align="left">5K </td><td align="left">2P </td><td align="left">CaoXiaogang </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">Echo </td></tr><tr><td align="left">30. testing.xml </td><td align="left">10K </td><td align="left">6P </td><td align="left">agile_boy </td><td align="left">CaoXiaogang </td><td align="left">YuLimin </td></tr><tr><td align="left">31. tools.xml </td><td align="left">23K </td><td align="left">9P </td><td align="left">junjzheng </td><td align="left">CaoXiaogang </td><td align="left">Echo </td></tr><tr><td align="left">32. oc4j.xml </td><td align="left">31K </td><td align="left">8P </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">YuLimin </td><td align="left">Echo </td></tr><tr><td align="left">33. dependencies.xml </td><td align="left">26K </td><td align="left">5P </td><td align="left">yeshucheng(&#19975;&#22269;&#36745;) </td><td align="left">DigitalSonic </td><td align="left">YuLimin </td></tr></tbody></table></div><p>
		</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="tutorial.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;1.&nbsp;Seam &#20837;&#38376;</td></tr></table></div></body></html>