<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Appendix&nbsp;A.&nbsp;Seam 2.0 &#24320;&#21457;&#25163;&#20876;&#20013;&#25991;&#32763;&#35793;&#39033;&#30446;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="up" href="index.html" title="Seam - &#35821;&#22659;&#30456;&#20851;&#30340;&#32452;&#20214; [&#28385;&#27743;&#32418;20080327]"><link rel="previous" href="dependencies.html" title="Chapter&nbsp;33.&nbsp;&#20381;&#36182;&#21253;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">Appendix&nbsp;A.&nbsp;Seam 2.0 &#24320;&#21457;&#25163;&#20876;&#20013;&#25991;&#32763;&#35793;&#39033;&#30446;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="dependencies.html">Prev</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;</td></tr></table><hr></div><div class="appendix" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="translator"></a>Appendix&nbsp;A.&nbsp;Seam 2.0 &#24320;&#21457;&#25163;&#20876;&#20013;&#25991;&#32763;&#35793;&#39033;&#30446;</h2></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e21022"></a>A.1.&nbsp;&#22768;&#26126;</h2></div></div><div></div></div><p>
		Seam&#20013;&#25991;&#21442;&#32771;&#25163;&#20876;&#24471;&#21040;Seam Framework&#24320;&#21457;&#22242;&#38431;&#21450;&#20027;&#35201;&#20316;&#32773;Gavin King&#30340;&#30452;&#25509;&#25480;&#26435;&#21644;&#25903;&#25345;&#65292;&#20854;&#30446;&#30340;&#26159;&#22312;&#20013;&#25991;&#19990;&#30028;&#25512;&#24191;&#20248;&#31168;&#30340;&#24320;&#28304;&#25216;&#26415;&#12290;&#26412;&#27425;&#32763;&#35793;&#27963;&#21160;&#30001;&#28385;&#27743;&#32418;&#24320;&#25918;&#25216;&#26415;&#30740;&#31350;&#32452;&#32455;&#65288;<a href="http://www.redsaga.com" target="_top">http://www.redsaga.com</a>&#65289;&#36827;&#34892;&#32763;&#35793;&#30340;&#32452;&#32455;&#12289;&#21327;&#35843;&#24037;&#20316;&#12290;&#39033;&#30446;&#36127;&#36131;&#20154;&#20026;&#20446;&#40654;&#25935;&#12290;&#25105;&#20204;&#22312;&#27492;&#37073;&#37325;&#23459;&#24067;&#65292;&#26412;&#27425;&#32763;&#35793;&#36981;&#24490;&#21407;Seam Framework&#30340;&#25480;&#26435;&#21327;&#35758;&#65292;&#21363;LGPL&#21327;&#35758;&#12290;&#22312;&#23436;&#25972;&#20445;&#30041;&#20840;&#37096;&#25991;&#26412;&#21253;&#25324;&#26412;&#29256;&#26435;&#39029;&#65292;&#24182;&#19981;&#36829;&#21453;LGPL&#21327;&#35758;&#30340;&#21069;&#25552;&#19979;&#65292;&#20801;&#35768;&#21644;&#40723;&#21169;&#20219;&#20309;&#20154;&#36827;&#34892;&#20840;&#25991;&#36716;&#36733;&#21450;&#25512;&#24191;&#12290;&#25105;&#20204;&#22312;&#27492;&#23459;&#24067;&#25152;&#26377;&#21442;&#19982;&#20154;&#21592;&#25918;&#24323;&#38500;&#32626;&#21517;&#26435;&#22806;&#30340;&#19968;&#20999;&#26435;&#21033;&#12290;
    </p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e21030"></a>A.2.&nbsp;&#39033;&#30446;&#21382;&#31243;</h2></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e21033"></a>A.2.1.&nbsp;Seam 1.2.1 &#24320;&#21457;&#25163;&#20876;&#32763;&#35793;&#39033;&#30446;</h3></div></div><div></div></div><p>
			&#25105;&#20204;2.0&#30340;&#32763;&#35793;&#39033;&#30446;&#26159;&#22522;&#20110; 1.2.1 &#32763;&#35793;&#39033;&#30446;&#30340;&#22522;&#30784;&#19978;&#36827;&#34892;&#30340;&#12290;
			</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e21038"></a>A.2.2.&nbsp;Seam 2.0 Beta 1 &#24320;&#21457;&#25163;&#20876;&#32763;&#35793;&#39033;&#30446;</h3></div></div><div></div></div><p>
				<span class="bold"><b>2007&#24180;09&#26376;05&#26085;</b></span>
			</p><p>&#39033;&#30446;&#21551;&#21160;&#65292;&#21551;&#21160;&#19968;&#33324;&#37117;&#26159;&#22312;&#22812;&#38388;&#21862;&#12290;
</p><p>
&#24182;&#22312;Spring&#20013;&#25991;&#35770;&#22363;&#65306;<a href="http://spring.jactiongroup.net/viewtopic.php?t=3521" target="_top">http://spring.jactiongroup.net/viewtopic.php?t=3521</a>
			</p><p>&#65288;&#22312;Yanger&#30340;&#22320;&#30424;&#19978;XXX&#19968;&#19979;&#65292;&#21478;&#25454;&#26195;&#38050;&#35828;Gavin King&#21644;Spring&#20851;&#31995;&#24456;&#22909;&#21834;&#65306;&#65289;&#65289;
</p><p>
JavaEye&#65306;<a href="http://yulimin.javaeye.com/blog/120769" target="_top">http://yulimin.javaeye.com/blog/120769</a>
			</p><p>
Matrix&#65306;<a href="http://www.matrix.org.cn/thread.shtml?topicId=14ba3958-5bbc-11dc-b06d-09b637715141&amp;forumId=17" target="_top">http://www.matrix.org.cn/thread.shtml?topicId=14ba3958-5bbc-11dc-b06d-09b637715141&amp;forumId=17</a>
			</p><p>
CSDN&#65306;<a href="http://community.csdn.net/Expert/TopicView1.asp?id=5745111" target="_top">http://community.csdn.net/Expert/TopicView1.asp?id=5745111</a>
			</p><p>
Dev2Dev&#65306;<a href="http://dev2dev.bea.com.cn/bbs/thread.jspa?forumID=64104&amp;threadID=43900&amp;tstart=0" target="_top">http://dev2dev.bea.com.cn/bbs/thread.jspa?forumID=64104&amp;threadID=43900&amp;tstart=0</a>
			</p><p>
CJSDN&#65306;<a href="http://www.cjsdn.net/post/view?bid=20&amp;id=191168&amp;sty=1&amp;tpg=1&amp;age=0" target="_top">http://www.cjsdn.net/post/view?bid=20&amp;id=191168&amp;sty=1&amp;tpg=1&amp;age=0</a>
			</p><p>
&#31561;&#31561;&#35770;&#22363;&#25509;&#21463;&#25253;&#21517;&#12290;
</p><p>
&#29992;&#20110;&#21327;&#35843;&#25511;&#21046;&#30340;wiki&#22320;&#22336;&#21457;&#24067;(<a href="http://wiki.redsaga.com/confluence/display/SeamRef" target="_top">http://wiki.redsaga.com/confluence/display/SeamRef</a>)&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;07&#26085;</b></span>
			</p><p>&#32463;&#36807;&#20004;&#22825;&#30340;&#22823;&#21147;&#23459;&#20256;&#65292;&#32456;&#20110;&#26377;&#20845;&#20301;&#20804;&#24351;&#30003;&#35831;&#21152;&#20837;&#20102;&#65292;&#25928;&#26524;&#36824;&#19981;&#38169;&#21834;&#65292;&#20294;&#26159;&#20173;&#38656;&#35201;&#21162;&#21147;&#23459;&#20256;&#65292;Robbin&#22312;JavaEye&#19978;&#24110;&#24537;&#32622;&#39030;&#20110;&#35770;&#22363;&#20013;&#30340;&#20844;&#21578;&#20102;&#65292;&#19981;&#20165;&#20165;&#26159;&#22312;&#28023;&#38420;&#22825;&#31354;&#29256;&#65292;&#20877;&#27425;&#34920;&#31034;&#24863;&#35874;&#65292;&#20063;&#30001;&#27492;&#24076;&#26395;&#26377;&#26356;&#22810;&#30340;&#20154;&#26469;&#21442;&#21152;&#12290;</p><p>
&#21508;&#20301;&#26032;&#26469;&#30340;&#20804;&#24351;&#26377;&#26102;&#38388;&#23601;&#25226;&#33258;&#24049; &#31168; &#20986;&#26469;&#32473;&#22823;&#20249;&#30631;&#30631;&#65292;&#35753;&#22823;&#23478;&#30475;&#19968;&#30475;&#19981;&#26159;&#27604;&#20013;&#22269;&#20307;&#25805;&#38431;&#30340;&#23567;&#20249;&#23376;&#20204;&#36824;&#35201;&#24069;&#21602;&#65306;&#65289;&#33267;&#23569;&#25105;&#30456;&#20449;&#27604;&#21496;&#20196;&#24069;&#26159;&#32943;&#23450;&#30340;&#12290;&#12290;&#12290;&#65306;&#65289;
</p><p>
&#26032;&#26469;&#30340;&#20804;&#24351;&#20808;&#29087;&#24713;&#19968;&#19979;&#22330;&#22320;&#65292;&#28982;&#21518;&#28909;&#36523;&#28909;&#36523;&#65292;&#19981;&#30528;&#24613;&#65292;&#36816;&#21160;&#20043;&#21069;&#19968;&#23450;&#35201;&#28909;&#36523;&#65292;&#36825;&#26679;&#25165;&#33021;&#20986;&#22909;&#25104;&#32489;&#65292;&#30772;&#32426;&#24405;&#25165;&#26377;&#24076;&#26395;&#65292;&#28909;&#36523;&#21160;&#20316;&#26377;&#24863;&#35273;&#19981;&#35268;&#33539;&#25110;&#19981;&#33298;&#26381;&#30340;&#22320;&#26041;&#65292;&#23601;&#35831;GTalk&#25110;&#37038;&#20214;&#19982;&#25105;&#65292;&#21496;&#20196;&#20250;&#25163;&#25226;&#25163;&#22320;&#24110;&#20320;&#25423;&#19968;&#25423;&#65306;&#65289;BTW&#65306;&#21496;&#20196;&#30334;&#31859;11'6&#65292;&#24046;&#28857;&#36798;&#26631;&#20108;&#32423;&#65292;&#21160;&#20316;&#36824;&#26159;&#27604;&#36739;&#35268;&#33539;&#30340;&#65292;&#32780;&#19988;&#25343;&#25423;&#21040;&#20301;&#65292;&#37325;&#35201;&#30340;&#26159;&#20813;&#36153;&#65307;&#21487;&#24796;&#29616;&#22312;&#20173;&#22788;&#20110;&#19977;&#32423;&#30340;&#38453;&#33829;&#37324;&#65292;&#23601;&#24046;&#28857;&#12290;&#12290;&#12290;
</p><p>
&#22522;&#20110;&#21407;&#26469;1.2.1&#30340;&#20219;&#21153;&#26377;&#22909;&#20960;&#20010;&#39046;&#21462;&#20102;&#65292;&#20294;&#19968;&#30452;&#27809;&#26377;&#36827;&#24230;&#26356;&#26032;&#65292;&#21508;&#20804;&#24351;&#33021;&#21542;&#25277;&#31354;&#30597;&#20004;&#30524;&#21602;&#65311;
</p><p>
&#21608;&#26411;&#65292;&#22823;&#23478;&#23601;&#22909;&#22909;&#20241;&#24687;&#20102;&#21543;&#12290;&#12290;&#12290; &#20241;&#24687;&#22909;&#20102;&#65292;&#21035;&#24536;&#35760;&#20102;&#36824;&#26377;&#20154;&#22312;&#25381;&#38829;&#36214;&#34382;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;09&#26085;</b></span>
			</p><p>&#26377;&#19977;&#20010;&#20219;&#21153;&#39046;&#21462;&#65292;&#24182;&#23436;&#25104;&#20102;&#20004;&#20010;&#65292;&#20294;&#26159;&#30001;&#20110;Wiki&#30340;&#38382;&#39064;&#23548;&#33268;&#26032;&#26469;&#30340;&#20154;&#21592;&#26080;&#27861;&#39046;&#21462;&#20219;&#21153;&#65292;&#36825;&#20010;&#38382;&#39064;&#38656;&#35201;&#26195;&#38050;&#23613;&#24555;&#24819;&#21150;&#27861;&#35299;&#20915;&#19968;&#19979;&#12290;
			</p><p>&#20854;&#23427;&#30340;&#20219;&#21153;&#22823;&#23478;&#32487;&#32493;&#39046;&#21462;&#65292;Wiki&#19978;&#30340;&#20219;&#21153;&#39046;&#21462;&#34920;&#26242;&#26102;&#30001;&#25105;&#26469;&#26356;&#26032;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;11&#26085;</b></span>
			</p><p>
6. conversations.xml 	 34K 	 10P 	  seanchan 	  	  	  working
			</p><p>
7. jbpm.xml 	32K 	10P 	 &#24046;&#27801; 	  	  	 &#32763;&#35793;-85% 	 2007-04-15
			</p><p>
17. mail.xml 	26K 	  7P 	 Xiaogang Cao 	  	  	 Working 	 
			</p><p>
27. components.xml 	68K 	11P 	 jiaochar 	  	  	 Working 	 
			</p><p>
28. controls.xml 	47K 	13P 	 blackwing 	  	  	 Working 	 
			</p><p>
30. testing.xml 	10K 	  6P 	 geshe 	  	  	 Working 	 
			</p><p>
31. tools.xml 	23K 	  9P 	 geshe 	  	  	 Working 	 
			</p><p>&#20170;&#22825;&#26159;&#20010;&#29305;&#21035;&#30340;&#26085;&#23376;&#65292;&#21040;&#30446;&#21069;&#20026;&#27490;&#65292;&#25105;&#20204;&#30340;&#24037;&#20316;&#36827;&#24230;&#20063;&#30456;&#24403;&#39034;&#21033;&#65292;&#20219;&#21153;&#37117;&#26377;&#20154;&#36827;&#34892;&#39046;&#21462;&#24182;&#24320;&#22987;&#24037;&#20316;&#65307;
			</p><p>
&#20854;&#20013; yeshucheng &#21516;&#23398;&#26368;&#20026;&#31215;&#26497;&#65292;&#39046;&#21462;&#20102;&#22235;&#20010;&#65292;&#23436;&#25104;&#20102;&#19977;&#20010;&#65292;&#25928;&#29575;&#20043;&#39640;&#20196;&#20154;&#20329;&#26381;&#21834;&#65281;&#65288;&#25484;&#22768;&#21709;&#36215;&#26469;&#12290;&#12290;&#12290;&#65289;&#65292;&#25353;&#25105;&#22899;&#20799;&#30340;&#19968;&#36143;&#35828;&#27861;&#26159;&#65292;&#20320;&#26159;&#31532;&#19968;&#21517;&#65292;&#22870;&#19968;&#20010;&#26143;&#26143;&#32473;&#20320;&#65306;
			</p><p>
&#21478;&#22806;&#65292;&#30001;&#20110;&#20197;&#19978;&#20960;&#20010;&#20219;&#21153;&#26102;&#38388;&#27604;&#36739;&#20037;&#20102;&#65292;&#33021;&#21542;&#25253;&#21578;&#19968;&#19979;&#29616;&#22312;&#30340;&#36827;&#24230;&#65292;&#22914;&#26524;&#26102;&#38388;&#19978;&#26377;&#22256;&#38590;&#65292;&#23558;&#30001;&#20854;&#23427;&#21516;&#23398;&#26469;&#39046;&#21462;&#65292;&#35831;&#22312;&#25910;&#21040;&#37038;&#20214;&#36890;&#30693;&#21518;&#24110;&#24537;&#26356;&#26032;&#19968;&#19979;&#36827;&#24230;&#65292;&#33509;&#26159;&#26102;&#38388;&#19978;&#26377;&#22256;&#38590;&#23601;&#20934;&#22791;&#31227;&#20132;&#20854;&#23427;&#21516;&#23398;&#26469;&#25509;&#25163;&#20102;&#12290;&#35874;&#35874;&#21512;&#20316;&#12290;
			</p><p>
&#26681;&#25454;&#36827;&#24230;&#65292;&#25105;&#20204;&#23601;&#21363;&#23558;&#36827;&#20837;&#27604;&#36739;&#33392;&#33510;&#30340;&#38454;&#27573;&#20102;&#65292;&#19968;&#23457;&#38454;&#27573;&#65292;&#19968;&#20123;&#38656;&#35201;&#27880;&#24847;&#30340;&#22320;&#26041;&#25105;&#21457;&#24067;&#22312; &#32763;&#35793;&#12289;&#26657;&#23545;&#27880;&#24847;&#20107;&#39033;&#65288;&#24517;&#35835;&#65289;&#29305;&#21035;&#26159;&#26032;&#21152;&#20837;&#32773; &#20102;&#65292;&#22823;&#23478;&#20808;&#21435;&#20102;&#35299;&#19968;&#19979;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;13&#26085;</b></span>
			</p><p>&#25226;&#21407;&#26469;&#24050;&#39046;&#21462;&#20294;&#26159;&#24182;&#23436;&#25104;&#32780;&#27809;&#26377;&#36827;&#24230;&#26356;&#26032;&#30340;&#20960;&#20010;&#20219;&#21153;&#25910;&#22238;&#20102;&#65292;&#24182;&#19988;&#20998;&#37197;&#32473;&#30003;&#35831;&#21152;&#20837;&#22242;&#38431;&#30340;&#20154;&#21592;&#36827;&#34892;&#35797;&#35793;&#65292;&#20813;&#24471;&#35797;&#35793;&#21407;&#26469;&#19968;&#22823;&#27573;&#30340;&#20869;&#23481;&#65292;&#28010;&#36153;&#20102;&#26102;&#38388;&#65292;&#21487;&#24796;&#20102;&#36164;&#28304;&#65292;&#29616;&#22312;&#35762;&#30340;&#26159;&#36164;&#28304;&#33410;&#32422;&#22411;&#31038;&#20250;&#21834;&#12290;&#25105;&#20204;&#21487;&#19981;&#33021;&#28010;&#36153;&#19982;&#38138;&#24352;&#20102;&#21834;&#12290;
			</p><p>
yeshucheng &#21516;&#23398;&#22235;&#20010;&#20219;&#21153;&#22522;&#26412;&#19978;&#37117;&#23436;&#25104;&#20102;&#65292;&#38500;&#20102;&#19968;&#20010;&#20219;&#21153;&#37324;&#26377;&#20123;&#22320;&#26041;&#20182;&#19981;&#26159;&#24456;&#30830;&#23450;&#20043;&#22806;&#65292;&#31561;&#19968;&#23457;&#26102;&#20877;&#36827;&#34892;&#20102;&#12290;&#19981;&#36807;&#21548;&#20182;&#35828;&#36825;&#20004;&#22825;&#20005;&#37325;&#24863;&#20882;&#65292;&#21496;&#20196;&#20063;&#21457;&#34920;&#24944;&#38382;&#65292;&#24182;&#20005;&#37325;&#20851;&#27880;&#20107;&#24577;&#30340;&#21457;&#23637;&#65292;&#31069;&#26089;&#26085;&#24247;&#22797;&#65292;&#32487;&#32493;&#26469;&#36827;&#34892;&#19968;&#26657;&#30340;&#24037;&#20316;&#12290;
			</p><p>
&#35797;&#35793;&#30340;&#36827;&#24230;&#20013;&#65292;mail.xml&#19982;testing.xml&#24050;&#32463;&#23436;&#25104;&#65292;&#24182;&#21021;&#27493;&#36890;&#36807;&#23457;&#26680;&#65292;&#22522;&#26412;&#19978;&#36798;&#21040;&#35201;&#27714;&#12290;&#23558;&#27492;&#20219;&#21153;&#30452;&#25509;&#20998;&#37197;&#32473;&#35797;&#35793;&#20154;&#21592;&#65292;&#24076;&#26395;&#33021;&#22815;&#20877;&#27425;&#36827;&#34892;&#19968;&#20123;Review&#24037;&#20316;&#65292;&#24182;&#25552;&#20132;CVS&#19978;&#38754;&#26469;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;15&#26085;</b></span>
			</p><p>&#36234;&#26469;&#36234;&#22810;&#30340;&#21516;&#23398;&#20204;&#30003;&#35831;&#21152;&#20837;&#20102;&#65292;&#30446;&#21069;&#30340;&#24037;&#20316;&#24320;&#22987;&#36827;&#20837;&#19968;&#23457;&#24037;&#20316;&#20102;&#65292;&#24076;&#26395;&#27491;&#22312;&#35797;&#35793;&#30340;&#21516;&#23398;&#20204;&#23613;&#24555;&#23436;&#25104;&#35797;&#35793;&#65292;&#24182;&#25552;&#20132;&#22238;&#26469;&#65292;&#20197;&#20415;&#19968;&#23457;&#24037;&#20316;&#39034;&#21033;&#22320;&#36827;&#34892;&#19979;&#21435;&#12290;
			</p><p>
&#21018;&#21152;&#20837;&#30340;&#23567;&#21608;&#21516;&#23398;zaya&#65292;&#22312;&#27604;&#21033;&#26102;&#21462;&#24471;&#35745;&#31639;&#26426;&#26412;&#31185;&#27605;&#19994;&#65292;&#30446;&#21069;&#22312;&#22269;&#20869;&#65292;&#21033;&#29992;&#36825;&#20010;&#31354;&#20313;&#30340;&#26102;&#38388;&#21152;&#20837;&#20102;&#25105;&#20204;&#65292;&#25105;&#20204;&#28909;&#28872;&#34920;&#31034;&#27426;&#36814;&#12290;&#24182;&#19988;&#22312;&#19968;&#23457;&#30340;&#24037;&#20316;&#20013;&#23436;&#25104;&#30340;&#30456;&#24403;&#24555;&#36895;&#12290;
			</p><p>
&#24050;&#32463;&#23436;&#25104;&#20102; gettingstarted.xml &#30340;&#19968;&#23457;&#24037;&#20316;&#65292;&#20851;&#20110;&#20182;&#22312;&#19968;&#23457;&#24037;&#20316;&#20013;&#25152;&#20570;&#30340;&#23457;&#26657;&#35760;&#24405;&#65292;&#25105;&#22312;&#36825;&#37324;&#36827;&#34892;&#20844;&#24067;&#65292;&#24182;&#25226;&#20182;&#30340;&#19968;&#20123;&#25152;&#24819;&#19982;&#24314;&#35758;&#25918;&#19978;&#26469;&#65292;&#22823;&#23478;&#21487;&#20197;&#21442;&#32771;&#12290;
			</p><p>
&#19968;&#23457;&#20108;&#23457;&#20043;&#26368;&#20339;&#23454;&#36341;&#65292;&#23457;&#26657;&#32773;&#24517;&#30475;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;17&#26085;</b></span>
			</p><p>&#20026;&#20102;&#26041;&#20415;&#22823;&#23478;&#38598;&#20013;&#31934;&#21147;&#36827;&#34892;&#19968;&#23457;&#24037;&#20316;&#65292;&#25105;&#32034;&#24615;&#25226;&#25152;&#26377;&#30340;&#25991;&#20214;&#36827;&#34892;&#20102;&#27604;&#23545;&#19982;&#21512;&#24182;&#65292;&#36825;&#26679;&#22823;&#23478;&#21487;&#20197;&#30452;&#25509;&#22312;cn-2.0.0B1&#19979;&#38754;&#30340;&#25991;&#20214;&#36827;&#34892;&#30452;&#25509;&#30340;&#19968;&#23457;&#20102;&#65292;&#24076;&#26395;&#21487;&#20197;&#21152;&#24555;&#22823;&#23478;&#30340;&#19968;&#23457;&#36895;&#24230;&#12290;
			</p><p>
&#21516;&#26102;&#25105;&#20063;&#24314;&#31435;&#20102;&#30456;&#20851;&#30340;build&#21450;&#30456;&#20851;&#30340;&#25991;&#20214;&#65292;&#24182;&#29983;&#25104;&#20102;&#20869;&#37096; CHM &#29256;&#26412;&#20102;&#65292;&#31561;&#32763;&#35793;&#38454;&#27573;&#30340;&#20219;&#21153;&#20840;&#37096;&#23436;&#25104;&#21518;&#65292;&#25105;&#20204;&#23601;&#21487;&#20197;build&#20986;&#31532;&#19968;&#20010;&#29256;&#26412;&#26469;&#20379;&#20869;&#37096;&#38405;&#35835;&#20102;&#12290;
			</p><p>
&#19968;&#23457;&#30340;&#24037;&#20316;&#26377;&#22235;&#20010;&#24320;&#22987;&#39046;&#21462;&#24182;&#24037;&#20316;&#65292;&#21152;&#27839;&#21162;&#21147;&#24178;&#21834;&#65292;&#20013;&#31179;&#23601;&#24555;&#35201;&#21040;&#20102;&#65292;&#25105;&#39532;&#19978;&#23601;&#35201;&#32473;&#22823;&#20249;&#21457;&#26376;&#39292;&#20102;&#21862;&#65306;&#65289;
			</p><p>
&#30001;&#20110; richard &#21516;&#23398;&#20020;&#26102;&#39033;&#30446;&#19978;&#39532;&#65292;&#26242;&#19988;&#19981;&#33021;&#32763;&#35793; groovy.xml &#31456;&#33410;&#65292;&#26377;&#20852;&#36259;&#30340;&#21516;&#23398;&#21487;&#20197;&#24320;&#22987;&#25250;&#21862;&#12290;&#12290;&#12290;&#19981;&#36807;&#25105;&#21487;&#23601;&#35201;&#36817;&#27700;&#27004;&#21488;&#20808;&#24471;&#26376;&#20102;&#21834;&#65306;&#65289;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;19&#26085;</b></span>
			</p><p>&#21448;&#26377;&#20004;&#20301;&#26032;&#21516;&#23398;&#30003;&#35831;&#21152;&#20837;&#20102;&#65292;&#35753;&#20182;&#20204;&#24037;&#20316;&#22312;&#35797;&#23457;&#19978;&#38754;&#65292;&#24453;&#35797;&#23457;&#36890;&#36807;&#21518;&#27491;&#24335;&#21152;&#20837;&#12290;

&#19968;&#23457;&#26377;&#20219;&#21153;&#23436;&#25104;&#24773;&#20917;&#65292;&#20219;&#21153;&#30003;&#35831;&#36827;&#24230;&#19981;&#38169;&#65292;&#32487;&#32493;&#21152;&#27833;&#21834;&#65292; groovy.xml &#20063;&#26377;&#20154;&#35748;&#39046;&#20102;&#65292;&#21160;&#20316;&#30495;&#24555;&#21834;&#65292;&#29616;&#22312;&#23601;&#26159; itext.xml &#30340;&#38382;&#39064;&#20102;&#65292;&#19981;&#30693;&#36947;&#25214;&#24471;&#22238;&#26469;&#19981;&#65311;&#25214;&#19981;&#22238;&#26469;&#23601;&#24471;&#37325;&#26032;&#24320;&#22987;&#32763;&#35793;&#20102;&#12290;
			</p><p>
&#21478;&#22806;&#65306;&#35797;&#35793;&#19982;&#35797;&#23457;&#30340;&#21516;&#23398;&#36895;&#24230;&#35201;&#21152;&#24555;&#19968;&#20123;&#21734;&#65306;&#65289; &#36825;&#20123;&#22825;&#25509;&#36830;&#21152;&#29677;&#65292;&#32047;&#65292;&#30524;&#30555;&#37117;&#30529;&#19981;&#24320;&#20102;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;21&#26085;</b></span>
			</p><p>groovy.xml &#32763;&#35793;&#23436;&#25104;&#65292;&#36895;&#24230;&#19981;&#38169;&#65292;&#26195;&#38050;&#30340; concepts.xml &#20063;&#32763;&#35793;&#23436;&#25104;&#20102;&#21862;&#65292;&#25105;&#21512;&#24182;&#20102;&#65292;kuuyee&#20063;&#24320;&#22987;&#19968;&#23457;&#20102;&#65292;&#25250;&#24471;&#30495;&#24555;&#65307;&#65289;conversations.xml&#12289;configuration.xml &#20063;&#32763;&#35793;&#21512;&#24182;&#23436;&#25104;&#65292;&#21487;&#20197;&#24320;&#22987;&#19968;&#23457;&#24037;&#20316;&#65292;&#22312;&#27491;&#24335;&#21152;&#20837;&#30340;&#25104;&#21592;&#24403;&#20013;&#65292;&#32763;&#35793;&#19982;&#19968;&#23457;&#30340;&#36827;&#24230;&#37117;&#19981;&#38169;&#12290;&#21807;&#19968;&#24863;&#21040;&#26377;&#28857;&#20799;&#36951;&#25022;&#30340;&#26159;&#21018;&#30003;&#35831;&#21152;&#20837;&#30340;&#21516;&#23398;&#20204;&#22312;&#35797;&#35793;&#19982;&#35797;&#23457;&#30340;&#36827;&#24230;&#19978;&#38754;&#22914;&#26524;&#33021;&#22815;&#35937;&#24050;&#27491;&#24335;&#21152;&#20837;&#30340;&#21516;&#23398;&#20204;&#30340;&#36895;&#24230;&#19968;&#26679;&#24555;&#30340;&#35805;&#65292;&#37027;&#23601;&#24456;&#22909;&#20102;&#12290;
			</p><p>
&#36817;&#26085;&#65292;&#31179;&#39118;&#36865;&#29245;&#65292;&#36827;&#20837;&#31179;&#22825;&#20102;&#65292;&#20013;&#31179;&#20063;&#23601;&#24555;&#21040;&#20102;&#12290;&#22312;&#36825;&#37324;&#25552;&#21069;&#32473;&#21516;&#23398;&#20204;&#21457;&#26376;&#39292;&#20102;&#65292;&#31069;&#22823;&#23478;&#20013;&#31179;&#33410;&#24555;&#20048;&#65281;&#26376;&#39292;
			</p><p>
&#23567;&#21608;&#21516;&#23398; yaza &#22312;&#19968;&#23457;&#30340;&#24037;&#20316;&#20013;&#30456;&#24403;&#30340;&#35748;&#30495;&#65292;&#23454;&#22312;&#26159;&#20329;&#26381;&#65281;&#65288;&#25484;&#22768;&#40723;&#21169;&#65292;&#21709;&#36215;&#26469;&#12290;&#12290;&#12290;&#65289;&#65292;&#35831;&#30475; &#19968;&#23457;&#20108;&#23457;&#20043;&#26368;&#20339;&#23454;&#36341;&#65292;&#23457;&#26657;&#32773;&#24517;&#30475; &#20182;&#25152;&#20570;&#30340;&#24037;&#20316;&#35760;&#24405;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;23&#26085;</b></span>
			</p><p>&#21040;&#20170;&#22825;&#26202;&#19978;&#20026;&#27490;&#65292;&#19968;&#23457;&#30340;&#24037;&#20316;&#26377;&#20116;&#20010;&#23436;&#25104;&#65292;&#19968;&#20010;&#23436;&#25104;80%&#65292;&#19977;&#20010;&#22312;&#19968;&#23457;&#20013;&#65292;&#25509;&#36817;&#19968;&#23457;&#24037;&#20316;&#37327;&#30340;20%&#65292;&#20294;&#26159; webservices.xml controls.xml tools.xml &#30340;&#35797;&#35793;&#24037;&#20316;&#36824;&#27809;&#26377;&#23436;&#25104;&#65292;itext.xml&#29616;&#22312;&#25214;&#19981;&#21040;&#21407;&#26469;&#30340;&#29256;&#26412;&#65292;&#32780;&#19988;Xu MingMing&#21516;&#23398;&#20063;&#19968;&#30452;&#27809;&#26377;&#25552;&#20132;&#19978;&#26469;&#65292;&#21482;&#33021;&#24320;&#22987;&#37325;&#26032;&#32763;&#35793;&#20102;&#12290;&#30446;&#21069;&#20063;&#23436;&#25104;20%&#24038;&#21491;&#20102;&#12290;&#19968;&#23457;&#30340;&#24037;&#20316;&#36824;&#38656;&#35201;&#22823;&#23478;&#30340;&#25346;&#21495;&#24320;&#24037;&#21834;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;26&#26085;</b></span>
			</p><p>&#22823;&#23478;&#26159;&#21542;&#36824;&#27785;&#37257;&#20110;&#20013;&#31179;&#20339;&#33410;&#30340;&#27426;&#20048;&#24403;&#20013;&#21568;&#65292;&#36817;&#26469;&#36827;&#24230;&#24456;&#19968;&#33324;&#21568;&#65292;&#21496;&#20196;&#24456;&#29983;&#27668;&#21568;&#12290;&#12290;&#12290;&#65306;&#65288;
			</p><p>
&#26377;&#26102;&#38388;&#30340;&#20804;&#24351;&#30475;&#30475;&#36827;&#24230;&#34920;&#22043;&#65292;&#30475;&#30475;&#26377;&#27809;&#26377;&#36866;&#21512;&#33258;&#24049;&#30340;&#23601;&#39046;&#21462;&#22238;&#23478;&#36807;&#33410;&#21568;&#12290;&#12290;&#12290;&#36807;&#23436;&#33410;&#23601;&#22238;&#24402;&#21040;CVS&#19978;&#22043;&#65307;&#65289;
			</p><p>
&#21478;&#22806;&#35201;&#25209;&#35780;&#19968;&#19979;
			</p><p>20. webservices.xml 	9K 	  	mazhao&#35797;&#35793;&#20013; 	  	  	Working 	2007-09-07
			</p><p>31. tools.xml 	23K 	9P 	junjzheng&#35797;&#35793;&#20013; 	  	  	  	2007-09-12
28. controls.xml 	47K 	13P 	huwenjiemaster&#35797;&#35793;&#20013; 	  	  	  	2007-09-13
			</p><p>
&#19977;&#20301;&#35797;&#35793;&#30340;&#21516;&#23398;&#65292;&#26102;&#38388;&#20063;&#22826;&#20037;&#20102;&#21543;&#65292;&#27492;&#37038;&#20214;&#21457;&#20986;&#21518;&#65292;&#22914;&#26524;&#36824;&#27809;&#26377;&#25910;&#21040;&#20320;&#20204;&#30340;&#30830;&#20999;&#22238;&#22797;&#30340;&#35805;&#65292;&#23601;&#20934;&#22791;&#21462;&#28040;&#20320;&#20204;&#30340;&#35797;&#35793;&#35831;&#27714;&#20102;&#65292;&#22810;&#35874;&#37197;&#21512;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;28&#26085;</b></span>
			</p><p>&#28909;&#28872;&#27426;&#36814; DigitalSonic &#22238;&#24402;&#22242;&#38431;&#65281; </p><p>
				<span class="bold"><b>2007&#24180;09&#26376;29&#26085;</b></span>
			</p><p>mazhao &#30340;&#30005;&#35805;&#27809;&#26377;&#20154;&#25509;&#21548;&#65292;junjzheng &#30005;&#35805;&#32852;&#31995;&#20102;&#65292;&#20182;&#22312;&#21162;&#21147;&#20013;&#65292;&#22269;&#24198;&#33410;&#21518;&#25552;&#20132;&#65292;huwenjiemaster &#30005;&#35805;&#32852;&#31995;&#36807;&#20102;&#65292;&#22240;&#36817;&#26399;&#20986;&#24046;&#26242;&#26102;&#21462;&#28040;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;09&#26376;30&#26085;</b></span>
			</p><p>&#38454;&#27573;&#24615;&#26376;&#24635;&#32467;&#65306;&#65299;&#65301;&#20010;&#23567;&#20219;&#21153;
			</p><p>
&#19968;&#12289;&#32763;&#35793;&#24773;&#20917;&#65306;&#23436;&#25104;&#65299;&#65297;&#20010;&#65292;&#36824;&#26377;&#65300;&#20010;&#22312;&#35797;&#35793;&#20013;
			</p><p>
16. itext.xml     51K     11P     topquan&#35797;&#35793;&#20013;
			</p><p>
20. webservices.xml     9K          mazhao&#35797;&#35793;&#20013;
			</p><p>
28. controls.xml     47K     13P     xukai&#35797;&#35793;
			</p><p>
31. tools.xml     23K     9P     junjzheng&#35797;&#35793;&#20013; 
			</p><p>
&#20108;&#12289;&#19968;&#23457;&#24773;&#20917;&#65306;&#23436;&#25104;&#65304;&#20010;&#65292;&#27491;&#22312;&#35797;&#23457;&#65301;&#20010;&#65292;&#19968;&#23457;&#24037;&#20316;&#36827;&#34892;&#20013;&#65300;&#20010;&#65292;&#20173;&#26410;&#30003;&#39046;&#65297;&#65304;&#20010;&#65288;&#21253;&#21547;&#65300;&#20010;&#35797;&#35793;&#65289;
			</p><p>
&#22269;&#24198;&#33410;&#21516;&#20048;&#65281;&#26377;&#26102;&#38388;&#26469;&#20851;&#27880;&#20851;&#27880;&#19968;&#19979;&#65306;&#65289; </p><p>
				<span class="bold"><b>2007&#24180;10&#26376;07&#26085;</b></span>
			</p><p>&#22269;&#24198;&#38271;&#20551;&#32467;&#26463;&#20102;&#65292;&#19971;&#22825;&#26102;&#38388;&#22823;&#23478;&#29609;&#24471;&#24320;&#24515;&#19981;&#65311;&#21035;&#24536;&#35760;&#25226;&#21435;&#29609;&#30340;&#24515;&#24471;&#19982;&#30456;&#29255; Share &#20986;&#26469;&#21568;&#65306;&#65289; 
			</p><p>
&#22312;&#36825;&#27425;&#22269;&#24198;&#38271;&#20551;&#37324;&#65292;&#25105;&#20204;&#30340; DigitalSonic &#21516;&#23398;&#23436;&#25104;&#20102; 3 &#20010;&#19968;&#23457;&#65292;&#26361;&#26195;&#38050;&#21516;&#23398;&#23436;&#25104;&#20102; 3 &#20010;&#19968;&#23457;&#65292;yeshucheng &#21516;&#23398;&#23436;&#25104;&#20102; 1 &#20010;&#19968;&#23457;&#65292;1 &#20010;&#22312;&#36827;&#34892;&#20013;&#65292;&#22823;&#23478;&#40723;&#25484;&#65288;&#25484;&#22768;&#29031;&#26679;&#21709;&#36215;&#26469;&#12290;&#12290;&#12290;&#65289;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;09&#26085;</b></span>
			</p><p>&#25910;&#21040;&#19968;&#20010;&#35797;&#35793;&#30340;&#21453;&#39304;&#32467;&#26524;&#65292;&#26195;&#38050;&#36827;&#34892;&#20102;&#20840;&#25991;&#25209;&#27880;&#19982;&#19968;&#23457;&#65292; yeshucheng &#21516;&#23398;&#20063;&#23436;&#25104;&#20102; 1 &#20010;&#19968;&#23457;&#12290;&#20854;&#23427;&#21516;&#23398;&#20272;&#35745;&#37117;&#36824;&#27809;&#26377;&#20174;&#38271;&#20551;&#32508;&#21512;&#30151;&#24674;&#22797;&#36807;&#26469;&#65306;&#65289;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;11&#26085;</b></span>
			</p><p>Hi&#65292;&#21508;&#20301;&#65292;&#37266;&#37266;&#21834;&#65292;&#24590;&#20040;&#27809;&#26377;&#21160;&#38745;&#21602;&#65311; &#38271;&#20551;&#32508;&#21512;&#30151; continuing ... &#65306;&#65288;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;13&#26085;</b></span>
			</p><p>&#27426;&#36814;&#19968;&#20301;&#26032;&#21516;&#23398;&#30340;&#30003;&#35831;&#21152;&#20837;&#65292;&#20272;&#35745;&#22823;&#23478;&#20877;&#20241;&#24687;&#23436;&#36825;&#19968;&#21608;&#21518;&#20803;&#27668;&#24212;&#24403;&#21487;&#20197;&#24674;&#22797;&#36807;&#26469;&#20102;&#21834;&#12290;&#12290;&#12290;&#38271;&#20551;&#32508;&#21512;&#30151; continuing ... &#65306;&#65288;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;15&#26085;</b></span>
			</p><p>&#20170;&#22825;&#26159;&#19968;&#20010;&#29305;&#27530;&#30340;&#26085;&#23376;&#65281;
			</p><p>
&#30001;&#20110;&#20004;&#27425;&#26080;&#27861;&#32852;&#31995;&#19978; webservices.xml &#30340;&#35797;&#35793;&#32773;&#65292;&#29616;&#23558;&#20043;&#21462;&#28040;&#65292;&#21478;&#30005;&#35805;&#32852;&#31995;&#20102; itext.xml &#35797;&#35793;&#20102;20%&#30340;&#21516;&#23398;&#65292;&#20182;&#20063;&#22240;&#26102;&#38388;&#20851;&#31995;&#32780;&#26080;&#27861;&#32487;&#32493;&#21442;&#19982;&#36827;&#26469;&#65292;&#20063;&#23558;&#27492;&#20219;&#21153;&#26242;&#26102;&#21462;&#28040;&#12290;&#20854;&#23427;&#21516;&#23398;&#21487;&#20197;&#32487;&#32493;&#39046;&#21462;&#20102;&#65292;&#35831;&#35797;&#23457;&#30340;&#21516;&#23398;&#19982;&#26412;&#21608;&#26411;&#20043;&#21069;&#25552;&#20132;&#35797;&#23457;&#30340;&#32467;&#26524;&#65292;&#36807;&#20102;&#26412;&#21608;&#26411;&#20043;&#21518;&#65292;&#23558;&#33258;&#21160;&#21462;&#28040;&#20320;&#30340;&#20219;&#21153;&#19982;&#21152;&#20837;&#35831;&#27714;&#65292;&#35874;&#35874;&#65281;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;19&#26085;</b></span>
			</p><p>&#37117;&#22312;&#21442;&#21152;&#20195;&#34920;&#22823;&#20250;&#65292;&#24537;&#30860;&#20013;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;21&#26085;</b></span>
			</p><p>&#36825;&#20004;&#22825;&#65292;&#25105;&#20877;&#27425;&#36992;&#35831;&#21040;&#20004;&#20301;&#26032;&#21516;&#23398;&#21152;&#20837;&#25105;&#20204;&#30340;&#22242;&#38431;&#20102;&#12290;
			</p><p>
&#32763;&#35793;&#24037;&#20316;&#21482;&#21097;&#19979;&#19977;&#20010;&#35797;&#35793;&#30340;&#24037;&#20316;&#65292;&#24076;&#26395;&#33021;&#22815;&#22312;&#26412;&#21608;&#20043;&#20869;&#23436;&#25104;&#20840;&#37096;&#30340;&#32763;&#35793;&#24037;&#20316;&#12290;
			</p><p>
&#19968;&#23457;&#24037;&#20316;&#36824;&#26377;&#65302;&#20010;&#27809;&#26377;&#20154;&#39046;&#21462;&#30340;&#65292;&#20197;&#30446;&#21069;&#30340;&#36827;&#24230;&#26469;&#30475;&#65292;&#65297;&#65297;&#26376;&#65301;&#21495;&#25105;&#20204;&#24212;&#24403;&#21487;&#20197;&#39044;&#26399;&#23436;&#25104;&#32763;&#35793;&#30340;&#20840;&#37096;&#24037;&#20316;&#12290;&#24182;&#19988;&#25105;&#20204;&#30340;&#19968;&#23457;&#24037;&#20316;&#20063;&#25552;&#21069;&#36827;&#34892;&#24182;&#23436;&#25104;&#20102;&#32422;&#65301;&#65296;&#65285;&#65292;&#21487;&#20197;&#20048;&#35266;&#22320;&#20272;&#35745;&#25105;&#20204;&#24212;&#35813;&#33021;&#22815;&#25353;&#26102;&#23436;&#25104;&#27492;&#27425;&#30340;&#32763;&#35793;&#24037;&#20316;&#65292;&#24863;&#35874;&#22823;&#23478;&#36825;&#19968;&#27573;&#26102;&#38388;&#20197;&#26469;&#30340;&#36763;&#33510;&#24037;&#20316;&#19982;&#21162;&#21147;&#22857;&#29486;&#65281;&#35874;&#35874;&#65281;
			</p><p>
&#20108;&#23457;&#24037;&#20316;&#20063;&#21487;&#20197;&#21516;&#27493;&#24320;&#22987;&#36827;&#34892;&#20102;&#65292;&#24076;&#26395;&#26377;&#26102;&#38388;&#30340;&#21516;&#23398;&#31215;&#26497;&#22320;&#36827;&#34892;&#39046;&#21462;&#19982;&#23457;&#26657;&#65281;
			</p><p>
&#21162;&#21147;&#65281;&#21162;&#21147;&#65281;&#20877;&#21162;&#21147;&#65281;&#25105;&#20204;&#19968;&#23450;&#21487;&#20197;&#23436;&#25104;&#36825;&#27425;&#20809;&#33635;&#30340;&#20219;&#21153;&#65306;&#65289; &#35874;&#35874;&#65281;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;24&#26085;</b></span>
			</p><p>&#21916;&#21916;&#21916;&#65306;
			</p><p>
1&#12289;&#21313;&#19971;&#22823;&#20250;&#35758;&#32988;&#21033;&#22278;&#28385;&#22320;&#38381;&#24149;&#20102;&#65281;
			</p><p>
2&#12289;&#23270;&#23077;&#19968;&#21495;&#20170;&#22825;&#26202;&#19978;&#20063;&#25104;&#21151;&#21457;&#23556;&#65292;&#24182;&#27491;&#24120;&#36827;&#20837;&#22320;&#29699;&#36712;&#36947;&#20102;&#65281;
			</p><p>
3&#12289;&#25105;&#20204;&#30340;&#32763;&#35793;&#20219;&#21153;&#20063;&#21482;&#21097;&#26368;&#21518;&#19968;&#20010;&#30340;20%&#30340;&#35797;&#35793;&#20102;&#65281;
			</p><p>
4&#12289;&#19968;&#23457;&#24037;&#20316;&#20063;&#22312;&#32039;&#24352;&#22320;&#36827;&#34892;&#20013;&#65292;&#24076;&#26395;&#22823;&#23478;&#32487;&#32493;&#39046;&#21462;&#20219;&#21153;&#65281;
			</p><p>
5&#12289;&#24320;&#20010;&#23567;&#20250;&#65292;&#29616;&#22312;Seam 2.0.0&#20986;&#20102;RC2&#20102;&#65292;&#25105;&#20204;&#30340;&#20108;&#23457;&#24037;&#20316;&#26159;&#21542;&#32771;&#34385;&#20877;&#27425;&#36827;&#34892;&#21512;&#24182;&#21602;&#65311;&#36824;&#26159;&#31561;&#27491;&#24335;&#29256;&#20986;&#26469;&#21518;&#20877;&#36827;&#34892;&#21512;&#24182;&#65311;
			</p><p># 05.10.2007: Seam 2.0.0.CR2 has been released.
			</p><p># 18.09.2007: Seam 2.0.0.CR1 has been released.
			</p><p># 27.06.2007: Seam 2.0.0.BETA1 has been released.
			</p><p>
&#19978;&#38754;&#26159;Seam&#30340;&#21457;&#24067;&#26102;&#38388;&#65292;&#20272;&#35745;CR2&#21518;&#24212;&#24403;&#23601;&#26159;&#27491;&#24335;&#29256;&#20102;&#21543;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;25&#26085;</b></span>
			</p><p>&#19981;&#21916;&#19981;&#21916;&#65306;
			</p><p>
&#26368;&#21518;&#19968;&#20301;&#35797;&#35793;&#30340;&#32463;&#30005;&#35805;&#32852;&#31995;&#20063;&#22240;&#26102;&#38388;&#20851;&#31995;&#21487;&#33021;&#26080;&#27861;&#20840;&#37096;&#23436;&#25104;&#20102;&#12290;
			</p><p>
&#35797;&#35793;&#30340;&#20004;&#20301;&#21516;&#23398;&#30005;&#35805;&#32852;&#31995;&#21518;&#20063;&#22240;&#21508;&#33258;&#30340;&#21407;&#22240;&#32780;&#36864;&#20986;&#20102;&#12290;
			</p><p>
&#27809;&#26377;&#20851;&#31995;&#65292;&#26412;&#21608;&#26411;&#30340;&#30446;&#26631;&#26159;&#23436;&#25104;&#25152;&#26377;&#30340;&#32763;&#35793;&#20219;&#21153;&#65292;&#24182;&#20105;&#21462;&#19968;&#23457;&#23436;&#25104;99%&#65306;&#65289;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;27&#26085;</b></span>
			</p><p>&#30475;&#26469;&#26368;&#21518;&#19968;&#20301;&#35797;&#35793;&#30340;&#21516;&#23398;&#20063;&#26080;&#27861;&#21450;&#26102;&#23436;&#25104;&#20219;&#21153;&#20102;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;29&#26085;</b></span>
			</p><p>xukai&#30340;&#35797;&#35793;&#24037;&#20316;&#24182;&#27809;&#26377;&#23436;&#25104;&#65292;&#24182;&#19988;&#22312;&#30005;&#35805;&#36890;&#30693;&#19977;&#22825;&#21518;&#20063;&#27809;&#26377;&#25552;&#20132;&#20219;&#21153;&#36827;&#24230;&#24773;&#20917;&#19982;&#25991;&#26723;&#65292;&#29305;&#27492;&#21462;&#28040;&#20854;&#35797;&#35793;&#36164;&#26684;&#65281;</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;29&#26085;</b></span>
			</p><p>&#37324;&#31243;&#30865;&#20107;&#20214;&#65306;

			</p><p>
&#32463;&#36807;&#36817;&#20004;&#20010;&#26376;&#21162;&#21147;&#22859;&#25112;&#65292;&#21040;&#20170;&#22825;&#20026;&#27490;&#65292;&#32763;&#35793;&#24037;&#20316;&#20840;&#37096;&#23436;&#25104;&#65292;&#22312;&#27492;&#24863;&#35874;&#25152;&#26377;&#21442;&#19982;&#30340;&#32763;&#35793;&#20154;&#21592;&#65281;&#35874;&#35874;&#20320;&#20204;&#20102;&#65292;&#36763;&#33510;&#20102;&#65281;
</p><p>
&#29616;&#23558;&#32763;&#35793;&#30340;&#24037;&#20316;&#20219;&#21153;&#36827;&#34892;&#32479;&#35745;&#22914;&#19979;&#65306;&#65288;&#25353;&#23436;&#25104;&#30340;&#20219;&#21153;&#20010;&#25968;&#30340;&#22810;&#23569;&#65292;&#24182;&#19981;&#20934;&#30830;&#65292;&#22240;&#20026;&#26377;&#39029;&#25968;&#30340;&#20851;&#31995;&#65289;
		</p><p>
				</p><div class="table"><a name="d0e21380"></a><p class="title"><b>Table&nbsp;A.1.&nbsp;&#21442;&#19982;&#20154;&#21592;&#21015;&#34920;</b></p><table summary="&#21442;&#19982;&#20154;&#21592;&#21015;&#34920;" width="100%" border="1"><colgroup><col align="center"><col align="center"><col align="center"><col><col></colgroup><thead><tr><th align="center">&#32763;&#35793;&#20154;&#21592;</th><th align="center">&#23436;&#25104;&#30340;&#32763;&#35793;&#24037;&#20316;&#37327;</th><th align="center">&#22791;&#27880;</th><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr></thead><tbody><tr><td align="center">yeshucheng</td><td align="center">4</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">CaoXiaogang</td><td align="center">3</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">DigitalSonic</td><td align="center">3</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">crazycy</td><td align="center">2</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">Echo</td><td align="center">2</td><td align="center">&#22899;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">seanchan</td><td align="center">2</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">YuLimin</td><td align="center">2</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">YY</td><td align="center">2</td><td align="center">&#22899;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">agile_boy</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">alexchang</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">caoer</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">chentianyi</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">downpour</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">jiaochar</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">junjzheng</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">kuuyee</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">lyfcdy</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">magice</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">mochow</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">pesome</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">yeby</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr><tr><td align="center">&#24046;&#27801;</td><td align="center">1</td><td align="center">&nbsp;</td><td class="auto-generated">&nbsp;</td><td class="auto-generated">&nbsp;</td></tr></tbody></table></div><p>
			</p><p>
				<span class="bold"><b>2007&#24180;10&#26376;31&#26085;</b></span>
			</p><p>&#19968;&#23457;&#24037;&#20316;&#24418;&#21183;&#20173;&#27604;&#36739;&#20005;&#23803;&#21834;&#65306;
</p><p>
&#30001;&#20110;&#19968;&#30452;&#32852;&#31995;&#19981;&#19978;&#26080;&#38177;prajack&#35768;&#26480;&#21516;&#23398;&#65292;&#25925;&#23558;&#20854;&#35797;&#23457;&#30340;&#26435;&#21033;&#21462;&#28040;&#12290;
</p><p>
&#30446;&#21069;&#19968;&#23457;&#26410;&#23436;&#25104;&#30340;&#24773;&#20917;&#22914;&#19979;&#65306;
</p><p>
&#19968;&#23457;&#20013;&#30340;&#26377; &#65304;&#20010;&#65292;&#20173;&#26377;&#65299;&#20010;&#19968;&#23457;&#24037;&#20316;&#31561;&#24453;&#35748;&#39046;&#20013;&#12290;&#20849;&#35745;&#65297;&#65297;&#20010;&#24037;&#20316;&#20219;&#21153;&#65292; &#30456;&#23545;&#20110;&#65299;&#65300;&#20010;&#20219;&#21153;&#32780;&#35328;&#65292;&#29616;&#22312;&#20026;&#27490;&#25165;&#23436;&#25104;&#65302;&#65296;&#65285;&#65292;&#65300;&#21608;&#20043;&#20869;&#35201;&#23436;&#25104;&#30340;&#24418;&#21183;&#36824;&#26159;&#27604;&#36739;&#22256;&#38590;&#21834;&#12290;&#35201;&#21162;&#21147;&#21834;&#65281;&#65281;&#65281;
			</p><p>
				<span class="bold"><b>2007&#24180;11&#26376;05&#26085;</b></span>
			</p><p>&#19968;&#23457;&#32487;&#32493;&#36827;&#34892;&#20013;&#65292;&#24050;&#32463;&#23436;&#25104;&#19968;&#20010;&#65292;&#26032;&#20219;&#21153;&#20063;&#34987;&#35748;&#39046;&#20102;&#19968;&#20010;&#12290;&#29616;&#22312;Seam 2.0.0 GA&#20063;&#20986;&#26469;&#20102;&#65292;&#25105;&#19979;&#36733;&#20102;xml&#25991;&#26723;&#65292;&#23545;&#27604;&#20102;&#19968;&#19979;&#65292;&#20462;&#25913;&#30340;&#22320;&#26041;&#19981;&#22810;&#65292;&#20105;&#21462;&#22312;&#20108;&#23457;&#30340;&#26102;&#20505;&#36827;&#34892;&#21512;&#24182;&#65292;&#21516;&#27493;&#21457;&#24067;&#20013;&#25991;&#29256;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;11&#26376;07&#26085;</b></span>
			</p><p>&#12290;&#12290;&#12290;&#12290;&#12290;&#12290;&#32487;&#32493;&#21162;&#21147;&#24178;&#27963;&#20013;&#12290;&#12290;&#12290;&#12290;&#12290;&#12290; </p><p>
				<span class="bold"><b>2007&#24180;11&#26376;09&#26085;</b></span>
			</p><p>&#19968;&#23457;&#24037;&#20316;&#37117;&#26377;&#21516;&#23398;&#35748;&#39046;&#20102;&#65292;&#21482;&#21097;&#19979;&#20116;&#20010;&#24037;&#20316;&#20219;&#21153;&#23601;&#23436;&#25104;&#19968;&#23457;&#24037;&#20316;&#20102;&#65292;&#25552;&#21069;&#23436;&#25104;&#19968;&#23457;&#30340;&#20840;&#37096;&#24037;&#20316;&#26159;&#32988;&#21033;&#22312;&#26395;&#20102;&#21834;&#12290;&#12290;&#12290;&#21152;&#27833;&#21834;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;11&#26376;11&#26085;</b></span>
			</p><p>&#26412;&#26469;&#26159;&#24819;2007.11.11 11:11:11&#21457;&#24067;&#39044;&#35272;&#29256;&#65292;&#26080;&#22856;&#33410;&#26085;&#21040;&#20102;&#65292;&#20154;&#37117;&#36305;&#20809;&#20102;&#65292;&#20219;&#21153;&#20063;&#23601;&#12290;&#12290;&#12290;&#21704;&#21704;&#21704;&#12290;&#12290;&#12290;11111111111&#33410;&#24555;&#20048;&#12290;&#12290;&#12290;</p><p>
				<span class="bold"><b>2007&#24180;11&#26376;13&#26085;</b></span>
			</p><p>
&#36827;&#23637;&#39034;&#21033;&#65292;&#19968;&#23457;&#24037;&#20316;&#36824;&#26377;&#19968;&#20010;&#23601;&#20840;&#37096;&#23436;&#25104;&#20102;&#65292;&#29616;&#22312;&#24320;&#22987;&#30528;&#25163;&#20934;&#22791;&#39044;&#35272;&#29256;&#30340;&#21457;&#24067;&#19982;&#20108;&#23457;&#30340;&#24037;&#20316;&#20102;&#12290;
			</p><p>
&#20108;&#23457;&#30340;&#24037;&#20316;&#23558;&#20197;&#27491;&#24335;&#29256;&#36827;&#34892;&#21512;&#24182;&#21518;&#24320;&#22987;&#20108;&#23457;&#12290; 
			</p><p>
				<span class="bold"><b>2007&#24180;11&#26376;14&#26085;</b></span>
			</p><p>
				<span class="bold"><b>&#37324;&#31243;&#30865;&#20107;&#20214;&#65306;</b></span>
			</p><p>
&#19968;&#23457;&#24037;&#20316;&#32467;&#26463;&#65292;&#20108;&#23457;&#24037;&#20316;&#20934;&#22791;&#20013;&#65292;&#21512;&#24182;&#21040;&#65319;&#65313;&#29256;&#30340;&#24037;&#20316;&#25105;&#24050;&#32463;&#23436;&#25104;&#20102;&#65292;&#20108;&#23457;&#30340;&#24037;&#20316;&#37319;&#21462;Leader&#20998;&#37197;&#21046;&#65292;&#24182;&#30001;&#20219;&#21153;&#36131;&#20219;&#32773;&#23436;&#25104;&#20219;&#21153;&#12290;
</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h3 class="title"><a name="d0e21593"></a>A.2.3.&nbsp;Seam 2.0 &#27491;&#24335;&#29256;&#24320;&#21457;&#25163;&#20876;&#32763;&#35793;&#39033;&#30446;</h3></div></div><div></div></div><p>
				<span class="bold"><b>2007&#24180;11&#26376;15&#26085;</b></span>
			</p><p>
			&#20108;&#23457;&#21512;&#24182;&#24037;&#20316;&#23436;&#25104;&#65292;&#20108;&#23457;&#30340;&#24037;&#20316;&#24320;&#22987;&#20102;&#12290;&#26368;&#21518;&#19968;&#20851;&#30340;&#23457;&#26680;&#24037;&#20316;&#65292;&#38656;&#35201;&#22312;&#23457;&#26657;&#30340;&#36807;&#31243;&#20013;&#25226;&#19968;&#20123;&#26415;&#35821;&#38598;&#20013;&#20986;&#26469;&#25918;&#21040;&#26415;&#35821;&#34920;&#20013;&#21435;&#12290;
			</p><p>
&#26415;&#35821;&#34920;&#65306;<a href="http://wiki.redsaga.com/confluence/pages/viewpage.action?pageId=1751" target="_top">http://wiki.redsaga.com/confluence/pages/viewpage.action?pageId=1751</a>
			</p><p>
&#27880;&#24847;&#65306;&#35831;&#26356;&#26032;CVS&#30340;&#20869;&#23481;&#65292;&#20108;&#23457;&#26159;&#22312; cn2.0.0GA &#30446;&#24405;&#19979;&#36827;&#34892;&#30340;&#65281;
			</p><p>
				<span class="bold"><b>2007&#24180;11&#26376;17&#26085;</b></span>
			</p><p>
			&#20108;&#23457;&#30340;&#20219;&#21153;&#36824;&#26159;&#27604;&#36739;&#33392;&#24040;&#30340;&#65292;&#25110;&#35768;&#24310;&#26399;&#26159;&#19981;&#21487;&#36991;&#20813;&#30340;&#65292;&#20294;&#26159;&#36136;&#37327;&#25226;&#20851;&#26159;&#31532;&#19968;&#35201;&#32032;&#12290;&#21152;&#27833;&#12290;&#12290;&#12290;
			</p><p>
				<span class="bold"><b>2007&#24180;12&#26376;22&#26085;</b></span>
			</p><p>
			&#22826;&#22810;&#20107;&#24773;&#22826;&#22810;&#35805;&#35201;&#35828;&#20102;&#12290;&#37027;&#23601;&#31616;&#26126;&#25212;&#35201;&#21543;&#65306;&#20908;&#33267;&#33410;&#24555;&#20048;&#65281;&#65281;&#65281; 
			</p><p>
				<span class="bold"><b>2007&#24180;12&#26376;24&#26085;</b></span>
			</p><p>
			&#38750;&#24120;&#39640;&#20852;&#25105;&#20204;&#21448;&#26377;&#20004;&#20301;&#28418;&#20142;&#30340;MM&#65288;&#29579;&#29747;&#12289;&#32993;&#29141;&#65289;&#21152;&#20837;&#25105;&#20204;&#30340;&#32763;&#35793;&#38431;&#20237;&#20013;&#26469;&#20102;&#65292;&#29616;&#22312;&#25105;&#20204;&#30340;&#38431;&#20237;&#21040;&#20102;"&#30007;&#22899;&#25645;&#37197;&#65292;&#24178;&#27963;&#19981;&#32047;"&#30340;&#20849;&#20135;&#20027;&#20041;&#38454;&#27573;&#20102;&#65281;&#65306;&#65289;
			</p><p>
				<span class="bold"><b>2007&#24180;12&#26376;30&#26085;</b></span>
			</p><p>
			&#25152;&#26377;&#30340;&#20108;&#23457;&#24037;&#20316;&#23436;&#25104;&#65292;&#21457;&#24067;RC&#29256;&#65292;&#24863;&#35874;&#25152;&#26377;&#21442;&#21152;&#32763;&#35793;&#19982;&#23457;&#26657;&#30340;&#20804;&#24351;&#22992;&#22969;&#20204;&#65292;&#24863;&#35874;&#19968;&#30452;&#20851;&#27880;&#25105;&#20204;&#32763;&#35793;&#27963;&#21160;&#30340;&#26379;&#21451;&#20204;&#65292;&#35874;&#35874;&#20320;&#20204;&#20102;&#65281;&#65281;&#65281;
			</p><p>
				<span class="bold"><b>2008&#24180;03&#26376;27&#26085;</b></span>
			</p><p>
			&#28385;&#27743;&#32418;&#24320;&#25918;&#25216;&#26415;&#30740;&#31350;&#32452;&#32455;&#21457;&#24067;Seam 2.0&#20013;&#25991;&#25991;&#26723;&#27491;&#24335;&#29256;
			</p>
			&#19977;&#20010;&#26376;&#21069;&#65292;&#25105;&#20204;&#21457;&#24067;&#20102;RC&#29256;&#65292;&#35814;&#35265;&#65306;
			<p>
			<a href="http://yulimin.javaeye.com/blog/151917" target="_top">http://yulimin.javaeye.com/blog/151917</a>
			</p><p>
			&#29616;&#22312;&#25105;&#20204;&#27491;&#24335;&#21457;&#24067;Seam 2.0&#20013;&#25991;&#25991;&#26723;&#27491;&#24335;&#29256;&#65292;&#24076;&#26395;&#23545;&#22823;&#23478;&#26377;&#25152;&#24110;&#21161;&#65292;&#35874;&#35874;&#12290;
			</p><p>
			&#21516;&#26102;&#65292;&#20877;&#27425;&#24863;&#35874;&#29579;&#29747;&#12289;&#39532;&#36234;&#12289;&#26195;&#38050;&#22312;&#21457;&#24067;RC&#29256;&#21518;&#65292;&#23545;&#20840;&#37096;&#35793;&#25991;&#36827;&#34892;&#36890;&#35835;&#65292;&#21457;&#29616;&#24182;&#32416;&#27491;&#20854;&#20013;&#30340;&#38382;&#39064;&#12290;
			</p><p>
			&#34429;&#28982;&#25105;&#20204;&#27491;&#24335;&#23459;&#24067;&#27491;&#24335;&#29256;&#21457;&#24067;&#65292;&#20294;&#26159;&#20063;&#24076;&#26395;&#24191;&#22823;&#26379;&#21451;&#33021;&#22815;&#22312;&#38405;&#35835;&#30340;&#36807;&#31243;&#33509;&#21457;&#29616;&#26377;&#30097;&#38382;&#30340;&#22320;&#26041;&#65292;&#21450;&#26102;&#25552;&#20986;&#26469;&#36827;&#34892;&#35752;&#35770;&#24182;&#21152;&#20197;&#20462;&#27491;&#65292;&#20849;&#21516;&#25552;&#39640;&#25991;&#26723;&#30340;&#36136;&#37327;&#65292;&#20849;&#21516;&#20026;&#24320;&#28304;&#27963;&#21160;&#36129;&#29486;&#33258;&#24049;&#30340;&#19968;&#20221;&#21147;&#37327;&#12290;
			</p><p>
			&#26368;&#21518;&#65292;&#24863;&#35874;&#25152;&#26377;&#21442;&#19982;&#32763;&#35793;&#19982;&#23457;&#26657;&#30340;&#20804;&#24351;&#22992;&#22969;&#20204;&#65292;&#25152;&#26377;&#30340;&#20154;&#21592;&#37117;&#23558;&#33719;&#24471;&#27492;&#27425;&#27963;&#21160;&#30340;&#32426;&#24565;&#19987;&#39064; T-Shirt &#19968;&#20214;&#65281;&#35831;&#22312;&#36825;&#37324;&#36827;&#34892;&#30331;&#35760;&#19982;&#39046;&#21462;&#12290;
			</p><p>
			<a href="http://wiki.redsaga.com/confluence/pages/viewpage.action?pageId=2791" target="_top">http://wiki.redsaga.com/confluence/pages/viewpage.action?pageId=2791</a>
			</p><p>
			&#38169;&#35823;&#38590;&#20813;&#65292;&#26377;&#21017;&#25913;&#20043;&#65292;&#26080;&#21017;&#21152;&#21193;&#65281;
			</p><p>
			&#22312;&#32447;&#38405;&#35835;&#19982;&#19979;&#36733;&#22320;&#22336;&#35814;&#35265;&#65306;
			</p><p>
			<a href="http://wiki.redsaga.com/confluence/display/SeamRef/Home" target="_top">http://wiki.redsaga.com/confluence/display/SeamRef/Home</a>
			</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="dependencies.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">Up</a></td><td width="40%" align="right">&nbsp;</td></tr><tr><td width="40%" align="left" valign="top">Chapter&nbsp;33.&nbsp;&#20381;&#36182;&#21253;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>