<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Appendix&nbsp;F.&nbsp;Spring 2.5&#24320;&#21457;&#25163;&#20876;&#20013;&#25991;&#21270;&#39033;&#30446;</title><link rel="stylesheet" href="html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.60.1"><link rel="home" href="index.html" title="Spring Framework &#24320;&#21457;&#21442;&#32771;&#25163;&#20876;"><link rel="up" href="index.html" title="Spring Framework &#24320;&#21457;&#21442;&#32771;&#25163;&#20876;"><link rel="previous" href="spring-form.tld.html" title="Appendix&nbsp;E.&nbsp;spring-form.tld"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns="http://www.w3.org/TR/xhtml1/transitional" style="background-color:white;border:none;height:73px;border:1px solid black;"><a style="border:none;" href="http://www.springframework.org/" title="The Spring Framework"><img style="border:none;" src="images/xdev-spring_logo.jpg"></a><a style="border:none;" href="http://www.springsource.com/" title="SpringSource"><img style="border:none;position:absolute;padding-top:5px;right:42px;" src="images/springsource-banner-rhs.png"></a></div><div class="appendix" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="translator"></a>Appendix&nbsp;F.&nbsp;Spring 2.5&#24320;&#21457;&#25163;&#20876;&#20013;&#25991;&#21270;&#39033;&#30446;</h2></div></div><div></div></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e44906"></a>F.1.&nbsp;&#22768;&#26126;</h2></div></div><div></div></div><p>Spring&#20013;&#25991;&#21442;&#32771;&#25163;&#20876;&#24471;&#21040;Spring Framework&#24320;&#21457;&#22242;&#38431;&#30340;&#30452;&#25509;&#25480;&#26435;&#21644;&#22823;&#21147;&#30340;&#25903;&#25345;&#65292;&#20854;&#30446;&#30340;&#26159;&#22312;&#20013;&#25991;&#19990;&#30028;&#25512;&#24191;&#20248;&#31168;&#30340;&#24320;&#28304;&#25216;&#26415;&#12290;&#26412;&#27425;&#32763;&#35793;&#27963;&#21160;&#30001;&#28385;&#27743;&#32418;&#24320;&#25918;&#25216;&#26415;&#30740;&#31350;&#32452;&#32455;(<a href="http://www.redsaga.com" target="_top">http://www.redsaga.com</a>)&#21644;Spring&#20013;&#25991;&#35770;&#22363;(<a href="http://spring.jactiongroup.net" target="_top">http://spring.jactiongroup.net</a>)&#20849;&#21516;&#21457;&#36215;&#12289;&#32452;&#32455;&#12290;&#25105;&#20204;&#22312;&#27492;&#37073;&#37325;&#23459;&#24067;&#65292;&#26412;&#27425;&#32763;&#35793;&#36981;&#24490;&#21407;Spring Framework&#30340;&#25480;&#26435;&#21327;&#35758;&#65292;&#21363;Apache 2.0&#21327;&#35758;&#12290;&#22312;&#23436;&#25972;&#20445;&#30041;&#20840;&#37096;&#25991;&#26412;(&#21253;&#25324;&#26412;&#29256;&#26435;&#39029;)&#65292;&#24182;&#19988;&#19981;&#36829;&#21453;Apache 2.0&#21327;&#35758;&#30340;&#21069;&#25552;&#19979;&#65292;&#20801;&#35768;&#21644;&#40723;&#21169;&#20219;&#20309;&#20154;&#36827;&#34892;&#20840;&#25991;&#36716;&#36733;&#21450;&#25512;&#24191;&#65292;&#25152;&#26377;&#21442;&#19982;&#20154;&#21592;&#25918;&#24323;&#38500;&#32626;&#21517;&#26435;&#22806;&#30340;&#19968;&#20999;&#26435;&#21033;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e44917"></a>F.2.&nbsp;&#33268;&#35874;</h2></div></div><div></div></div><p>&#22914;&#27492;&#24222;&#22823;&#30340;&#39033;&#30446;&#19981;&#26159;&#19968;&#20004;&#20010;&#32452;&#32455;&#21487;&#20197;&#29420;&#31435;&#23436;&#25104;&#30340;&#65292;&#23601;&#20687;Spring&#26412;&#36523;&#19968;&#26679;&#65292;&#28085;&#30422;&#20102;Java&#25216;&#26415;&#30340;&#26041;&#26041;&#38754;&#38754;&#12290;&#22240;&#20026;&#26377;&#20102;&#22823;&#23478;&#30340;&#20851;&#24515;&#21644;&#25903;&#25345;&#25165;&#20351;&#27492;&#27425;&#39033;&#30446;&#33021;&#22815;&#39034;&#21033;&#23436;&#25104;&#12290;&#26377;&#29702;&#30001;&#30456;&#20449;&#65292;&#20013;&#25991;&#24320;&#28304;&#19990;&#30028;&#24517;&#23558;&#22312;&#19981;&#20037;&#30340;&#23558;&#26469;&#23637;&#29616;&#20986;&#26356;&#24191;&#38420;&#30340;&#21457;&#23637;&#31354;&#38388;&#65292;&#24076;&#26395;&#22823;&#23478;&#37117;&#33021;&#20026;&#25512;&#21160;&#20013;&#22269;&#36719;&#20214;&#21457;&#23637;&#22857;&#29486;&#20986;&#33258;&#24049;&#30340;&#19968;&#20221;&#21147;&#37327;&#12290;</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e44922"></a>F.3.&nbsp;&#21442;&#19982;&#20154;&#21592;</h2></div></div><div></div></div><p>&#19979;&#34920;&#21015;&#20986;&#30340;&#26159;&#25152;&#26377;&#21442;&#21152;&#26412;&#27425;&#32763;&#35793;&#39033;&#30446;&#30340;&#20154;&#21592;&#21517;&#21333;&#65292;&#25353;&#29031;&#25253;&#21517;&#26102;&#38388;&#20808;&#21518;&#39034;&#24207;&#25490;&#21015;&#12290;&#20854;&#20013;DigitalSonic&#20026;&#39033;&#30446;&#36127;&#36131;&#20154;&#12290;Denis&#22240;&#36523;&#20307;&#21407;&#22240;&#20013;&#36884;&#36864;&#20986;&#65292;&#21516;&#26679;&#23545;&#20182;&#34920;&#31034;&#24863;&#35874;&#12290;</p><div class="table"><a name="d0e44927"></a><p class="title"><b>Table&nbsp;F.1.&nbsp;&#21442;&#19982;&#20154;&#21592;&#21015;&#34920;</b></p><table summary="&#21442;&#19982;&#20154;&#21592;&#21015;&#34920;" width="100%" border="1"><colgroup><col align="center"><col align="center"><col align="center"><col align="center"><col align="center"></colgroup><thead><tr><th align="center">&#32593;&#21517;</th><th align="center">&#22995;&#21517;</th><th align="center">&nbsp;</th><th align="center">&#32593;&#21517;</th><th align="center">&#22995;&#21517;</th></tr></thead><tbody><tr><td align="center">Yanger</td><td align="center">&#26472;&#25096;</td><td align="center">&nbsp;</td><td align="center">Caoxg</td><td align="center">&#26361;&#26195;&#38050;</td></tr><tr><td align="center">DigitalSonic</td><td align="center">&#19969;&#38634;&#20016;</td><td align="center">&nbsp;</td><td align="center">Marco Chen</td><td align="center">&#38472;&#37030;&#23439;</td></tr><tr><td align="center">downpour</td><td align="center">&#38470;&#33311;</td><td align="center">&nbsp;</td><td align="center">joyheros</td><td align="center">&#37011;&#36229;</td></tr><tr><td align="center">jzk</td><td align="center">&#33931;&#33275;&#24698;</td><td align="center">&nbsp;</td><td align="center">whimet</td><td align="center">&#26446;&#24422;&#36745;</td></tr><tr><td align="center">melthaw</td><td align="center">&#24352;&#36784;&#38634;</td><td align="center">&nbsp;</td><td align="center">crazycy</td><td align="center">&#23828;&#27589;</td></tr><tr><td align="center">pesome</td><td align="center">&#24352;&#20426;</td><td align="center">&nbsp;</td><td align="center">zhanglong</td><td align="center">&#24352;&#40857;</td></tr><tr><td align="center">ginge</td><td align="center">&#26893;&#26230;&#26230;</td><td align="center">&nbsp;</td><td align="center">Kxllen</td><td align="center">&#24464;&#22372;</td></tr><tr><td align="center">Jin</td><td align="center">&#37329;&#26143;&#26143;</td><td align="center">&nbsp;</td><td align="center">Java&#31528;&#29399;</td><td align="center">&#38518;&#27426;&#33150;</td></tr><tr><td align="center">Joo</td><td align="center">&#26647;&#30922;</td><td align="center">&nbsp;</td><td align="center">YuLimin</td><td align="center">&#20446;&#40654;&#25935;</td></tr><tr><td align="center">Echo</td><td align="center">&#26472;&#26149;&#33457;</td><td align="center">&nbsp;</td><td align="center">yeshucheng</td><td align="center">&#19975;&#22269;&#36745;</td></tr><tr><td align="center">&#21326;&#20180;</td><td align="center">&#24352;&#38745;&#21326;</td><td align="center">&nbsp;</td><td align="center">Denis</td><td align="center">&#29579;&#23493;&#38050;</td></tr><tr><td align="center">hanson2010</td><td align="center">&#32993;&#28023;&#29983;</td><td align="center">&nbsp;</td><td align="center">88250</td><td align="center">&#19969;&#20142;</td></tr><tr><td align="center">max</td><td align="center">&#23385;&#28009;</td><td align="center">&nbsp;</td><td align="center">&nbsp;</td><td align="center">&nbsp;</td></tr></tbody></table></div><p>
		&#20855;&#20307;&#20219;&#21153;&#20998;&#37197;&#24773;&#20917;&#35814;&#35265;<a href="http://wiki.redsaga.com/confluence/pages/viewpage.action?pageId=2644" target="_top">&#24037;&#20316;&#23433;&#25490;&#21450;&#36827;&#24230;&#27010;&#20917;(Spring 2.5)</a>&#12290;
		</p></div><div class="section" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d0e45081"></a>F.4.&nbsp;&#39033;&#30446;&#21382;&#31243;</h2></div></div><div></div></div><p><span class="bold"><b>2008&#24180;03&#26376;05&#26085;</b></span></p><p>3&#26376;1&#26085;&#65292;&#25105;&#20204;&#36825;&#27425;2.5&#30340;&#32763;&#35793;&#39033;&#30446;&#27491;&#24335;&#21551;&#21160;&#65292;&#22240;&#20026;&#21021;&#27493;&#23450;&#20026;&#20026;&#20869;&#37096;&#39033;&#30446;&#65292;&#25152;&#20197;&#27809;&#26377;&#22312;&#21508;&#22823;&#35770;&#22363;&#19978;&#22823;&#21147;&#23459;&#20256;&#65292;&#21482;&#26159;&#22312;&#37038;&#20214;&#21015;&#34920;&#20013;&#21457;&#20102;&#23553;&#37038;&#20214;&#12290;&#39033;&#30446;&#36827;&#24230;&#27719;&#24635;&#30340;&#26085;&#26399;&#23450;&#22312;&#20102;&#27599;&#21608;&#30340;&#21608;&#19977;&#21644;&#21608;&#20845;&#65292;&#20170;&#22825;&#27491;&#22909;&#26159;&#31532;&#19968;&#27425;&#27719;&#24635;&#65292;&#24688;&#24039;&#36214;&#19978;&#20102;&#23398;&#38647;&#38155;&#26085;&#65292;&#25105;&#24819;&#25105;&#20204;&#30340;&#39033;&#30446;&#20063;&#24212;&#35813;&#31639;&#26159;&#23398;&#38647;&#38155;&#20102;&#21543;&#65292;&#21621;&#21621;&#12290;</p><p>&#25130;&#33267;&#20170;&#22825;&#20026;&#27490;&#19968;&#20849;&#26377;9&#20154;&#21442;&#21152;&#65292;&#21478;&#22806;&#20170;&#22825;&#19979;&#21320;&#36824;&#25910;&#21040;&#20102;&#20004;&#23553;&#26469;&#33258;&#32452;&#22806;&#30340;&#25253;&#21517;&#37038;&#20214;&#65292;&#25105;&#24050;&#22238;&#22797;&#12290;&#24635;&#20849;45&#20010;&#20219;&#21153;&#26465;&#65292;&#24050;&#34987;&#39046;&#21462;21&#20010;&#65292;&#36824;&#26410;&#26377;&#20154;&#22635;&#20889;&#36827;&#24230;&#24773;&#20917;&#65292;&#20272;&#35745;&#22823;&#23478;&#36824;&#26410;&#24320;&#22987;&#24037;&#20316;&#21543;&#12290;</p><p>&#24076;&#26395;&#26377;&#26356;&#22810;&#30340;&#21516;&#23398;&#33021;&#22815;&#21442;&#21152;&#21040;&#36825;&#27425;&#30340;&#39033;&#30446;&#20013;&#65292;&#31215;&#26497;&#25253;&#21517;&#65292;&#20105;&#21462;&#33021;&#26089;&#26085;&#39640;&#36136;&#37327;&#22320;&#23436;&#25104;&#25152;&#26377;&#30340;&#24037;&#20316;&#65292;&#35753;&#26356;&#22810;&#20154;&#33021;&#20139;&#21463;&#21040;&#25105;&#20204;&#30340;&#21171;&#21160;&#25104;&#26524;&#65374;</p><p><span class="bold"><b>2008&#24180;03&#26376;08&#26085;</b></span></p><p>&#19979;&#21322;&#21608;&#36215;&#25105;&#20204;&#24320;&#22987;&#25509;&#21463;&#25253;&#21517;&#65292;&#35753;&#25105;&#22987;&#26009;&#26410;&#21450;&#30340;&#26159;&#25253;&#21517;&#30340;&#37038;&#20214;&#23601;&#20687;&#38634;&#33457;&#19968;&#26679;&#39128;&#26469;&#65292;&#20063;&#35768;&#26159;Spring&#30340;&#22823;&#37327;&#24212;&#29992;&#20351;&#20154;&#20204;&#24320;&#22987;&#20851;&#27880;Spring&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#26377;&#36234;&#26469;&#36234;&#22810;&#30340;&#20154;&#24076;&#26395;&#33021;&#20026;&#24320;&#28304;&#31038;&#21306;&#20570;&#20986;&#19968;&#20123;&#36129;&#29486;&#65292;&#36825;&#26159;&#20214;&#20540;&#24471;&#39640;&#20852;&#30340;&#20107;&#24773;&#12290;</p><p>&#20808;&#27426;&#36814;&#19968;&#19979;&#20004;&#20301;&#26032;&#36827;&#25104;&#21592;zhanglong&#21644;ginge&#65292;&#30446;&#21069;&#24050;&#26377;24&#20010;&#20219;&#21153;&#26465;&#24050;&#34987;&#35748;&#39046;&#65292;&#36825;&#21608;&#30340;&#20027;&#35201;&#24037;&#20316;&#26159;&#25509;&#21463;&#22823;&#23478;&#30340;&#25253;&#21517;&#65292;&#35748;&#39046;&#20219;&#21153;&#65292;&#20174;&#19979;&#21608;&#36215;&#24076;&#26395;&#22823;&#23478;&#33021;&#24320;&#22987;&#27491;&#24335;&#22320;&#32763;&#35793;&#65292;&#24182;&#21450;&#26102;&#22312;&#21608;&#19977;&#26202;&#22635;&#20889;&#33258;&#24049;&#30340;&#36827;&#24230;&#12290;</p><p>&#22312;&#24320;&#22987;&#21069;&#35831;&#35775;&#38382;http://wiki.redsaga.com/confluence/pages/viewpage.action?pageId=2679&#65292;&#25105;&#20889;&#20102;&#19968;&#20123;&#27880;&#24847;&#20107;&#39033;&#12290;&#36825;&#27425;&#26159;&#38024;&#23545;&#21407;2.0&#29256;&#26412;&#25991;&#26723;&#30340;&#20462;&#35746;&#65292;&#25152;&#20197;&#24076;&#26395;&#22823;&#23478;&#33021;&#23613;&#21487;&#33021;&#22320;&#21033;&#29992;&#29616;&#26377;&#30340;&#36164;&#28304;&#65292;&#38500;&#20102;&#25913;&#21160;&#36739;&#22823;&#30340;&#37096;&#20998;&#21644;&#26032;&#22686;&#20869;&#23481;&#22806;&#65292;&#23613;&#37327;&#19981;&#35201;&#20174;&#38646;&#24320;&#22987;&#32763;&#35793;&#12290;</p><p><span class="bold"><b>2008&#24180;03&#26376;12&#26085;</b></span></p><p>&#36825;&#21608;&#21152;&#20837;&#20102;&#19981;&#23569;&#26032;&#25104;&#21592;&#65292;&#39318;&#20808;&#35753;&#25105;&#20204;&#29992;&#25484;&#22768;&#27426;&#36814;Kxllen&#12289;Jin&#12289;Java&#31528;&#29399;&#21644;Joo&#65292;&#36824;&#26377;&#19968;&#20123;&#25253;&#21517;&#32773;&#23578;&#26410;&#22238;&#22797;&#35797;&#35793;&#20869;&#23481;&#65292;&#30456;&#20449;&#25105;&#20204;&#30340;&#38431;&#20237;&#36824;&#20250;&#19981;&#26029;&#22766;&#22823;&#30340;&#12290;</p><p>&#25130;&#33267;&#30446;&#21069;&#20026;&#27490;&#65292;45&#20010;&#20219;&#21153;&#26465;&#20013;&#30340;38&#20010;&#24050;&#34987;&#35748;&#39046;&#65292;&#24076;&#26395;&#21516;&#23398;&#20204;&#21450;&#26102;&#26356;&#26032;&#36827;&#24230;&#65292;&#24076;&#26395;&#21608;&#20845;&#30340;&#20219;&#21153;&#36827;&#24230;&#27719;&#24635;&#21069;&#21508;&#20301;&#33021;&#21578;&#30693;&#21508;&#33258;&#30340;&#36827;&#24230;&#12290;</p><p>&#21478;&#22806;&#65292;&#20877;&#27425;&#37325;&#30003;&#65292;&#35831;&#22823;&#23478;&#20180;&#32454;&#38405;&#35835;&#20219;&#21153;&#20998;&#37197;&#34920;&#26684;&#19979;&#30340;&#35828;&#26126;&#20197;&#21450;&#26412;&#27425;&#39033;&#30446;&#30340;&#27880;&#24847;&#20107;&#39033;&#65292;&#26368;&#36817;&#25105;&#38500;&#20102;&#22788;&#29702;&#25253;&#21517;&#30456;&#20851;&#20107;&#23452;&#23601;&#26159;&#22312;&#32500;&#25252;&#20219;&#21153;&#20998;&#37197;&#30340;&#34920;&#26684;&#12290;</p><p><span class="bold"><b>2008&#24180;03&#26376;15&#26085;</b></span></p><p>&#25353;&#29031;&#24815;&#20363;&#65292;&#35753;&#22823;&#23478;&#20808;&#26469;&#27426;&#36814;&#19968;&#19979;&#26032;&#25104;&#21592;&#65292;YuLimin&#12289;Echo&#12289;yeshucheng&#21644;&#21326;&#20180;&#65292;&#21496;&#20196;&#30340;&#21152;&#30431;&#35753;&#25105;&#20204;&#30340;&#25112;&#26007;&#21147;&#22823;&#22823;&#21152;&#24378;&#12290;</p><p>&#25130;&#27490;&#33267;&#20170;&#26085;&#65292;&#24050;&#26377;40&#20010;&#20219;&#21153;&#26465;&#34987;&#35748;&#39046;&#65292;crazycy&#30340;&#31532;18&#31456;&#36716;&#30001;yeshucheng&#36127;&#36131;&#12290;&#20004;&#21608;&#36807;&#21435;&#20102;&#65292;&#22823;&#23478;&#20284;&#20046;&#36824;&#26410;&#36827;&#20837;&#29366;&#24577;&#65292;&#36825;&#27425;&#26377;&#28857;&#24930;&#28909;&#21734;&#65374;</p><p><span class="bold"><b>2008&#24180;03&#26376;19&#26085;</b></span></p><p>&#26412;&#21608;&#22823;&#37096;&#20998;&#35748;&#39046;&#30340;&#31456;&#33410;&#37117;&#24320;&#22987;&#20102;&#32763;&#35793;&#24037;&#20316;&#65292;&#20174;&#36827;&#24230;&#34920;&#19978;&#21487;&#20197;&#30475;&#21040;&#22823;&#23478;&#30340;&#24037;&#20316;&#36824;&#26159;&#39047;&#26377;&#25104;&#25928;&#30340;&#65292;&#24050;&#26377;5&#20010;&#20219;&#21153;&#26465;&#23436;&#25104;&#65292;11&#20010;&#22788;&#20110;&#36827;&#34892;&#20013;&#65292;&#21478;&#22806;&#37096;&#20998;&#20219;&#21153;&#26465;&#24050;&#32463;&#35810;&#38382;&#36807;&#36827;&#24230;&#65292;&#22522;&#26412;&#37117;&#22312;&#36827;&#34892;&#20013;&#12290;</p><p>&#24076;&#26395;&#22823;&#23478;&#33021;&#22815;&#21450;&#26102;&#26356;&#26032;&#36827;&#24230;&#65292;&#26356;&#26032;&#26102;&#35831;&#27880;&#24847;&#26684;&#24335;&#65292;&#26041;&#20415;&#27719;&#24635;&#65307;&#21478;&#22806;&#65292;&#23545;&#20110;&#32763;&#35793;&#23436;&#27605;&#30340;xml&#25991;&#20214;&#35831;&#22312;&#26412;&#22320;&#25191;&#34892;&#26500;&#24314;&#36890;&#36807;&#21518;&#25552;&#20132;&#33267;cvs&#12290;</p><p><span class="bold"><b>2008&#24180;03&#26376;22&#26085;</b></span></p><p>&#36825;&#20960;&#22825;&#21152;&#20837;&#20102;&#19968;&#21517;&#26032;&#25104;&#21592;Denis&#65292;&#22823;&#23478;&#40723;&#25484;&#27426;&#36814;&#19968;&#19979;&#65374;&#20004;&#20250;&#32467;&#26463;&#20102;&#65292;&#20063;&#35768;&#22823;&#23478;&#37117;&#21435;&#23398;&#20064;&#22823;&#20250;&#31934;&#31070;&#20102;&#65292;&#25152;&#20197;&#24536;&#35760;&#20102;&#25552;&#20132;&#21508;&#33258;&#30340;&#36827;&#24230;&#65292;&#21621;&#21621;&#12290;&#25130;&#33267;&#20170;&#26202;11&#28857;&#65292;8&#20010;&#20219;&#21153;&#26465;&#24050;&#32463;&#23436;&#25104;&#65292;&#36824;&#26377;4&#20010;&#20219;&#21153;&#26465;&#26410;&#34987;&#35748;&#39046;&#65292;&#24773;&#20917;&#36824;&#31639;&#19981;&#38169;&#65292;&#24076;&#26395;&#33021;&#22312;&#19979;&#21608;&#23436;&#25104;&#22823;&#22810;&#25968;&#30340;&#32763;&#35793;&#20219;&#21153;&#65374;</p><p><span class="bold"><b>2008&#24180;03&#26376;26&#26085;</b></span></p><p>&#30446;&#21069;&#20026;&#27490;45&#20010;&#20219;&#21153;&#26465;&#24050;&#23436;&#25104;15&#20010;&#65292;11&#20010;&#22788;&#20110;&#36827;&#34892;&#20013;&#65292;&#30475;&#26679;&#23376;&#32763;&#35793;&#30340;&#21608;&#26399;&#21487;&#33021;&#20250;&#26377;&#25152;&#24310;&#38271;&#65292;&#24076;&#26395;&#20960;&#20301;&#22810;&#26085;&#26410;&#28014;&#20986;&#27700;&#38754;&#30340;&#21516;&#23398;&#33021;&#22312;&#28508;&#27700;&#30340;&#38388;&#38553;&#38706;&#20010;&#33080;&#65292;&#20197;&#20415;&#25105;&#33021;&#20102;&#35299;&#32763;&#35793;&#30340;&#24773;&#20917;&#12290;&#27492;&#22806;&#65292;&#20877;&#27425;&#24378;&#35843;&#19968;&#19979;&#65292;&#24076;&#26395;&#22823;&#23478;&#37117;&#33021;&#23558;&#32763;&#35793;&#30340;&#36136;&#37327;&#25918;&#22312;&#31532;&#19968;&#20301;&#65292;&#22312;&#20445;&#35777;&#36136;&#37327;&#30340;&#21069;&#25552;&#19979;&#26089;&#26085;&#23436;&#25104;&#20219;&#21153;&#65292;&#23558;&#27599;&#19968;&#20221;&#20316;&#21697;&#37117;&#25171;&#36896;&#25104;&#32463;&#20856;&#65374;</p><p><span class="bold"><b>2008&#24180;03&#26376;29&#26085;</b></span></p><p>&#36825;&#21608;&#21448;&#26377;3&#21517;&#26032;&#25104;&#21592;&#21152;&#20837;&#65292;&#20998;&#21035;&#26159;hanson2010&#12289;88250&#21644;max&#65292;&#25105;&#20204;&#30340;&#38431;&#20237;&#21448;&#22766;&#22823;&#20102;&#65292;&#30446;&#21069;&#20849;&#26377;25&#21517;&#25104;&#21592;&#65374;&#25152;&#26377;&#30340;&#32763;&#35793;&#20219;&#21153;&#24050;&#20840;&#37096;&#39046;&#21462;&#65292;&#22914;&#26080;&#24847;&#22806;&#65292;&#24076;&#26395;&#19979;&#21608;&#33021;&#23436;&#25104;&#22823;&#22810;&#25968;&#31456;&#33410;&#30340;&#32763;&#35793;&#65292;&#36827;&#20837;&#19968;&#23457;&#38454;&#27573;&#12290;</p><p><span class="bold"><b>2008&#24180;04&#26376;02&#26085;</b></span></p><p>&#26152;&#22825;&#26159;&#24858;&#20154;&#33410;&#65292;Rod Johnson&#21644;&#25105;&#20204;&#22823;&#23478;&#24320;&#20102;&#20010;&#29609;&#31505;----SpringSource&#23459;&#24067;&#34987;&#24494;&#36719;&#25910;&#36141;&#65292;InfoQ&#19978;&#36824;&#24456;&#20687;&#22238;&#20107;&#30340;&#25253;&#36947;&#20102;&#65292;&#25226;&#24456;&#22810;&#20154;&#37117;&#39575;&#20102;&#19968;&#25226;&#8230;&#8230;&#36825;&#21608;&#23545;&#19968;&#20123;&#20219;&#21153;&#30340;&#36827;&#23637;&#20570;&#20102;&#19979;&#20102;&#35299;&#65292;&#25152;&#26377;&#31456;&#33410;&#22343;&#24050;&#22312;&#32763;&#35793;&#20013;&#65292;&#20854;&#20013;21&#20010;&#24050;&#23436;&#25104;&#65292;12&#20010;&#32763;&#35793;&#36807;&#21322;&#65292;&#20854;&#20182;&#24212;&#35813;&#37117;&#33021;&#22312;&#26412;&#21608;&#26411;&#23436;&#25104;&#65292;&#19979;&#21608;&#23558;&#27491;&#24335;&#21551;&#21160;&#19968;&#23457;&#30340;&#24037;&#20316;&#65292;&#24076;&#26395;&#22823;&#23478;&#20173;&#33021;&#32487;&#32493;&#20197;&#26497;&#39640;&#30340;&#28909;&#24773;&#25237;&#36523;&#20854;&#20013;&#65374;</p><p><span class="bold"><b>2008&#24180;04&#26376;05&#26085;</b></span></p><p>&#19979;&#21608;&#24320;&#22987;&#25105;&#20204;&#30340;&#24037;&#20316;&#23558;&#36827;&#20837;&#19968;&#23457;&#30340;&#27969;&#31243;&#65292;&#22240;&#20026;&#36825;&#27425;&#30340;&#32763;&#35793;&#20027;&#35201;&#26159;&#23545;2.0&#30340;&#20462;&#35746;&#65292;&#25152;&#20197;&#19968;&#23457;&#30340;&#24037;&#20316;&#20027;&#35201;&#26159;&#23545;&#26377;&#21464;&#26356;&#30340;&#22320;&#26041;&#36827;&#34892;&#26657;&#23545;&#65292;&#20108;&#23457;&#20027;&#35201;&#36890;&#35835;&#35793;&#25991;&#65292;&#24182;&#21435;&#38500;XML&#20013;&#30340;&#21407;&#25991;&#20449;&#24687;&#12290;&#36824;&#26377;&#19968;&#20123;&#31456;&#33410;&#30340;&#32763;&#35793;&#24037;&#20316;&#27809;&#26377;&#32467;&#26463;&#65292;&#30446;&#21069;&#24050;&#26377;26&#20010;&#20219;&#21153;&#23436;&#25104;&#65292;12&#20010;&#20219;&#21153;&#23436;&#25104;&#36807;&#21322;&#65292;&#35831;&#25152;&#26377;&#39046;&#21462;&#20102;&#32763;&#35793;&#20219;&#21153;&#30340;&#21516;&#23398;&#33021;&#22312;&#19979;&#21608;&#23436;&#25104;&#25163;&#22836;&#30340;&#24037;&#20316;&#12290;</p><p><span class="bold"><b>2008&#24180;04&#26376;12&#26085;</b></span></p><p>&#36825;&#21608;Wiki&#22312;&#21608;&#19977;&#20986;&#29616;&#20102;&#28857;&#38382;&#39064;&#23548;&#33268;&#19968;&#27573;&#26102;&#38388;&#26080;&#27861;&#35775;&#38382;&#65292;&#32473;&#22823;&#23478;&#24102;&#26469;&#20102;&#20123;&#19981;&#20415;&#65292;&#22909;&#22312;&#29616;&#22312;&#19968;&#20999;&#37117;&#24674;&#22797;&#27491;&#24120;&#21862;&#65374;&#36825;&#21608;&#21333;&#29420;&#32852;&#31995;&#20102;&#19968;&#20123;&#25163;&#22836;&#36824;&#26377;&#32763;&#35793;&#20219;&#21153;&#30340;&#21516;&#23398;&#65292;&#20840;&#37096;&#34920;&#31034;&#33021;&#22312;&#36825;&#21608;&#23436;&#25104;&#65292;&#24076;&#26395;&#33021;&#22815;&#19968;&#20999;&#39034;&#21033;&#12290;</p><p>&#25105;&#20204;&#30340;&#19968;&#23457;&#24050;&#32463;&#24320;&#22987;&#20102;&#65292;&#24076;&#26395;&#22823;&#23478;&#33021;&#22815;&#20808;&#39046;&#21462;&#24050;&#23436;&#25104;&#32763;&#35793;&#30340;&#37096;&#20998;&#36827;&#34892;&#19968;&#23457;&#65292;&#20105;&#21462;&#26089;&#26085;&#23436;&#25104;&#25152;&#26377;&#30340;&#20219;&#21153;&#12290;</p><p><span class="bold"><b>2008&#24180;04&#26376;19&#26085;</b></span></p><p>&#19968;&#23457;&#30340;&#20219;&#21153;&#24050;&#32463;&#24320;&#22987;&#38470;&#32493;&#34987;&#39046;&#21462;&#20102;&#65292;&#32780;&#32763;&#35793;&#30340;&#20219;&#21153;&#20063;&#22522;&#26412;&#20840;&#37096;&#23436;&#25104;&#20102;&#65292;&#35874;&#35874;&#22823;&#23478;&#36825;&#27573;&#26102;&#38388;&#30340;&#21162;&#21147;&#65292;&#24076;&#26395;&#33021;&#26089;&#26085;&#23436;&#25104;&#25152;&#26377;&#30340;&#26657;&#23545;&#24037;&#20316;~</p><p>Denis&#21516;&#23398;&#21069;&#38453;&#23376;&#29983;&#30149;&#36824;&#19981;&#24536;&#25163;&#22836;&#30340;&#20219;&#21153;&#65292;&#22823;&#23478;&#31069;&#20182;&#26089;&#26085;&#24247;&#22797;&#12290;</p><p><span class="bold"><b>2008&#24180;04&#26376;26&#26085;</b></span></p><p>&#36825;&#21608;&#65292;&#38500;&#20102;Denis&#30340;&#23567;&#20219;&#21153;&#22806;&#65292;&#20854;&#20182;&#30340;&#32763;&#35793;&#22343;&#20197;&#23436;&#25104;&#65292;&#26657;&#23545;&#20219;&#21153;&#30340;&#39046;&#21462;&#24037;&#20316;&#20063;&#22312;&#39034;&#21033;&#36827;&#34892;&#12290;&#21478;&#22806;&#65292;&#21644;&#19968;&#20123;&#21516;&#23398;&#35752;&#35770;&#20102;&#19968;&#19979;&#65292;&#37492;&#20110;&#36825;&#27425;&#30340;&#24037;&#20316;&#22823;&#37096;&#20998;&#22522;&#20110;&#21407;&#20808;2.0&#30340;&#32763;&#35793;&#20043;&#19978;&#65292;&#20915;&#23450;&#21512;&#24182;&#19968;&#23457;&#21644;&#20108;&#23457;&#65292;&#21363;&#21482;&#36827;&#34892;&#19968;&#27425;&#26657;&#23545;&#65292;&#25152;&#20197;&#35831;&#26657;&#23545;&#30340;&#21516;&#23398;&#22312;&#26657;&#23545;&#23436;&#25104;&#21518;&#65292;&#21435;&#38500;&#21407;&#25991;&#65292;&#22312;&#26816;&#26597;&#32763;&#35793;&#27491;&#30830;&#24615;&#30340;&#21516;&#26102;&#30041;&#24515;&#19968;&#19979;&#35821;&#21477;&#30340;&#36890;&#39034;&#24615;&#65292;&#26412;&#22320;&#32534;&#35793;&#36890;&#36807;&#21518;&#25552;&#20132;CVS&#12290;</p><p><span class="bold"><b>2008&#24180;05&#26376;03&#26085;</b></span></p><p>&#20116;&#19968;&#30340;&#23567;&#38271;&#20551;&#36807;&#24471;&#36824;&#30495;&#26159;&#24555;&#21568;&#65292;&#19968;&#30504;&#30524;&#21151;&#22827;&#23601;&#32467;&#26463;&#20102;&#65292;&#26126;&#22825;&#22823;&#23478;&#21448;&#24471;&#19978;&#29677;&#20102;&#12290;&#12290;&#12290;&#21407;&#35745;&#21010;&#20013;&#25105;&#20204;&#30340;&#39033;&#30446;&#24212;&#35813;&#26159;&#22312;4&#26376;&#24213;&#32467;&#26463;&#65292;5&#26376;&#21021;&#21457;&#24067;&#30340;&#65292;&#20294;&#29616;&#22312;&#30475;&#26469;&#20284;&#20046;&#24471;&#35201;&#24310;&#26399;&#20102;&#65292;&#25130;&#33267;&#30446;&#21069;&#20026;&#27490;&#65292;&#20849;16&#20010;&#20219;&#21153;&#24050;&#32463;&#23436;&#25104;&#65292;15&#20010;&#20219;&#21153;&#27491;&#22312;&#26657;&#23545;&#20013;&#65292;&#21097;&#19979;15&#20010;&#23578;&#26410;&#39046;&#21462;&#65292;&#22823;&#23478;&#37117;&#35201;&#21152;&#27833;&#21679;&#65281;</p><p>&#21478;&#22806;&#65292;&#21457;&#29616;&#19968;&#20123;&#21516;&#23398;&#22312;&#23436;&#25104;&#20102;&#32763;&#35793;&#21518;&#27809;&#26377;&#21450;&#26102;&#23558;&#25991;&#20214;&#25552;&#20132;&#33267;CVS&#20013;&#65292;&#30446;&#21069;&#26377;&#20960;&#20010;&#31456;&#33410;&#20173;&#28982;&#26159;&#21407;&#25991;&#65292;&#35831;&#22823;&#23478;&#33021;&#22815;&#27880;&#24847;&#21450;&#26102;&#25552;&#20132;&#12290;</p><p><span class="bold"><b>2008&#24180;05&#26376;10&#26085;</b></span></p><p>&#25105;&#20204;&#26368;&#21518;&#21152;&#20837;2.5&#32763;&#35793;&#22242;&#38431;&#30340;max&#21516;&#23398;&#19968;&#20154;&#23436;&#25104;&#20102;12&#20010;&#20219;&#21153;&#26465;&#30340;&#26657;&#23545;&#65292;&#22823;&#23478;&#25484;&#22768;&#21709;&#36215;&#26469;&#65281;</p><p>&#30446;&#21069;&#26657;&#23545;&#24037;&#20316;&#24050;&#23436;&#25104;&#20102;30&#20010;&#20219;&#21153;&#26465;&#65292;6&#20010;&#36827;&#34892;&#20013;&#65292;&#36824;&#26377;10&#20010;&#26410;&#35748;&#39046;&#65292;&#22823;&#23478;&#23601;&#19968;&#21475;&#27668;&#25226;&#23427;&#20204;&#37117;&#35299;&#20915;&#21543;&#65292;&#25105;&#22909;&#20687;&#30475;&#21040;&#32988;&#21033;&#30340;&#26329;&#20809;&#20102;&#65292;&#21621;&#21621;&#12290;</p><p><span class="bold"><b>2008&#24180;05&#26376;17&#26085;</b></span></p><p>&#35753;&#25105;&#20204;&#20026;&#22235;&#24029;&#28798;&#21306;&#30340;&#20154;&#20204;&#36865;&#19978;&#25105;&#20204;&#30340;&#31069;&#31119;&#65292;&#21521;&#22859;&#25112;&#22312;&#25937;&#28798;&#21069;&#32447;&#30340;&#20154;&#20204;&#33268;&#25964;&#65281;&#65281;&#65281;</p><p><span class="bold"><b>2008&#24180;05&#26376;25&#26085;</b></span></p><p>&#25105;&#20204;&#21097;&#20313;&#30340;&#30340;&#20960;&#20010;&#31456;&#33410;&#37117;&#24050;&#22788;&#22312;&#20914;&#21050;&#38454;&#27573;&#65292;&#19979;&#21608;&#23601;&#26159;&#20116;&#26376;&#30340;&#26368;&#21518;&#19968;&#21608;&#65292;&#22823;&#23478;&#20105;&#21462;&#33021;&#22312;&#20845;&#26376;&#23436;&#25104;&#25152;&#26377;&#30340;&#26657;&#23545;&#21457;&#24067;&#26368;&#32456;&#25991;&#26723;&#12290;</p><p><span class="bold"><b>2008&#24180;06&#26376;01&#26085;</b></span></p><p>&#20170;&#22825;&#26159;&#20799;&#31461;&#33410;&#65292;&#31069;&#25152;&#26377;&#30340;&#23567;&#26379;&#21451;&#20197;&#21450;&#31461;&#24515;&#26410;&#27887;&#30340;&#22823;&#26379;&#21451;&#20204;&#33410;&#26085;&#24555;&#20048;&#21704;&#65374;&#65374;</p><p>&#20986;&#29616;&#20102;&#28857;&#23567;&#24847;&#22806;&#65292;zhanglong&#36127;&#36131;&#30340;&#19977;&#20010;&#31456;&#33410;&#30001;&#20110;&#20043;&#21069;&#24536;&#20102;&#25552;&#20132;&#65292;&#32780;&#20182;&#20986;&#24046;&#30340;&#26102;&#38388;&#21448;&#19968;&#20877;&#21152;&#38271;&#65292;&#27809;&#21150;&#27861;&#25552;&#20132;&#65292;&#25152;&#20197;&#36825;&#21608;&#24320;&#22987;&#37325;&#26032;&#32763;&#35793;&#12290;&#12290;&#12290;&#30495;&#26159;&#20010;&#19981;&#24184;&#30340;&#28040;&#24687;&#12290;&#19981;&#36807;&#25105;&#20204;&#36824;&#26159;&#20105;&#21462;&#20845;&#26376;&#32467;&#26463;&#25152;&#26377;&#24037;&#20316;&#65292;&#22823;&#23478;&#35201;&#22909;&#22909;&#21152;&#27833;&#20102;&#21734;&#65281;&#65281;</p><p><span class="bold"><b>2008&#24180;06&#26376;08&#26085;</b></span></p><p>&#31471;&#21320;&#33410;&#21040;&#20102;&#65292;&#22823;&#23478;&#33410;&#26085;&#24555;&#20048;&#65292;&#35760;&#24471;&#35201;&#21507;&#31933;&#23376;&#21734;&#65374;&#65374;</p><p><span class="bold"><b>2008&#24180;06&#26376;15&#26085;</b></span></p><p>&#26412;&#21608;&#31532;3&#31456;&#30340;&#26657;&#23545;&#24037;&#20316;&#20840;&#37096;&#23436;&#25104;&#20102;&#65292;&#37325;&#26032;&#32763;&#35793;&#30340;&#31532;4&#31456;&#21644;&#31532;5&#31456;&#20063;&#24050;&#32763;&#35793;&#23436;&#27605;&#65292;&#19979;&#21608;&#24320;&#22987;&#26657;&#23545;&#12290;&#20026;&#20102;&#20445;&#35777;&#33021;&#22312;6&#26376;&#24213;&#23436;&#25104;&#65292;&#29616;&#23558;&#31532;8&#31456;&#19968;&#20998;&#20026;&#20108;&#65292;&#30001;zhanglong&#19982;pesome&#36827;&#34892;&#32763;&#35793;&#12290;&#35753;&#25105;&#20204;&#20026;&#25152;&#26377;&#20173;&#22859;&#26007;&#22312;&#25112;&#32447;&#19978;&#30340;&#21516;&#23398;&#40723;&#25484;&#21543;&#65374;</p><p><span class="bold"><b>2008&#24180;06&#26376;22&#26085;</b></span></p><p>&#31163;&#35745;&#21010;&#21457;&#24067;&#30340;&#26085;&#23376;&#36234;&#26469;&#36234;&#36817;&#20102;&#65292;&#22909;&#22312;&#19968;&#20999;&#36824;&#31639;&#39034;&#21033;&#65292;&#26412;&#21608;&#23436;&#25104;&#20102;&#31532;4&#31456;&#21644;&#31532;5&#31456;&#30340;&#26657;&#23545;&#65292;&#31532;8&#31456;&#20173;&#22312;&#32763;&#35793;&#20013;&#12290;&#30001;&#20110;&#24847;&#22806;&#23548;&#33268;&#39033;&#30446;&#24310;&#26399;&#23454;&#23646;&#26080;&#22856;&#65292;&#20294;&#21516;&#23398;&#20204;&#37117;&#24456;&#21162;&#21147;&#65292;&#24076;&#26395;&#33021;&#22815;&#22312;&#26376;&#24213;&#23436;&#25104;&#25152;&#26377;&#30340;&#20219;&#21153;&#65292;&#21516;&#26102;&#20570;&#22909;&#21457;&#24067;&#30340;&#20934;&#22791;&#30340;&#12290;</p><p><span class="bold"><b>2008&#24180;06&#26376;30&#26085;</b></span></p><p>&#26126;&#22825;&#65292;Spring Framework 2.5&#24320;&#21457;&#21442;&#32771;&#25163;&#20876;&#20013;&#25991;&#29256;&#32456;&#20110;&#35201;&#27491;&#24335;&#21457;&#24067;&#20102;&#65292;&#32463;&#36807;&#20102;&#23558;&#36817;4&#20010;&#26376;&#30340;&#19981;&#25032;&#21162;&#21147;&#65292;&#22823;&#23478;&#36763;&#33510;&#20102;&#65281;&#24863;&#35874;&#25152;&#26377;&#21442;&#19982;&#32763;&#35793;&#19982;&#26657;&#23545;&#30340;&#21516;&#23398;&#65292;&#24403;&#28982;&#36824;&#35201;&#35874;&#35874;&#25152;&#26377;&#20851;&#24515;&#21644;&#25903;&#25345;&#26412;&#27425;&#39033;&#30446;&#30340;&#20154;&#20204;&#65292;&#35874;&#35874;&#22823;&#23478;&#65374;</p></div></div><div xmlns="http://www.w3.org/TR/xhtml1/transitional" class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="spring-form.tld.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right">&nbsp;</td></tr><tr><td width="40%" align="left" valign="top">Appendix&nbsp;E.&nbsp;spring-form.tld&nbsp;</td><td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="http://www.springsource.com/" title="SpringSource">Sponsored by SpringSource</a></span></td><td width="40%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>